Repository: Anitha489/arcade_book
Catalog: locale/*/LC_MESSAGES/chapters/03_setup/setup.po
Languages: de

source: Setting Up Your System
de: Richte dein System ein

source: Before you begin, you need to install a few things on the computer. Using a school computer? You may have these already installed. Yay! Still, read through this part. Make sure you know how the computer is setup up.
de: Bevor du anfangen kannst, musst du ein paar Sachen auf dem Rechner installieren. Verwendest du einen Schulrechner? Ja! Lese trotzdem diesen Abschnitt, um sicher zu gehen, dass du weißt, wie der Rechner eingerichtet wird.

source: Getting a system set up and ready to program can be a bit frustrating. **Don't give up.** Once you've got a system set up for programming you don't need to think about it again. You can concentrate on the programming part. You may get stuck during the setup, so don't hesitate to reach out and get help.
de: Das System einzurichten, damit man damit programmieren kann, kann etwas frustrierend sein. **Gib nicht auf!** Wenn das System zum Programmieren eingerichtet ist, brauchst du nicht mehr darüber nachdenken. Du kannst dich auf das Programmieren konzentrieren. Es kann sein, dass du beim Einrichten nicht mehr weiter kommst. Scheue dich in diesem Fall nicht Hilfe bei anderen zu suchen.

source: Your development computer will need:
de: Dein Entwicklungsrechner benötigt:

source: The Python_ programming language and the Arcade_ code library.
de: Die Python_ Programmiersprache und die Arcade_-Code-Bibliothek.

source: An editor to type in your programs. (We'll use a program called PyCharm_. You can use the community edition for free, or if you have an email address that ends in ``.edu`` get can get a free `student license`_ for the professional version.)
de: Einen Editor mit dem du deine Programme eingibst. (Wir verwenden ein Programm, das sich PyCharm_ nennt. Du kannst du Community Edition kostenfrei benutzen. Oder, wenn du eine E-Mail-Adresse hast, die auf ``.edu`` endet, eine kostenfreie `student license`_ für die professionelle Version bekommen.)

source: A version control system to track and turn in your work. (Git/SourceTree_/BitBucket_)
de: Ein Versionskontrollsystem um deine Arbeit zu verfolgen und einzureichen. (Git/Sourcetree_/BitBucket_)

source: A minor configuration tweak so we can see file extensions.
de: Eine kleine Anpassung der Konfiguration, so dass wir die Dateiendungen sehen.

source: Let's go through these four items in detail.
de: Lass uns durch diese vier Punkte im einzelnen gehen.

source: Setup the Programming Environment
de: Einrichten der Programmierumgebung

source: To get your computer ready for programming, we need to install Python, some Python libraries, and an editor.
de: Um den Rechner programmierbereit einzurichten, müssen wir Python, ein paar Python-Bibliotheken und einen Editor installieren.

source: Installing Python and Arcade
de: Installation von Python und Arcade

source: We will be using the "Python_" computer programming language. The creator of Python was a fan of `Monty Python`_, hence the name.
de: Wir werden die Programmiersprache "Python_" verwenden. Guido van Rossum, der Schöpfer von Python, war ein großer Fan von `Monty Python`_ und wählte deshalb diesen Namen.

source: In addition to the Python language, we are going to use a library of commands for drawing on the screen. This is called the "Arcade" library.
de: Zusätzlich zur Sprache Python brauchen wir noch eine Bibliothek mit Anweisungen zum Zeichnen auf den Bildschirm. Dies ist die Arcade-Bibliothek.

source: Installation for installing Python and the Arcade library are available below:
de: Für die verschiedenen Betriebssysteme gibt es folgende Anleitungen:

source: `Windows Installation <http://arcade.academy/installation_windows.html>`_ (Make sure to read the instructions carefully. Do not skip the "Add Python to Path" step. This seems to be the most frequent issue.)
de: `Windows Installation <http://arcade.academy/installation_windows.html>`_ (Lies die Anweisungen sorgfältig. Lass den Schritt "Add Python to Path" auf keinen Fall aus. Das scheint in den meisten Fällen die Ursache von Problemen zu sein.)

source: `Mac Installation <http://arcade.academy/installation_mac.html>`_
de: `OS X Installation <http://arcade.academy/installation_mac.html>`_

source: Installing an IDE
de: Installation einer IDE

source: We also need an editor. Python comes with an editor called IDLE, but it is awful and not worth using. We'll use an editor called PyCharm.
de: Wir benötigen auch einen Editor. Python wird ausgeliefert mit einem Editor, der IDLE genannt wird. Der ist aber fürchterlich und nicht wert verwendet zu werden. Wir verwenden einen Editor, der PyCharm genannt wird.

source: PyCharm is a powerful program that lets you do more than just edit the program, it also includes a large set of tools that programmers need. This type of environment is called an **Integrated Development Environment**, or **IDE** for short.
de: PyCharm ist ein mächtiges Programm, dass dich mehr als nur ein Programm eingeben lässt. Es bringt eine Menge von Werkzeugen mit, die ein Programmierer benötigt. Diese Art von Programmierumgebung wird **Integrated Development Environment** oder kurz **IDE** genannt.

source: Download and install PyCharm_. You can use their community edition for free. We won't use the features in the professional edition. If you decide to pick the professional edition anyway, you'll need a license to use it. But licenses are free for educational use! If you have an e-mail that ends in ``.edu`` you can ask for a `student license`_. It can be used on a school computer, or on your own computer.
de: Lade und installiere PyCharm_. Du kannst die Community Edition kostenfrei verwenden. Wir werden keine Besonderheiten der professionellen Version verwenden. Wenn du trotzdem die professionelle Version wählst, wirst du eine Lizenz benötigen. Die Lizenzen kosten nichts für schulische Zwecke! Wenn du eine E-Mail-Adresse hast, die in ``.edu`` endet, kannst du um eine `student licence`_ bitten. Sie kann auf einem Schulrechner oder deinem eigenen verwendet werden.

source: What is a text editor? What is an IDE? Read more at `Understanding and Choosing Text Editors`_.
de: Was ist ein Texteditor? Was ist eine IDE? Mehr findest du unter `Understanding and Choosing Text Editors`_.

source: Viewing File Extensions
de: Dateiendungen anzeigen

source: It is a great idea to change your windows configuration to show file extensions. A file usually has a name like Book ``report.docx`` where the ``.docx`` tells the computer it is a Microsoft Word compatible document. By default Windows hides the ``.docx`` extension if there is a program installed to handle it. If you are programming, this hiding part of the file name can be annoying.
de: Es ist eine gute Idee Windows so einzustellen, dass es Dateiendungen anzeigt. Üblicherweise hat eine Datei einen Namen wie ``report.docx``, wobei ``.docx`` dem Rechner sagt, dass es ein mit Microsoft Word kompatibles Dokument ist. Standardmäßig versteckt Windows die ``.docx``-Endung, wenn es ein Programm installiert ist, das dafür zuständig ist. Beim Programmieren kann das Verstecken der Dateiendung nerven.

source: For Windows 8 and 10, bring up a file explorer by hitting the Windows-E key. Then click the "view" tab and make sure "File name extensions" has been checked.
de: Drücke Windows-E auf der Tastatur unter Windows 8 und 10 um den Datei-Explorer zu öffnen. Klicke dann auf den "Ansicht"-Reiter und überprüfe, dass "Dateinamenerweiterung" gesetzt ist.
