Repository: Anitha489/arcade_book
Catalog: locale/*/LC_MESSAGES/chapters/08_functions/functions.po
Languages: de

source: Creating Functions
de: Funktionen erstellen

source: Creating Simple Functions
de: Einfache Funktionen erstellen

source: Defining a function is rather easy.
de: Eine Funktion zu definieren ist recht einfach.

source: Start with the keyword ``def``, which is short for "define."
de: Fange mit dem Schlüsselwort ``def``, kurz für *define*, an.

source: Next, give the function a name. There are rules for function names. They must:
de: Als nächstes gib der Funktion einen Namen. Es gibt Regeln für Funktionsnamen.

source: Start with a lower case letter.
de: Sie müssen mit einem Kleinbuchstaben anfangen.

source: After the first letter, only use letters, numbers, and underscores.
de: Nach dem ersten Buchstaben dürfen nur weitere Buchstaben, Ziffern und der Unterstrich folgen.

source: Spaces are not allowed. Use underscores instead.
de: Leerzeichen sind nicht erlaubt. Verwende stattdessen Unterstriche.

source: While upper-case letters can be used, function names are normally all lower-case.
de: Obwohl Großbuchstaben erlaubt sind, bestehen Funktionsnamen normalerweise nur aus Kleinbuchstaben.

source: After that, we have a set of parenthesis. Inside the parenthesis will go **parameters**. We'll explain those in a bit.
de: Danach folgt ein Klammernpaar. In das Klammernpaar kommen die **Parameter**. Wir erklären das in Kürze.

source: Next, a colon.
de: Danach ein Doppelpunkt.

source: Everything that is part of the function will be indented four spaces.
de: Alles was Teil der Funktion ist, wird vier Leerzeichen weit eingerückt.

source: Usually we start a function with a multi-line comment that explains what the function does.
de: Üblicherweise starten wir eine Funktion mit einem mehrzeiligen Kommentar, der erklärt, was die Funktion tut.

source: Function definitions go *below* the ``import`` statements, and *above* the rest of the program. While you can put them somewhere else, you shouldn't.
de: Funktionsdefinition gehören hinter die ``import``-Anweisungen und vor den Rest des Programms. Du könntest sie auch woanders hinschreiben, aber das solltest du nicht tun.

source: Below is a program that defines and uses the function twice.
de: Unten findest du ein Programm, das eine Funktion definiert und zweimal verwendet.

source: You can define and use multiple functions. But all function definitions should go before the main code.
de: Du kannst mehrere Funktionen definieren und verwenden, aber alle Funktionen sollten vor dem Hauptprogramm stehen.

source: Actually, almost *all* code should go in a function. It is a good practice to put the main starting point of your program in a function called ``main`` and call it.
de: Es sollte sogar fast der gesamte Programmcode in Funktionen stehen. Es gehört zu einer vorbildlichen Vorgehensweise, den Startpunkt deines Programms in eine Funktion namens ``main`` zu packen und aufzurufen,

source: An even better way of writing this is with a check to make sure we are trying to run this file, and not import it. The statement for this looks a little weird. In fact, it is weird enough I just look it up and copy/paste it any time I want to use it. Don't worry about understanding how it works yet.
de: Eine noch bessere Vorgehensweise ist zu prüfen, ob wir die Datei ausführen und nicht importieren wollen. Die Anweisung dazu sieht etwas seltsam aus. Sie ist tatsächlich seltsam genug, dass ich sie jedes mal mit Kopieren und Einfügen verwende. Mach dir keine Sorgen, wenn du noch nicht verstehst, wie das funktioniert.

source: Taking In Data
de: Daten übernehmen

source: Functions are even more powerful if we have them take in data.
de: Funktionen sind noch leistungsfähiger, wenn wir sie Daten übernehmen lassen.

source: Here is a simple example that will take in a number and print it. Notice how I've created a new variable ``my_number`` in between the parenthesis. This variable will be given whatever value is passed in. In the example below, it is given first a ``55``, then ``25``, and finally a ``5``.
de: Hier ist ein einfaches Beispiel, das eine Zahl übernimmt und ausgibt. Beachte, dass wir zwischen den Klammern eine neue Variable ``my_number`` erstellt haben. Diese Variable bekommt den Wert, der beim Funktionsaufruf mitgegeben wird. Im Beispiel unten bekommt sie erst den Wert ``55``, dann ``25`` und schließlich ``5``.

source: You can pass in multiple numbers, just separate them with a comma.
de: Du kannst mehrere Zahlen übergeben, trenne sie einfach mit einem Komma.

source: Occasionally, new programmers want to set the number values inside the function. This is wrong. Then the function would only work for those values. The power is in specifying the numbers outside the function. We don't want the function to be limited to only certain data values.
de: Manchmal möchten Anfänger die Zahlenwerte innerhalb der Funktion festlegen. Das ist falsch, denn dann würde die Funktion nur mit diesen Werten funktionieren. Die Leistungsfähigkeit liegt darin, die Werte außerhalb der Funktion festlegen zu können. Wir wollen nicht, dass die Funktion nur auf bestimmte Werte beschränkt ist.

source: Returning and Capturing Values
de: Werte zurückgeben und weiterverarbeiten

source: Functions can not only take in values, functions can return values.
de: Funktionen können nicht nur Werte übernehmen. Sie können auch Werte zurückgeben.

source: Returning values
de: Werte zurückgeben

source: For example:
de: Zum Beispiel:

source: Function that returns two numbers added together
de: Eine Funktion, die zwei Werte addiert

source: Note: Return is not a function, and does not use parentheses. Don't do ``return(result)``.
de: Beachte: ``return`` ist keine Funktion und verwendet keine Klammern. Schreibe nicht ``return(result)``.

source: This only gets us half-way there. Because if we call the function now, not much happens. The numbers get added. They get returned to us. But we do nothing with the result.
de: Das ist aber erst die Hälfte der Wahrheit. Wenn wir jetzt die Funktion aufrufen, passiert nicht viel. Die Zahlen werden addiert. Sie werden auch an uns zurückgegeben, aber wir machen nichts mit dem Ergebnis.

source: Capturing Returned Values
de: Zurückgegeben Wert weiterverarbeiten

source: We need to capture the result. We do that by setting a variable equal to the value the function returned:
de: Wir müssen das Ergebnis übernehmen. Wir erreichen das, indem wir eine Variable auf den zurückgegebenen Funktionswert setzen.

source: Now the result isn't lost. It is stored in `my_result` which we can print or use some other way.
de: Jetzt geht das Ergebnis nicht mehr verloren. Es wird in ``my_result`` gespeichert, diese Variable können wir ausgeben oder in einer anderen Form verwenden.

source: Volume Cylinder Example
de: Beispiel Zylindervolumen

source: Function that returns the volume of a cylinder
de: Eine Funktion, die das Volumen eines Zylinders zurückgibt

source: Because of the return, this function could be used later on as part of an equation to calculate the volume of a six-pack like this:
de: Weil sie ein ``return`` beinhaltet, kann die Funktion später als Teil einer Formel zum Berechnen des Volumens eines Six-Packs wie folgt verwendet werden:

source: The value returned from volume_cylinder goes into the equation and is multiplied by six.
de: Der von ``volume_cylinder`` zurückgegebene Wert kommt in die Formel und wird mit sechs multipliziert.

source: There is a big difference between a function that prints a value and a function that returns a value. Look at the code below and try it out.
de: Es gibt einen großen Unterschied zwischen einer Funktion, die einen Wert ausgibt, und einer, die einen Wert zurück gibt. Sieh dir den Code unten an und probiere es aus.

source: When first working with functions it is not unusual to get stuck looking at code like this:
de: Wenn man zum ersten Mal mit Funktionen arbeitet, ist es nicht ungewöhnlich, dass an Programmcode wie dem folgenden hängen bleibt.

source: How do we print the result of calculate_average? The program can't print result because that variable only exists inside the function. Instead, use a variable to capture the result:
de: Wie geben wir das Ergebnis der Funktion ``calculate_average`` aus? Das Programm kann das Ergebnis nicht ausgeben, weil die Variable nur innerhalb der Funktion existiert. Verwende stattdessen eine Variable um das Ergebnis aufzunehmen.

source: Documenting Functions
de: Funktionen dokumentieren

source: Functions in Python typically have a comment as the first statement of the function. This comment is delimited using three double quotes, and is called a docstring. A function may look like:
de: Funktionen in Python haben typischerweise einen Kommentar als erste Anweisung in einer Funktion. Dieser Kommentar wird durch dreifache Anführungszeichen eingefasst. Er wird Docstring genannt. Eine Funktion kann wie folgt aussehen:

source: The great thing about using docstrings in functions is that the comment can be pulled out and put into a website documenting your code using a tool like Sphinx. Most languages have similar tools that can help make documenting your code a breeze. This can save a lot of time as you start working on larger programs.
de: Das Großartige an den Docstrings in Funktionen ist, dass der Kommentar mit einem Werkzeug wie Sphinx heraus geholt werden und in eine Webseite zur Dokumentation deines Programmcodes eingefügt werden kann. Die meisten Sprachen haben ähnliche Werkzeuge, die dir erleichtern deinen Programmcode zu dokumentieren. Dies kann dir eine Menge Arbeit ersparen, wenn du an größeren Programmen arbeitest.

source: Variable Scope
de: Gültigkeitsbereich von Variablen

source: The use of functions introduces the concept of scope. Scope is where in the code a variable is "alive" and can be accessed. For example, look at the code below:
de: Zur Verwendung von Funktionen gibt es die Gültigkeitsbereiche (englisch *scope*) von Variablen. Ein Gültigkeitsbereich einer Variablen ist der Abschnitt im Programmcode, in dem die Variable "lebendig" ist und darauf zugegriffen werden kann. Sieh dir den Programmcode unten als Beispiel an:

source: The last line will generate an error because x only exists inside of the f() function. The variable is created when ``f()`` is called and the memory it uses is freed as soon as ``f()`` finishes.
de: Die letzte Zeile wird einen Fehler generieren, weil ``x`` nur innerhalb der Funktion ``f()`` existiert. Die Variable wird erzeugt, wenn ``f()`` aufgerufen wird und der Speicher wird freigegeben, sobald der Aufruf von ``f()`` endet.

source: Here's where it gets complicated. A more confusing rule is accessing variables created outside of the ``f()`` function. In the following code, x is created before the ``f()`` function, and thus can be read from inside the ``f()`` function.
de: Hier ist der Punkt, an dem es kompliziert wird. Eine noch verwirrendere Regel ist, wie auf Variablen, die außerhalb von ``f()`` deklariert wurden, zugegriffen wird. Im folgenden Programmcode wird ``x`` erzeugt bevor ``f()`` definiert wird und kann deshalb innerhalb von ``f()`` gelesen werden.

source: Variables created ahead of a function may be read inside of the function only if the function does not change the value. This code, very similar to the code above, will fail. The computer will claim it doesn't know what x is.
de: Variablen, die vor einer Funktion definiert wurden, können in der Funktion gelesen werden, nur wenn die Funktion den Wert nicht ändert. Dieser Programmcode, der dem Programmcode oben sehr ähnelt, wird fehlschlagen. Der Rechner wird behaupten, dass er nicht weiß, was ``x`` ist.

source: Other languages have more complex rules around the creation of variables and scope than Python does. Because Python is straight-forward it is a good introductory language.
de: Andere Sprachen haben kompliziertere Regeln zur Erstellung von Variablen und deren Gültigkeitsbereiche als Python. Weil Python so geradeaus ist, ist es eine gute Anfängersprache.

source: Pass-by-Copy
de: Als Kopie übergeben

source: Functions pass their values by creating a copy of the original. For example:
de: Funktionen bekommen ihre Werte als Kopie des Originals übergeben. Zum Beispiel:

source: The value of y does not change, even though the f() function increases the value passed to it. Each of the variables listed as a parameter in a function is a brand new variable. The value of that variable is copied from where it is called.
de: Der Wert von ``y`` ändert sich nicht, obwohl die Funktion den übergebenen Wert erhöht. Jede der als Parameter angegeben Variablen in einer Funktion ist eine brandneue Variable. Der Wert der Variablen wird beim Aufruf kopiert.

source: This is reasonably straight forward in the prior example. Where it gets confusing is if both the code that calls the function and the function itself have variables named the same. The code below is identical to the prior listing, but rather than use y it uses x.
de: Im Beispiel oben ist das einigermaßen schlüssig. Es wird richtig verwirrend, wenn sowohl der Programmcode, der die Funktion aufruft, als auch die Funktion selbst Variablen mit gleichem Namen haben. Der Programmcode unten ist der gleiche wie oben, aber er verwendet ``y`` statt ``x``.

source: The output is the same as the program that uses y. Even though both the function and the surrounding code use x for a variable name, there are actually two different variables. There is the variable x that exists inside of the function, and a different variable x that exists outside the function.
de: Die Ausgabe ist die gleiche wie vorher. Obwohl die Funktion und der umgebende Code ``x`` als Variablennamen verwenden, sind es doch tatsächlich zwei verschiedene Variablen. Die eine Variable ``x`` existiert innerhalb der Funktion. Die andere Variable ``x`` existiert außerhalb der Funktion.

source: Functions Calling Functions
de: Funktionen rufen Funktionen auf

source: For each of the examples below, think about what would print. Check to see if you are right. If you didn't guess correctly, spend to the time to understand why.
de: Überlege dir bei jedem der Beispiele unten, was es ausgeben wird. Überprüfe, ob du recht hattest. Wenn du falsch lagst, verwende Zeit darauf zu verstehen warum.

source: Example 1
de: Beispiel 1

source: In this example, note that if you don't use a function, it doesn't run.
de: Beachte in diesem Beispiel, dass eine Funktion nur ausgeführt wird, wenn sie auch aufgerufen wird.

source: Example 2
de: Beispiel 2

source: Example 3
de: Beispiel 3

source: Example 4
de: Beispiel 4

source: Example 5
de: Beispiel 5

source: Example 6
de: Beispiel 6

source: While line 3 of this example increases ``x``, the ``x`` variable in the function is a different variable than the ``x`` that is in the rest of the program. So that ``x`` never changes.
de: In Zeile 3 dieses Beispiel wird der Wert von ``x`` inkrementiert. Da aber die Variable ``x`` in der Funktion eine andere Variable ist, als ``x`` im Rest des Programms, ändert sich der angezeigte Wert nicht.

source: Example 7
de: Beispiel 7

source: This example is similar to the prior example, but we ``return x`` at the end. Turns out, it doesn't matter. Because we never do anything with the return value. So the global variable ``x`` still doesn't increase. See the next example.
de: In diesem Beispiel, das dem vorherigen ähnelt, geben wir ``x`` zurück. Es zeigt sich, dass das keinen Unterschied macht, da wir mit dem Rückgabewert nichts machen. Die globale Variable ``x`` erhöht sich immer noch nicht. Sieh dir das nächste Beispiel an.

source: Example 8
de: Beispiel 8

source: This example take the value returned from ``a`` and stores it back into ``x``. How? By doing ``x = a(x)`` instead of just ``a(x)``.
de: In diesem Beispiel nehmen wir den von ``a()`` zurückgegebenen Wert und speichern ihn in der Variablen ``x``. Wie? Durch Schreiben von ``x = a(x)`` statt nur ``a(x)``.

source: Example 9
de: Beispiel 9

source: Example 10
de: Beispiel 10

source: While you can have two ``return`` statements in a function, once you hit the first ``return`` the function ends. In this case, ``return y`` never runs, because we already returned from the function in the prior line.
de: Obwohl man mehrere ``return``-Anweisungen in einer Funktion haben kann, endet die Funktion mit dem ersten ``return``. In diesem Beispiel wird ``return y`` niemals ausgeführt, wir von der Funktion schon in der Zeile davor zurückgekehrt sind.

source: Example 11
de: Beispiel 11

source: This is not something you can do in every programming language. You can return two values by using a comma and listing them.
de: Dies ist etwas, das man nicht in jeder Programmiersprache machen kann. Du kannst zwei Werte auf einmal zurückgeben, indem du sie mit einem Komma getrennt angibst.

source: Example 12
de: Beispiel 12

source: If you return two values out of a function, you can capture them this way.
de: Wenn du zwei Werte aus einer Funktion zurück gibst, kannst du sie in dieser vor weiterverarbeiten.

source: Example 13
de: Beispiel 13

source: Example 14
de: Beispiel 14

source: We will talk more about these next two examples when we talk about "lists" and "classes" later. These examples don't operate like you might expect at first. Take a look and see what is different. We'll explain why it works differently later.
de: Wir werden mehr über die nächsten beiden Beispiele reden, wenn wir "Listen" und "Klassen" behandeln. Diese Beispiele funktionieren nicht so, wie du das vielleicht zuerst erwartest. Sieh dir an, was unterschiedlich ist. Wir werden später erklären, warum dies anders funktioniert.

source: Example 15
de: Beispiel 15
