Repository: Anitha489/arcade_book
Catalog: locale/*/LC_MESSAGES/labs/lab_02_drawing/drawing.po
Languages: de

source: Lab 2: Draw a Picture
de: Übung 2: Zeichne ein Bild

source: Your assignment: Draw a pretty picture. The goal of this lab is to get practice using functions to draw, and introduce computer graphics.
de: Deine Aufgabe: Zeichne ein hübsches Bild. Das Ziel dieser Übung ist es, Erfahrung mit den Zeichenfunktionen zu sammeln und in die Rechnergrafik einzuführen.

source: Requirements
de: Anforderungen

source: To get full credit:
de: Um volle Punkte zu erreichen:

source: Use the same project and repository that you used for Lab 01. If you forked your repository from mine, you should already have a folder for lab 2. Use that folder, and the ``lab_02.py`` file inside. Otherwise create one.
de: Verwende dasselbe Projekt und Repository, das du für Übung 1 verwendet hast. Wenn du dein Repository von meinem geforkt hast, solltest du schon den Ordner lab 2 für die Übung 2 haben. Verwende diesen Ordner und die Datei ``lab_02.py`` darin. Erzeuge sie andernfalls.

source: You must use multiple colors.
de: Du musst mehrere Farben verwenden.

source: You must have a coherent picture. I am not interested in abstract art with random shapes.
de: Du musst ein schlüssiges Bild erstellen. Mich interessiert keine abstrakte Kunst mit zufälligen Formen.

source: You must use multiple types of graphic functions (e.g. circles, rectangles, lines, etc.)
de: Du musst verschiedene Arten von Zeichenfunktionen verwenden (zum Beispiel Kreise, Rechtecke, Linien und so weiter).

source: Use blank lines in the code to break up sections. For example, when drawing a tree, put a blank line ahead of, and after.
de: Du musst Leerzeilen verwenden, um den Code in Abschnitte aufzuteilen. Wenn du zum Beispiel einen Baum zeichnest, schreibe eine Leerzeile davor und dahinter.

source: Use comments effectively. For example, when drawing a tree, put a comment at the start of those drawing commands that says ``# Draw a tree``. Remember to put one space after the ``#`` sign.
de: Kommentiere sinnvoll. Wenn du zum Beispiel einen Baum zeichnest, dann schreibe einen Kommentar an den Anfang der Zeichenbefehle, die sagen ``# Draw a tree``. (Wem Englisch nicht so liegt, der kann die Kommentare auch in Deutsch schreiben.) Denke daran nach der Raute (``#``) ein Leerzeichen zu lassen.

source: Put spaces after commas for proper "style."
de: Füge ein Leerzeichen nach Satzzeichen ein, damit es "ordentlich" aussieht.

source: Tips
de: Tipps

source: To select new colors use:
de: Um neue Farben auszuwählen, verwende:

source: Copy the values for Red, Green, and Blue. Do not worry about colors for hue, Saturation, or Brilliance.
de: Kopiere die Werte für Red, Green und Blue. Kümmere dich nicht um die Werte für Hue, Saturation oder Brilliance.

source: Please use comments and blank lines to make it easy to follow your program. If you have 5 lines that draw a robot, group them together with blank lines above and below. Then add a comment at the top telling the reader what you are drawing.
de: Verwende bitte Kommentare und Leerzeilen, um dein Programm leicht nachvollziehbar zu machen. Wenn du in fünf Zeilen einen Roboter zeichnest, gruppiere sie zusammen mit Leerzeilen davor und danach. Füge dann einen Kommentar am Anfang der Gruppierung hinzu, der dem Leser sagt, was du zeichnest.

source: Keep in mind the order of code. Shapes drawn first will be at the "back." Shapes drawn later will be drawn on top of the other shapes.
de: Denke an die Reihenfolge im Programmcode. Formen, die zuerst gezeichnet werden, werden "hinten" stehen. Formen, die später gezeichnet werden, werden über die anderen Formen gezeichnet.

source: Looking for ideas? At the page below, each time you refresh the page I show various images created by students from prior years:
de: Suchst du Ideen? Auf der Seite unten zeige ich dir bei jeder Aktualisierung verschiedene Bilder, die Studierende in den Vorjahren erstellt haben:

source: Also, remember you can look up the available commands, called the "API" at:
de: Denke auch daran, dass du die verfügbaren Kommandos, "API" genannt, unter der folgenden Adresse findest:

source: Also, here is an example program that shows you what I'm looking for:
de: Hier ist auch ein Beispielprogramm, das dir zeigt, was ich erwarte:

source: Here are some images from prior years:
de: Hier sind ein paar Bilder aus den Vorjahren:

source: To flip through the images, click the prev/next buttons above the image. The prev/next buttons below navigate between the different labs.
de: Klicke auf Vorwärts-/Rückwärts-Knöpfe über den Bildern, um durch die Bilder zu blättern. Die Vorwärts-/Rückwärts-Knöpfe unter den Bildern navigieren zwischen den verschiedenen Übungen.

source: Turn In
de: Abgeben

source: Refer back to :ref:`git-quick-ref` for a reminder on how to turn in this lab.
de: Gehe zurück zu :ref:`git-quick-ref` für eine Erinnerung daran, wie du die Lösung abgeben sollst.
