Repository: Anitha489/arcade_book
Catalog: locale/*/LC_MESSAGES/chapters/27_sorting/sorting.po
Languages: de

source: Sorting
de: Sortieren

source: Binary searches only work on lists that are in order. So how do programs get a list in order? How does a program sort a list of items when the user clicks a column heading, or otherwise needs something sorted?
de: Die binäre Suche funktioniert nur bei Listen, die in der richtigen Reihenfolge sind. Wie können Programme eine Liste in der richtigen Reihenfolge erstellen? Wie sortiert ein Programm eine Liste von Elementen, wenn der Benutzer auf eine Spaltenüberschrift klickt oder auf andere Weise etwas Sortiertes benötigt?

source: There are several algorithms that do this. The two easiest algorithms for sorting are the *selection sort* and the *insertion sort*. Other sorting algorithms exist as well, such as the shell, merge, heap, and quick sorts.
de: Dafür gibt es mehrere Algorithmen. Die zwei einfachsten Algorithmen zum Sortieren sind *Selectionsort* und *Insertionsort*. Es gibt auch andere Sortieralgorithmen wie Shellsort, Mergesort, Heapsort und Quicksort.

source: The best way to get an idea on how these sorts work is to watch them. To see common sorting algorithms in action visit this excellent website:
de: Der beste Weg, um eine Vorstellung davon zu bekommen, wie diese Sortieralgorithmen funktionieren, ist, sie zu beobachten. Um die gängigen Sortieralgorithmen in Aktion zu sehen, besuche diese hervorragende Website:

source: Each sort has advantages and disadvantages. Some sort a list quickly if the list is almost in order to begin with. Some sort a list quickly if the list is in a completely random order. Other lists sort fast, but take more memory. Understanding how sorts work is important in selecting the proper sort for your program.
de: Jeder Sortieralgorithmus hat Vor- und Nachteile. Einige sortieren eine Liste schnell, wenn die Liste fast in richtigen Reihenfolge ist. Einige sortieren eine Liste schnell, wenn die Liste in einer völlig zufälligen Reihenfolge vorliegt. Andere Listen werden schnell sortiert, benötigen jedoch mehr Speicher. Es ist wichtig zu verstehen, wie Sortieralgorithmen funktionieren, um den richtigen Algorithmus für ein Programm auszuwählen.

source: Swapping Values
de: Werte vertauschen

source: Before learning to sort, we need to learn how to swap values between two variables. This is a common operation in many sorting algorithms. Suppose a program has a list that looks like the following:
de: Bevor wir sortieren lernen, müssen wir lernen, wie Werte von zwei Variablen gegeneinander ausgetauscht werden. Dies ist eine übliche Operation in vielen Sortieralgorithmen. Angenommen, ein Programm hat eine Liste, die wie folgt aussieht:

source: The developer wants to swap positions 0 and 2, which contain the numbers 15 and 14 respectively. See Figure 18.1.
de: Der Entwickler möchte die Elemente an den Positionen 0 und 2 tauschen, die die Zahlen 15 beziehungsweise 14 enthalten. Siehe Abbildung 18.1.

source: Figure 27.1: Swapping values in an array
de: Abbildung 18.1: Werte in einem Array austauschen

source: A first attempt at writing this code might look something like this:
de: Ein erster Versuch, diesen Code zu schreiben, könnte ungefähr so ​​aussehen:

source: Figure 27.2: Incorrect attempt to swap array values
de: Abbildung 18.2: Falscher Versuch, Array-Werte auszutauschen

source: See Figure 27.2 to get an idea on what would happen. This clearly does not work. The first assignment ``list[0] = list[2]`` causes the value 15 that exists in position 0 to be overwritten with the 14 in position 2 and irretrievably lost. The next line with ``list[2] = list[0]`` just copies the 14 back to cell 2 which already has a 14.
de: In Abbildung 18.2 erhalten wir eine Vorstellung davon, was passieren würde. Dies funktioniert eindeutig nicht. Die erste Zuweisung ``list[0] = list[2]`` bewirkt, dass der in Position 0 vorhandene Wert 15 mit dem Wert 14 in Position 2 überschrieben wird und unwiederbringlich verloren geht. Die nächste Zeile mit ``list[2] = list[0]`` kopiert die 14 einfach zurück in Zelle 2, die bereits eine 14 enthält.

source: To fix this problem, swapping values in an array should be done in three steps. It is necessary to create a temporary variable to hold a value during the swap operation. See Figure 18.3. The code to do the swap looks like the following:
de: Um dieses Problem zu beheben, sollte man die Werte in einem Array in drei Schritten austauschen. Es ist erforderlich, eine temporäre Variable zu erstellen, um einen Wert während der Austauschoperation zu speichern. Siehe Abbildung 18.3. Der Code für den Austausch sieht folgendermaßen aus:

source: Swapping two values in an array
de: Zwei Werte in einem Array vertauschen

source: The first line copies the value of position 0 into the ``temp`` variable. This allows the code to write over position 0 with the value in position 2 without data being lost. The final line takes the old value of position 0, currently held in the ``temp`` variable, and places it in position 2.
de: Die erste Zeile kopiert den Wert von Position 0 in die Variable ``temp``. Dadurch kann der Code die Position 0 mit dem Wert in Position 2 überschreiben, ohne dass Daten verloren gehen. Die letzte Zeile nimmt den alten Wert von Position 0, der derzeit in der Variablen ``temp`` enthalten ist, und platziert ihn an Position 2.

source: Figure 27.3: Correct method to swap array values
de: Abbildung 18.3: Richtige Methode zum Austauschen von Array-Werten

source: The selection by looking at element 0. Then code next scans the rest of the list from element 1 to n-1 to find the smallest number. The smallest number is swapped into element 0. The code then moves on to element 1, then 2, and so forth. Graphically, the sort looks like Figure 18.4.
de: Der Algorithmus beginnt mit dem Betrachten des Elements 0. Anschließend durchsucht der Code noch den Rest der Liste von Element 1 bis n-1, um die kleinste Zahl zu finden in der Liste zu finden. Die kleinste Zahl wird mit dem Element 0 getauscht. Jetzt steht die kleinste Zahl an der Position 0. Der Rest der Liste ist noch unsortiert. Der Algorithmus sucht dann das kleinste Element in der Restliste und beginnt die Suche mit dem Element 1, dann zu 2 und so weiter. Graphisch sieht die Sortierung wie in Abbildung 18.4 aus.

source: Figure 27.4: Selection Sort
de: Abbildung 18.4: Selectionsort

source: The code for a selection sort involves two nested loops. The outside loop tracks the current position that the code wants to swap the smallest value into. The inside loop starts at the current location and scans to the right in search of the smallest value. When it finds the smallest value, the swap takes place.
de: Der Code für Selectionsort besteht aus zwei verschachtelten Schleifen. Die äußere Schleife verfolgt die aktuelle Position, in die der kleinste Wert kommen soll. Die innere Schleife beginnt an der aktuellen Position und sucht nach dem kleinsten Wert nach rechts. Wenn die innere Schleife den kleinsten Wert gefunden hat, vertauscht der Algorithmus den Wert an der aktuellen Position mit dem Wert an der Position mit dem kleinsten Wert.

source: The outside loop will always run :math:`n` times. The inside loop will run an average of :math:`\frac{n}{2}` times per run of the outside loop. Therefore the inside loop will run a total of :math:`n \cdot \frac{n}{2}` or :math:`\frac{n^2}{2}` times.
de: Die äußere Schleife läuft immer :math:`n` mal. Die innere Schleife wird durchschnittlich :math:`\frac{n}{2}` mal pro Lauf der äußeren Schleife ausgeführt. Daher wird die innere Schleife insgesamt :math:`n\cdot\frac{n}{2}` oder :math:`\frac{n^2}{2}` mal ausgeführt.

source: This will be the case regardless if the list is in order or not. The loops' efficiency may be improved by checking if ``min_pos`` and ``cur_pos`` are equal before line 20. If those variables are equal, there is no need to do the three lines of swap code.
de: Dies ist unabhängig davon der Fall, ob die Liste schon der Größe nach sortiert ist oder nicht. Die Effizienz der Schleifen kann verbessert werden, indem geprüft wird, ob ``min_pos`` und ``cur_pos`` vor Zeile 20 gleich sind. Wenn diese Variablen gleich sind, müssen die drei Zeilen des Austausch-Codes nicht ausgeführt werden.

source: In order to test the selection sort code above, the following code may be used. The first function will print out the list. The next code will create a list of random numbers, print it, sort it, and then print it again. On line 5 the print statement right-aligns the numbers to make the column of numbers easier to read. Formatting ``print`` statements will be covered in a later chapter.
de: Um den obigen Code des Selectionsort zu testen, kann das folgende Programm verwendet werden. Die erste Funktion gibt die Liste aus. Der nächste Programmcode erstellt eine Liste von Zufallszahlen, gibt sie aus, sortiert sie und gibt sie dann erneut aus. In Zeile 5 richtet die ``print``-Anweisung die Zahlen mit der rechtsbündig aus, damit die Zahlenspalte besser lesbar ist. Die Formatierung von ``print``-Ausgaben wird in einem späteren Kapitel behandelt.

source: Code to create and print list to sort
de: Code zum Erstellen und Ausgeben der zu sortierenden Liste

source: See an animation of the selection sort at:
de: Eine Animation des Selectionsort findest du unter:

source: For a truly unique visualization of the selection sort, search YouTube for "selection sort dance" or use this link:
de: Durchsuche YouTube nach "selection sort dance" oder verwende diesen Link, um eine wirklich einzigartige Visualisierung von Selectionsort zu erhalten:

source: You also can trace through the code using `Selection Sort on Python Tutor`_.
de: Du kannst den Code auch mit `Selection Sort on Python Tutor`_ nachverfolgen.

source: The insertion sort is similar to the selection sort in how the outer loop works. The insertion sort starts at the left side of the array and works to the right side. The difference is that the insertion sort does not select the smallest element and put it into place; the insertion sort selects the next element to the right of what was already sorted. Then it slides up each larger element until it gets to the correct location to insert. Graphically, it looks like Figure 18.5.
de: Insertionsort ähnelt Selectionsort in der Funktionsweise der äußeren Schleife. Insertionsort beginnt auf der linken Seite des Arrays und arbeitet sich nach rechts vor. Der Unterschied besteht darin, dass Insertionsort nicht das kleinste Element auswählt und an die richtige Stelle setzt. Insertionsort wählt das nächste Element rechts von dem aus, was in der Liste bereits sortiert wurde und vergleicht diesen Wert mit jeden Wert links davon in dem bereits sortierten Listenteil. Der Algorithmus schiebt jedes größere Element in dem bereits sortierten Listenteil nach rechts, bis es an die richtige Stelle zum Einfügen gelangt. Graphisch sieht es aus wie in Abbildung 18.5.

source: Figure 27.5: Insertion Sort
de: Abbildung 18.5: Insertionsort

source: The insertion sort breaks the list into two sections, the "sorted" half and the "unsorted" half. In each round of the outside loop, the algorithm will grab the next unsorted element and insert it into the list.
de: Insertionsort unterteilt die Liste in zwei Abschnitte, den sortierten Teil und den unsortierten Teil. In jeder Runde der äußeren Schleife greift der Algorithmus das nächste unsortierte Element und fügt es in die den sortierten Teil der Liste ein.

source: In the code below, the ``key_pos`` marks the boundary between the sorted and unsorted portions of the list. The algorithm scans to the left of ``key_pos`` using the variable ``scan_pos``. Note that in the insertion sort, ``scan_pos`` goes down to the left, rather than up to the right. Each cell location that is larger than ``key_value`` gets moved up (to the right) one location.
de: Im folgenden Code markiert ``key_pos`` die Grenze zwischen den sortierten und unsortierten Teilen der Liste. Der Algorithmus scannt links von ``key_pos`` mit der Variablen ``scan_pos``. Beachte, dass ``scan_pos`` beim Insertionsort nach links und nicht nach rechts läuft. Jede Zellenposition, die größer als ``key_value`` ist, wird um eine Position nach oben (nach rechts) verschoben.

source: When the loop finds a location smaller than ``key_value``, it stops and puts ``key_value`` to the left of it.
de: Wenn die Schleife eine Position findet, die kleiner als ``key_value`` ist, stoppt sie und setzt ``key_value`` rechts davon ein.

source: The outside loop with an insertion sort will run :math:`n` times. For each run of the outside loop, the inside loop will run an average of :math:`\frac{n}{4}` times if the loop is randomly shuffled. In total, the inside loop would run :math:`n\cdot\frac{n}{4}` times, or simplified, :math:`\frac{n^2}{4}` times.
de: Die äußere Schleife vom Insertionsort wird :math:`n` mal ausgeführt. Für jeden Durchgang der äußeren Schleife wird die innere Schleife durchschnittlich :math:`\frac{n}{4}` mal ausgeführt, wenn die Liste zufällig gemischt ist. Insgesamt würde die innere Schleife :math:`n\cdot\frac{n}{4}` mal oder vereinfacht :math:`\frac{n^2}{4}` mal laufen.

source: What's really important: If the loop is close to a sorted loop already, then the inside loop does not run very much, and the sort time is closer to *n*. The insertion sort is the fastest sort for nearly-sorted lists. If the list is reversed, then the insertion sort is terrible.
de: Was wirklich wichtig ist: Befindet sich die Liste bereits in der Nähe einer sortierten Liste, wird die innere Schleife nicht sehr häufig ausgeführt, und die Sortierzeit liegt näher bei *n*. Insertionsort ist der schnellste Algorithmus für nahezu sortierte Listen. Wenn die Liste umgekehrt sortiert ist, ist Insertionsort fürchterlich.

source: The selection sort doesn't really care what order the list is in to begin with. It performs the same regardless.
de: Selectionsort ist es eigentlich egal, in welcher Reihenfolge sich die Liste am Anfang befindet. Er verhält sich trotzdem gleich.

source: See an animation of the insertion sort at:
de: Eine Animation der Insertionsort findet man unter:

source: For another dance interpretation, search YouTube for "insertion sort dance" or use this link:
de: Durchsuche YouTube nach "insertion sort dance" oder verwende diesen Link, um eine andere Tanzinterpretation zu erhalten:

source: You can trace through the code using `Insertion Sort on Python Tutor`_.
de: Du kannst den Code mit `Insertion Sort on Python Tutor`_ nachverfolgen.

source: Full Sorting Example
de: Vollständiges Sortierbeispiel
