Repository: Anitha489/arcade_book
Catalog: locale/*/LC_MESSAGES/chapters/29_recursion/recursion.po
Languages: de

source: Recursion
de: Rekursion

source: (Source: http://everything2.com/title/recursion)
de: (Quelle: http://everything2.com/title/recursion)

source: Recursion is an object or process that is defined in terms of itself. Mathematical patterns such as factorials and the Fibonacci series are recursive. Documents that can contain other documents, which themselves can contain other documents, are recursive. Fractal images, and even certain biological processes are recursive in how they work.
de: Als *rekursiv* definiert bezeichnet man, wenn sich ein Objekt oder ein Prozess mit sich selbst definiert ist. Mathematische Strukturen wie die Fakultät und die Fibonacci-Zahlen kann man rekursiv definieren. Dokumente, die andere Dokumente enthalten können, die selbst andere Dokumente enthalten können, sind rekursiv. Fraktale Bilder und sogar bestimmte biologische Prozesse funktionieren rekursiv.

source: Where is Recursion Used?
de: Wo wird Rekursion verwendet?

source: Documents, such as web pages, are naturally recursive. For example, Figure 20.1 shows a simple web document.
de: Dokumente wie Webseiten sind natürlich rekursiv. Zum Beispiel zeigt Abbildung 20.1 ein einfaches Webdokument.

source: Figure 20.1: Web page
de: Abbildung 20.1: Webseite

source: That web document can be contained in a "box," which can help layout the page as shown in Figure 20.2.
de: Dieses Webdokument kann in einer "Box" enthalten sein, die hilft das Layout der Seite aufzubauen (siehe Abbildung 20.2).

source: Figure 20.2: Web page with tables
de: Abbildung 20.2: Webseite mit Tabellen

source: This works recursively. Each box can contain a web page, that can have a box, which could contain another web page as shown in Figure 20.3.
de: Dies funktioniert rekursiv. Jede Box kann eine Webseite enthalten, die eine Box enthalten kann, das eine andere Webseite enthalten kann, wie in Abbildung 20.3 dargestellt.

source: Figure 20.3: Web page with recursion
de: Abbildung 20.3: Webseite mit Rekursion

source: Recursive functions are often used with advanced searching and sorting algorithms. We'll show some of that here and if you take a "data structures" class you will see a lot more of it.
de: Die komplizierteren Such- und Sortieralgorithmen beschreibt man oft mit rekursiven Funktionen. Wir werden einiges davon hier zeigen und wenn du einen Kurs zu Datenstrukturen belegt, wirst du viel mehr davon sehen.

source: Even if a person does not become a programmer, understanding the concept of recursive systems is important. If there is a business need for recursive table structures, documents, or something else, it is important to know how to specify this to the programmer up front.
de: Auch wenn jemand kein Programmierer wird, ist es wichtig, das Konzept rekursiver Systeme zu verstehen. Wenn eine geschäftliche Anforderung an rekursiven Tabellenstrukturen, Dokumenten oder etwas anderem besteht, ist es wichtig zu wissen, wie man dies für einen Programmierer spezifizieren kann.

source: For example, a person might specify that a web program for recipes needs the ability to support ingredients and directions. A person familiar with recursion might state that each ingredient could itself be a recipes with other ingredients (that could be recipes.) The second system is considerably more powerful.
de: Beispielsweise kann jemand angeben, dass ein Webprogramm für Rezepte die Fähigkeit benötigt, Zutaten und Anweisungen zu unterstützen. Jemand, der mit Rekursion vertraut ist, könnte angeben, dass jede Zutat selbst wieder ein Rezept mit anderen Zutaten sein könnte (das könnten dann wieder Rezepte sein). Die zweite Beschreibung ist erheblich leistungsfähiger.

source: How is Recursion Coded?
de: Wie programmiert man mit Rekursion?

source: In prior chapters, we have used functions that call other functions. For example:
de: In früheren Kapiteln haben wir Funktionen verwendet, die andere Funktionen aufrufen. Zum Beispiel:

source: Functions calling other functions
de: Funktionen, die andere Funktionen aufrufen

source: It is also possible for a function to call itself. A function that calls itself is using a concept called recursion. For example:
de: Es ist auch möglich, dass eine Funktion sich selbst aufruft. Eine Funktion, die sich selbst aufruft, verwendet Rekursion. Zum Beispiel:

source: The example above will print Hello and then call the ``f()`` function again. Which will cause another Hello to be printed out and another call to the ``f()`` function. This will continue until the computer runs out of something called stack space. When this happens, Python will output a long error that ends with:
de: Das obige Beispiel gibt "Hello" aus und ruft dann die Funktion ``f()`` erneut auf. Dadurch wird ein weiteres "Hello" ausgegeben und die Funktion ``f()`` erneut aufgerufen. Dies wird so lange fortgesetzt, bis dem Rechner der Speicherplatz für den Stack ausgeht. In diesem Fall gibt Python einen langen Fehler aus, der so endet:

source: The computer is telling you, the programmer, that you have gone too far down the rabbit hole.
de: Der Rechner sagt dir, dem Programmierer, dass du wie Alice zu weit in den Kaninchenbau gekrochen bist.

source: Controlling Recursion Depth
de: Rekursionstiefe steuern

source: To successfully use recursion, there needs to be a way to prevent the function from endlessly calling itself over and over again. The example below counts how many times it has been called, and uses an if statement to exit once the function has called itself ten times.
de: Man muss verhindern, dass sich die Funktion endlos immer wieder aufruft, damit man mit Rekursion erfolgreich ein Problem lösen kann. Im folgenden Beispiel wird mitgezählt, wie oft die Funktion aufgerufen wurde, und verwendet eine ``if``-Anweisung, um das Programm zu beenden, sobald die Funktion sich selbst zehnmal aufgerufen hat.

source: Controlling recursion levels
de: Rekursionsebenen steuern

source: Output
de: Ausgabe

source: Recursion In Mathematics
de: Rekursion in der Mathematik

source: Recursion Factorial Calculation
de: Fakultät rekursiv berechnen

source: Any code that can be done recursively can be done without using recursion. Some programmers feel that the recursive code is easier to understand.
de: Jeder Code, der rekursiv ausgeführt werden kann, kann auch ohne Verwendung von Rekursion definiert werden. Einige Programmierer finden, dass der rekursive Code leichter zu verstehen ist.

source: Calculating the factorial of a number is a classic example of using recursion. Factorials are useful in probability and statistics. For example:
de: Die Berechnung der Fakultät einer Zahl ist ein klassisches Beispiel für die Verwendung der Rekursion. Die Fakultät ist nützlich für die Wahrscheinlichkeitsrechnung und Statistik. Zum Beispiel:

source: Recursively, this can be described as:
de: Rekursiv kann dies so beschrieben werden:

source: Below are two example functions that calculate . The first one is non-recursive, the second is recursive.
de: Nachfolgend finden Sie zwei Beispielfunktionen, die das berechnen. Die erste ist nicht rekursiv, der zweite ist rekursiv definiert.

source: Non-recursive factorial
de: Nicht-rekursive Fakultätsfunktion

source: Recursive factorial
de: Rekursive Fakultätsfunktion

source: The functions do nothing by themselves. Below is an example where we put it all together. This example also adds some print statements inside the function so we can see what is happening.
de: Die Funktionen tun nichts von sich aus. Nachfolgend findet sich ein Beispiel, in dem wir alles zusammenfassen. Dieses Beispiel fügt auch einige ``print``-Anweisungen in die Funktion ein, damit wir sehen können, was passiert.

source: Trying out recursive functions
de: Rekursive Funktionen ausprobieren

source: Recursive Expressions
de: Rekursive Ausdrücke

source: Say you have a mathematical expression like this:
de: Angenommen, du hast einen mathematischen Ausdruck wie diesen:

source: Looks complicated, but it just means that if :math:`n=1` we are working with :math:`f_{1}`. That function returns a 6.
de: Sieht kompliziert aus, bedeutet aber nur, dass wir für :math:`n = 1` :math:`f_{1}` verwenden. Diese Funktion gibt eine 6 zurück.

source: For :math:`f_{2}` we return :math:`\frac{1}{2}f_{1}+4`.
de: Für :math:`f_{2}` geben wir zurück :math:`\frac{1}{2}f_{1}+4`.

source: The code would start with:
de: Der Code würde beginnen mit:

source: Then we need to add that first case:
de: Dann müssen wir diesen ersten Fall hinzufügen:

source: See how closely if follows the mathematical notation? Now for the rest:
de: Siehst du, wie genau die mathematische Notation befolgt wird. Nun zum Rest:

source: Converting these types of mathematical expressions to code is straight forward. But we'd better try it out in a full example:
de: Das Konvertieren dieser Arten von mathematischen Ausdrücken in Code ist unkompliziert. Aber wir sollten es besser an einem vollständigen Beispiel ausprobieren:

source: Recursive Graphics
de: Rekursive Grafiken

source: Recursive Rectangles
de: Rekursive Rechtecke

source: Recursion is great to work with structured documents that are themselves recursive. For example, a web document can have a table divided into rows and columns to help with layout. One row might be the header, another row the main body, and finally the footer. Inside a table cell, might be another table. And inside of that can exist yet another table.
de: Rekursion ist ideal, um mit strukturierten Dokumenten zu arbeiten, die selbst rekursiv sind. Beispielsweise kann ein Webdokument eine Tabelle enthalten, die zur Unterstützung des Layouts in Zeilen und Spalten unterteilt ist. Eine Zeile könnte die Kopfzeile, eine andere Zeile der Hauptteil und schließlich die Fußzeile sein. In einer Tabellenzelle befindet sich möglicherweise eine andere Tabelle. Und darin kann noch eine Tabelle existieren.

source: Another example is e-mail. It is possible to attach another person's e-mail to a your own e-mail. But that e-mail could have another e-mail attached to it, and so on.
de: Ein weiteres Beispiel ist E-Mail. Es ist möglich, die E-Mail einer anderen Person an eine eigene E-Mail anzuhängen. Aber an diese E-Mail könnte eine andere E-Mail angehängt aein, und so weiter.

source: Can we visually see recursion in action in one of our Pygame programs? Yes! Figure 19.4 shows an example program that draws a rectangle, and recursively keeps drawing rectangles inside of it. Each rectangle is 20 percent smaller than the parent rectangle. Look at the code. Pay close attention to the recursive call in the recursive_draw function.
de: Können wir in einem unserer Arcade-Programme eine Rekursion in Aktion sehen? Ja! Abbildung 19.4 zeigt ein Beispielprogramm, das ein Rechteck zeichnet und rekursiv Rechtecke darin zeichnet. Jedes Rechteck ist 20 Prozent kleiner als das übergeordnete Rechteck. Schaue dir den Code an. Achte genau auf den rekursiven Aufruf in der Funktion ``recursive_draw``.

source: Figure 20.4: Recursive Rectangles
de: Abbildung 20.4: Rekursive Rechtecke

source: Fractals
de: Fraktale

source: Fractals are defined recursively. Here is a very simple fractal, showing how it changes depending on how "deep" the recursion goes.
de: Fraktale werden rekursiv definiert. Hier ist ein sehr einfaches Fraktal, das beispielhaft zeigt, wie es sich mit der "Rekursionstiefe" ändert.

source: Figure 20.5: Recursive Fractal Level 0
de: Abbildung 20.5: Rekursives Fraktal Tiefe 0

source: Figure 20.6: Recursive Fractal Level 1
de: Abbildung 20.6: Rekursives Fraktal Tiefe 1

source: Figure 20.7: Recursive Fractal Level 2
de: Abbildung 20.7: Rekursives Fraktal Tiefe 2

source: Figure 20.8: Recursive Fractal Level 5
de: Abbildung 20.8: Rekursives Fraktal Tiefe 5

source: Here is the source code for the "H" fractal:
de: Hier ist der Quellcode für das "H"-Fraktal:

source: You can explore fractals on-line:
de: Du kannst Fraktale online erkunden:

source: If you want to program your own fractals, you can get ideas of easy fractals by looking at Chapter 8 of `The Nature of Code`_ by Daniel Shiffman.
de: Wenn du deine eigenen Fraktale programmieren möchtest, kannst du mit Hilfe des Kapitel 8 von `The Nature of Code`_ von Daniel Shiffman Ideen zu einfachen Fraktalen bekommen.

source: Recursive Mazes
de: Rekursive Labyrinthe

source: There are maze generation algorithms. Wikipedia has a nice `Maze generation algorithm`_ article that details some. One way is the *recursive division method*.
de: Es gibt Algorithmen zur Generierung von Labyrinthen. Wikipedia hat einen schönen `Maze generation algorithm`_-Artikel, der einige Details enthält, aber leider zur Zeit nicht in Deutsch übersetzt ist. Eine Möglichkeit ist die *Methode der rekursiven Aufteilung*.

source: The algorithm is described below. Images are from Wikipedia.
de: Der Algorithmus wird unten beschrieben. Die Bilder stammen aus der Wikipedia.

source: Begin with the maze's space with just the outside walls. Call this a chamber.
de: Beginne mit dem Raum des Labyrinths nur mit den Außenwänden. Nenne das eine Kammer.

source: Divide the chamber with one random horizontal wall, and one random vertical wall.
de: Teile die Kammer durch eine zufällige horizontale Wand und eine zufällige vertikale Wand.

source: Pick three of the four walls and put a randomly position opening in it.
de: Wähle drei der vier Wände aus und setze eine zufällige positionierte Öffnung hinein.

source: Subdivide each of the four sections. Call each a chamber. Recursively call this function. In this image, the top left chamber has been subdivided.
de: Unterteile jeden der vier Abschnitte. Nenne sie jeweils eine Kammer. Rufe diese Funktion rekursiv auf. In diesem Bild wurde die obere linke Kammer unterteilt.

source: Finished maze.
de: Fertiges Labyrinth.

source: This method results in mazes with long straight walls crossing their space, making it easier to see which areas to avoid.
de: Diese Methode führt zu Labyrinthen mit langen geraden Wänden, die ihren Raum kreuzen, wodurch leichter erkennbar wird, welche Bereiche vermieden werden müssen.

source: Recursive maze generation. Source: Wikipedia `Maze generation algorithm`_.
de: Rekursive Labyrinth-Generierung. Quelle: Wikipedia `Maze generation algorithm`_.

source: Here is sample Python code that creates a maze using this method:
de: Hier ist ein Beispiel in Python, der mit dieser Methode ein Labyrinth erstellt:

source: Recursive Maze Example
de: Beispiel für die rekursive Generierung von Labyrinthen

source: Recursive Binary Search
de: Rekursive binäre Suche

source: Recursion can be also be used to perform a binary search. Here is a non-recursive binary search from Chapter 15:
de: Die Rekursion kann auch zur Durchführung einer binären Suche verwendet werden. Hier ist eine nicht rekursive binäre Suche aus Kapitel 15:

source: Non-recursive binary search
de: Binäre Suche ohne Rekursion

source: This same binary search written in a recursive manner:
de: Dieselbe binäre Suche, rekursiv geschrieben:

source: Recursive binary search
de: Binäre Suche mit Rekursion
