Repository: Anitha489/arcade_book
Catalog: locale/*/LC_MESSAGES/chapters/21_shooting_sprites/shooting_sprites.po
Languages: de

source: Using Sprites to Shoot
de: Verwenden von Sprites zum Schießen

source: How do we get sprites that we can shoot?
de: Wie bekommen wir Sprites, die wir schießen können?

source: Coins shooting
de: Münzen abschießen

source: Getting Started
de: Einstieg

source: First, let's go back to a program to start with.
de: Kehren wir zunächst zu einem Programm für den Einstieg zurück.

source: Starting program for shooting sprites
de: Einstiegsprogramm zum Schießen von Sprites

source: If you run this program, the player should move around the screen, and their should be coins. But not much else is happening yet.
de: Wenn du dieses Programm ausführst, sollte sich die Spielfigur auf dem Bildschirm bewegen und es sollte Münzen geben. Aber sonst passiert noch nicht viel.

source: Next, we need a 'shooting' image:
de: Als nächstes brauchen wir ein 'Schuss'-Bild:

source: Download this image (originally from Kenney.nl) and make sure it is in the same folder as your code.
de: Lade dieses Bild (ursprünglich von Kenney.nl) herunter und vergewissere dich, dass es sich im selben Ordner wie dein Code befindet.

source: Keeping The Player At The Bottom
de: Die Spielfigur unten behalten

source: Right now the player can move anywhere on the screen. We want to keep that sprite fixed to the bottom of the screen.
de: Im Moment kann sich die Spielfigur überall auf dem Bildschirm bewegen. Wir wollen das Sprite am unteren Bildschirmrand fixieren.

source: To do that, just remove the line of code for moving the player on the y-axis. The player will keep the same y value that we set back in the ``setup`` method.
de: Entferne dazu einfach die Codezeile, um die Spielfigur auf der y-Achse zu bewegen. Die Spielfigur behält den gleichen y-Wert bei, den wir in der Methode ``setup`` gesetzt haben.

source: Moving The Coins Up
de: Die Münzen nach oben bewegen

source: We want all the coins above the player. So we can adjust the starting y locations to have a starting point of 150 instead of 0. That will keep them above the player.
de: Wir wollen, dass sich alle Münzen über der Spielfigur befinden. Wir können also die Startpositionen so einstellen, dass sie einen Startpunkt von 150 anstelle von 0 haben. Dadurch bleiben sie über der Spielfigur.

source: Set Up Bullet List
de: Liste mit Schüssen einrichten

source: We need to create a list to manage the bullets. There are four places we need to add this ``bullet_list`` code:
de: Wir müssen eine Liste erstellen, um die Schüsse/Kugeln zu verwalten. Es gibt vier Stellen, an denen wir diesen ``bullet_list`` Code hinzufügen müssen:

source: Create the ``bullet_list`` variable (Line 26)
de: Erstellen der Variable ``bullet_list`` (Zeile 26)

source: Create an instance of ``SpriteList`` (Line 44)
de: Erstellen eines Exemplar von ``SpriteList`` (Zeile 44)

source: Draw the bullet list (Line 83)
de: Zeichnen der Schussliste (Zeile 83)

source: Update the bullet list (Line 105)
de: Aktualisieren der Schussliste (Zeile 105)

source: Set up bullet list
de: Einrichten einer Schussliste

source: Creating Bullets
de: Schüsse erstellen

source: We need to create bullets when the user presses the mouse button. We can add an ``on_mouse_press`` method to do something when the user presses the mouse button:
de: Wir müssen Schüsse erstellen, wenn der Benutzer die Maustaste drückt. Wir können eine ``on_mouse_press``-Methode hinzufügen, um etwas zu tun, wenn der Benutzer die Maustaste drückt:

source: This will create a bullet, but the bullet will default to the lower left corner. You can just barely see it.
de: Dadurch wird ein Schuss erstellt, der Schuss befindet sich jedoch standardmäßig in der unteren linken Ecke. Man kann ihn kaum sehen.

source: We can give the bullet a position:
de: Wir können dem Schuss eine Position zuweisen:

source: But this isn't what we want either. The code above puts the laser where we click the mouse. We want the laser to be where the player is. That's easy:
de: Aber das wollen wir auch nicht. Der obige Code platziert den Laser dort, wo wir mit der Maus klicken. Wir wollen, dass der Laser dort ist, wo sich die Spielfigur befindet. Das ist einfach:

source: We can even start the player a bit ABOVE the player:
de: Wir können den Schuss sogar ein wenig *über* der Spielfigur starten:

source: We can make the bullet move up using the constant ``BULLET_SPEED`` which we set to 5 at the top of the program:
de: Wir können den Schuss mit der Konstante ``BULLET_SPEED`` nach oben bewegen, die wir oben im Programm auf 5 setzen:

source: We can rotate the bullet so it isn't sideways using the ``angle`` attribute built into the ``Sprite`` class:
de: Wir können den Schuss so drehen, dass er nicht seitwärts gerichtet ist. Verwende dazu das Attribut ``angle`` der Klasse ``Sprite``:

source: Bullet Collisions
de: Schuss-Kollisionen

source: Now that we have bullets, how do we get them to collide with the coins? We add the following to our applications ``update`` method:
de: Wie bringen wir die Schüsse dazu, mit den Münzen zusammen zu stoßen? Wir fügen unserer ``update``-Methode Folgendes hinzu:

source: We loop through each bullet with a ``for`` loop. Then we check to see if the bullet is hitting any of the coins. If it is, we get rid of the coin. We get rid of the bullet.
de: Wir iterieren mit einer ``for``-Schleife über jeden Schuss. Dabei prüfen wir, ob der Schuss eine der Münzen trifft. Wenn ja, werden wir die Münze los. Wir werden in diesem Fall auch den Schuss los.

source: We also check to see if the bullet flies off the top of the screen. If it does, we get rid of the bullet. This is easy to forget, but if you do, it will cause the computer to slow down because you are tracking thousands of bullets that have long ago left the space we care about.
de: Wir überprüfen auch, ob der Schuss oben am Bildschirm landet. Wenn das der Fall ist, entfernen wir den Schuss. Dies kann man leicht vergessen. Wenn man es aber vergisst, verlangsamt sich der Rechner, da er Tausende von Schüssen verfolgt, die vor langer Zeit den uns interessierenden Bereich verlassen haben.

source: Here's the full example:
de: Hier ist das vollständige Beispiel:

source: Other Examples
de: Andere Beispiele

source: Here are some other examples from `Arcade Academy <http://arcade.academy>`_ and its `Example List <http://arcade.academy/examples/index.html>`_:
de: Hier sind einige andere Beispiele aus `Arcade Academy <http://arcade.academy>`_ und seiner `Liste mit Beispielen <http://arcade.academy/examples/index.html>`_:

source: `Aim bullets with mouse <http://arcade.academy/examples/sprite_bullets_aimed.html>`_
de: `Ziele mit der Maus <http://arcade.academy/examples/sprite_bullets_aimed.html>`_

source: `Enemies shoot periodically <http://arcade.academy/examples/sprite_bullets_periodic.html>`_
de: `Gegner schießen regelmäßig <http://arcade.academy/examples/sprite_bullets_periodic.html>`_

source: `Enemies shoot at random times <http://arcade.academy/examples/sprite_bullets_random.html>`_
de: `Gegner schießen zu zufälligen Zeiten <http://arcade.academy/examples/sprite_bullets_random.html>`_

source: `Enemies aim at player <http://arcade.academy/examples/sprite_bullets_enemy_aims.html>`_
de: `Gegner zielen auf die Spielfigur <http://arcade.academy/examples/sprite_bullets_enemy_aims.html>`_

source: `Explosions <http://arcade.academy/examples/sprite_explosion.html>`_
de: `Explosionen <http://arcade.academy/examples/sprite_explosion.html>`_
