Repository: Anitha489/arcade_book
Catalog: locale/*/LC_MESSAGES/chapters/18_sprites_and_collisions/sprites.po
Languages: de

source: Sprites And Collisions
de: Sprites und Kollisionen

source: Our games need support for handling objects that collide. Balls bouncing off paddles, laser beams hitting aliens, or our favorite character collecting a coin. All these examples require collision detection.
de: Unsere Spiele benötigen Unterstützung beim Umgang mit kollidierenden Objekten: Bälle, die von Schlägern abprallen, Laserstrahlen, die Aliens treffen, oder unser Lieblingscharakter, der eine Münze sammelt. Alle diese Beispiele erfordern eine Kollisionserkennung.

source: The Arcade library has support for sprites. A sprite is a two-dimensional image that is part of the larger graphical scene. Typically a sprite will be some kind of object in the scene that will be interacted with like a car, frog, or little plumber guy.
de: Die Arcade-Bibliothek unterstützt Sprites. Ein Sprite ist ein zweidimensionales Bild, das Teil der größeren grafischen Szene ist. In der Regel ist ein Sprite ein Objekt in der Szene, mit dem man wie mit einem Auto, einem Frosch oder einem kleinen Klempner interagiert.

source: Originally, video game consoles had built-in hardware support for sprites. Now this specialized hardware support is no longer needed, but we still use the term "sprite." The `history of sprites`_ is interesting, if you want to read up more about it.
de: Ursprünglich verfügten Videospielkonsolen über integrierte Hardware-Unterstützung für Sprites. Jetzt wird diese spezielle Hardwareunterstützung nicht mehr benötigt, aber wir verwenden immer noch den Begriff "Sprite". Die `Geschichte der Sprites`_ ist interessant, wenn Sie mehr darüber erfahren möchten.

source: Finding Images for Sprites
de: Finden von Bildern für Sprites

source: There are several image formats that computers use:
de: Es gibt verschiedene Bildformate, die Computer verwenden:

source: ``.bmp`` - Bitmap. This is an uncompressed image that normally uses three bytes to represent each dot in the image. These files can be very large. Because there are so many better options, this format is not used often. It is, however, the simplest format to use.
de: ``.bmp`` - Bitmap. Dies ist ein unkomprimiertes Bild, das normalerweise drei Bytes verwendet, um jeden Punkt im Bild darzustellen. Diese Dateien können sehr groß sein. Da es so viele bessere Möglichkeiten gibt, wird dieses Format nicht oft verwendet. Es ist jedoch das am einfachsten zu verwendende Format.

source: ``.png`` - Great patent-free format for line art and clip art. Not great for photos. Can't hold animations.
de: ``.png`` - Tolles patentfreies Format für Strichzeichnungen und Cliparts. Nicht so toll für Fotos. Kann keine Animationen enthalten.

source: ``.gif`` - Great format for line art and clip art. Has had issues with patents (now expired). Can do animations.
de: ``.gif`` - Tolles Format für Strichzeichnungen und Cliparts. Hat Probleme mit Patenten gehabt (jetzt abgelaufen). Kann Animationen enthalten.

source: ``.jpg`` - Great file format for photos. Terrible for clip-art. Don't use for sprites.
de: ``.jpg`` - Tolles Dateiformat für Fotos. Fürchterlich für Clip-Art. Nicht für Sprites verwenden.

source: ``.svg`` - File format for storing line-art images that can scale to any resolution. Not compatible with the "arcade" library.
de: ``.svg`` - Dateiformat zum Speichern von Vektorgrafiken, die auf jede Auflösung skaliert werden können. Nicht kompatibel mit der "Arcade"-Bibliothek.

source: If you use Google's `advanced image search`_ you can find images that are "icon" sized, and either png or gif file format.
de: Wenn du Googles "Erweiterte Bildsuche" (`advanced image search`_) verwendest, kannst du Bilder in "Symbolgröße" und im PNG- oder GIF-Dateiformat finden.

source: There's also a great source for images from `kenney.nl`_. He has a lot of free and cheap game image assets. That's where the following images come from that we will use in our examples:
de: Es gibt auch eine großartige Quelle für Bilder von `kenney.nl`_. Er hat eine Menge kostenloser und billiger Spielebild-Assets. Von dieser Seite kommen die folgenden Bilder, die wir in unseren Beispielen verwenden werden:

source: Where to Save Images
de: Speicherort für Bilder

source: Where should you save them? If you load your sprite with the code below, the computer will look for the ``character.png`` image in the same directory as your Python file. Save the image anywhere else, and it won't be found.
de: Wo solltest du sie speichern? Wenn du deinen Sprite mit dem folgenden Code lädst, sucht der Rechner im selben Verzeichnis wie deine Python-Datei nach dem Bild ``character.png``. Speichere das Bild an einem anderen Ort und es wird nicht gefunden.

source: How to Reference Images
de: Referenzieren von Bildern

source: If you create your own game that you publish, you need to:
de: Wenn du dein eigenes Spiel erstellst, das du veröffentlichst, musst du:

source: Create your own images
de: Deine eigenen Bilder erstellen

source: Hire someone to create your images
de: jemanden einstellen, der deine Bilder erstellt,

source: Buy your own images with a license to use them in your own game
de: Bilder mit einer Lizenz kaufen, um sie in deinem eigenen Spiel zu verwenden oder

source: Find images that are public domain or licensed for public use
de: Bilder suchen, die gemeinfrei sind oder für die öffentliche Verwendung lizenziert sind

source: If you are just creating a game for class that won't be used in public, then right before you load the image leave a comment with the source. I'll show this in a bit.
de: Wenn du nur ein Spiel für den Kurs erstellst, das nicht öffentlich verwendet wird, hinterlasse kurz vor dem Laden des Bildes einen Kommentar bei der Quelle. Ich werde das gleich zeigen.

source: Do not list "Google" as a source. That's like using "The Library" as a source in your report. Find the source of the image that Google is pointing to.
de: Gebe nicht "Google" als Quelle an. Das entspricht "In der Bibliothek" als Quelle in einer Hausarbeit. Suche die Quelle des Bildes, auf das Google verweist.

source: Basic Sprites and Collisions
de: Grundlegende Sprites und Kollisionen

source: Let's step through an example program that uses sprites. This example shows how to create a screen of sprites that are coins, and collect them using a sprite that is a character image controlled by the mouse as shown in the figure below. The program keeps "score" on how many coins have been collected. The code for this example may be found at:
de: Lass uns ein Beispielprogramm durchgehen, das Sprites verwendet. In diesem Beispiel wird gezeigt, wie man einen Bildschirm mit Sprites, die Münzen darstellen, erstellt und diese mithilfe eines Sprites sammeln, bei dem es sich um ein mit der Maus gesteuertes handelt (siehe Abbildung unten). Das Programm gibt an, wie viele Münzen gesammelt wurden. Der Code für dieses Beispiel befindet sich unter:

source: In this chapter, we'll step through that example.
de: In diesem Kapitel werden wir dieses Beispiel durchgehen.

source: Example Sprite Game
de: Beispiel-Sprite-Spiel

source: Getting the Application Started
de: Rahmen für die Anwendung

source: The first few lines of our program start off like other games we've done. We import a couple libraries. Set a couple constants for the size of the screen, and a couple new constants that we will use to scale our graphics.
de: Die ersten paar Zeilen unseres Programms fangen an wie andere Spiele, die wir implementiert haben. Wir importieren einige Bibliotheken. Stellen ein paar Konstanten für die Größe des Bildschirms und ein paar neue Konstanten, mit denen wir unsere Grafiken skalieren, ein.

source: The example below should have nothing new, it just creates a window and sets a background color. We'll add in the new stuff soon.
de: Das folgende Beispiel sollte nichts Neues enthalten, es erstellt lediglich ein Fenster und legt eine Hintergrundfarbe fest. Wir werden in Kürze die neuen Sachen hinzufügen.

source: Sprite Sample Start
de: Anfang des Sprite-Beispiels

source: The Constructor
de: Der Konstruktor

source: What's next? We need to add our attributes to the ``MyGame`` class. We add our attributes to the ``__init__`` method. Here is our code with the expanded ``__init__``:
de: Was kommt als nächstes? Wir müssen unsere Attribute zu der Klasse ``MyGame`` hinzufügen. Wir fügen unsere Attribute zu der Methode ``__init__`` hinzu. Hier ist unser Code mit dem erweiterten ``__init__``:

source: Expanded Init
de: Erweitertes ``__init__``

source: The variables we are creating:
de: Die Variablen, die wir erstellen:

source: ``player_list``: When working with sprites, we normally put them into lists. Other game engines might call these sprite groups, or sprite layers. Our game will have one list for the player, and one list for the coins. Even if there is only one sprite, we should still put it in a list because there is a lot of code in ``SpriteList`` to optimize drawing.
de: ``player_list``: Bei der Arbeit mit Sprites werden diese normalerweise in Listen abgelegt. Andere Spiele-Engines nennen diese Listen Sprite-Gruppen oder Sprite-Ebenen. Unser Spiel hat eine Liste für die Spielfigur und eine Liste für die Münzen. Auch wenn es nur ein Sprite gibt, sollten wir es dennoch in eine Liste aufnehmen, da ``SpriteList`` viel Code enthält, um das Zeichnen zu optimieren.

source: ``coin_list``: This is a list of all the coins. We will be checking if the player touches any sprite in this list.
de: ``coin_list``: Dies ist eine Liste aller Münzen. Wir werden prüfen, ob die Spielfigur ein Sprite in dieser Liste berührt.

source: ``player_sprite``: This points to our player's sprite. It is the sprite we will move.
de: ``player_sprite``: Dies zeigt auf das Sprite unserer Spielfigur. Es ist das Sprite, das wir bewegen werden.

source: ``score``: This keeps track of our score.
de: ``score``: Dies zeichnet unsere Punktzahl auf.

source: We use a command built into the parent ``Window`` class called ``set_mouse_visible`` to make the mouse not visible. Finally we set the background color.
de: Wir verwenden die Methode ``set_mouse_visible`` der Elternklasse ``Window``, um die Maus unsichtbar zu machen. Zuletzt stellen wir die Hintergrundfarbe ein.

source: The `setup` Function
de: Die ``setup``-Funktion

source: Next up, we will create a ``setup`` method. This will create our sprites and get our game set up. We do this in a different method than ``__init__`` so that if we ever want to restart the game, we can just call ``setup`` again.
de: Als nächstes erstellen wir eine ``setup``-Methode. Dadurch werden unsere Sprites erstellt und unser Spiel eingerichtet. Wir machen das in einer anderen Methode als ``__init__``, so dass wir, wenn wir das Spiel jemals neu starten wollen, einfach ``setup`` erneut aufrufen können.

source: The ``setup`` method is not called automatically. Therefore in the example below, note we have added the code that calls the ``setup`` function near the end: ``window.setup()``.
de: Die Methode ``setup`` wird nicht automatisch aufgerufen. Beachte daher, dass wir im folgenden Beispiel den Code hinzugefügt haben, der die Funktion ``setup`` gegen Ende aufruft: ``window.setup ()``.

source: Sprite Sample With Player
de: Sprite-Beispiel mit Spielfigur

source: How does the code above work?
de: Wie funktioniert der Code oben?

source: First, we need some lists to hold our sprites. We could do use a list like this:
de: Zuerst brauchen wir einige Listen, um unsere Sprites aufzunehmen. Wir könnten eine Liste wie diese verwenden:

source: But wait! ``coin_list`` is an instance variable that's part of our class. we need to prepend it with ``self.``.
de: Aber warte! ``coin_list`` ist eine Objektvariable, die Teil unserer Klasse ist. Wir müssen ``self.`` voranstellen.

source: However, the Arcade library has a class especially for handling sprite lists. This class is called ``SpriteList``. For more information, check out the SpriteList_ documentation. So instead of creating an empty list with ``[]``, we will create a new instance of the ``SpriteList`` class:
de: Die Arcade-Bibliothek verfügt jedoch über eine Klasse, die speziell für den Umgang mit Sprite-Listen vorgesehen ist. Diese Klasse heißt ``SpriteList``. Weitere Informationen findest du in der SpriteList_-Dokumentation. Anstatt also eine leere Liste mit ``[]`` zu erstellen, erstellen wir ein neues Exemplar der Klasse ``SpriteList``:

source: Except that doesn't work. Why? ``SpriteList`` is in the Arcade library. We need to prepend any reference to things in the Arcade library with ``arcade`` of course, so now we have:
de: Nur, dass das nicht funktioniert. Warum? ``SpriteList`` befindet sich in der Arcade-Bibliothek. Wir müssen natürlich vor alle Verweise auf Dinge in der Arcade-Bibliothek ``arcade.`` schreiben, also haben wir jetzt:

source: We need a separate list for just coins. This list won't have the player. We also need to reset our score to 0.
de: Wir brauchen eine separate Liste nur für Münzen. Diese Liste wird die Spielfigur nicht enthalten. Wir müssen auch unsere Punktzahl auf 0 zurücksetzen.

source: Now we need to create our sprites. The name of the class that represents sprites is called ``Sprite``. You can read more about it by looking at the Sprite_ documentation. The Sprite constructor takes two parameters. A path to the image we will be using, and how big to scale it.
de: Jetzt müssen wir unsere Sprites erstellen. Der Name der Klasse, die Sprites repräsentiert, heißt ``Sprite``. Weitere Informationen finden Sie in der Sprite_-Dokumentation. Der Sprite-Konstruktor akzeptiert zwei Parameter: Ein Pfad zu dem Bild, das wir verwenden werden, und wie groß es skaliert werden soll.

source: For class, please source the image right before you load it. If you drew your own image, please note that as well.
de: Gebe bitte die Quelle des Bilds direkt vor dem Laden an. Wenn du ein eigenes Bild gezeichnet hast, gib dies bitte ebenfalls an.

source: How do we draw all our sprites? Really easy. Just call the ``draw`` method that exists for us in the ``SpriteList`` class. We just need to do this for each of our sprite lists.
de: Wie zeichnen wir alle unsere Sprites? Wirklich einfach. Rufe einfach die Methode ``draw`` auf, die für uns in der Klasse ``SpriteList`` existiert. Wir müssen dies nur für jede unserer Sprite-Listen tun.

source: Wait. We don't have many sprites. There are no coins, and we have just the player. Let's add a ``for`` loop to our program and create a bunch of coins:
de: Warte! Wir haben nicht viele Sprites. Es gibt keine Münzen und wir haben nur die Spielfigur. Fügen wir unserem Programm eine ``for``-Schleife hinzu und erstellen einige Münzen:

source: Sprite Sample With Player And Coins
de: Sprite-Beispiel mit Spieler und Münzen

source: Drawing The Score
de: Zeichnen des Spielstands

source: In addition to drawing the sprites, let's go ahead and put the score on the screen:
de: Lass uns nicht nur die Sprites zeichnen, sondern auch den Spielstand auf dem Bildschirm anzeigen:

source: Rather than do that ``"Score: " + str(self.score)`` it is possible to do print formatting if you are using Python 3.6 or later. We'll talk more about print formatting later, but that code would look like:
de: Anstatt mit `` "Score:" + str (self.score) `` den Spielstand auszugeben ist es möglich die Ausgabe zu formatieren, wenn Sie Python 3.6 oder höher verwenden. Wir werden später mehr über die Formatierung von Ausgaben sprechen, aber dieser Code würde so aussehen:

source: There are three standards for how to format strings in Python, so that whole subject is a bit confusing.
de: Es gibt drei Standards zum Formatieren von Zeichenfolgen in Python, sodass das gesamte Thema etwas verwirrend ist.

source: The On Mouse Motion Method
de: Die ``on_mouse_motion``-Methode

source: Moving the player sprite with the mouse is easy. All sprites have instance variables ``center_x`` and ``center_y``. Just change those values to the mouse's x and y location to move the sprite.
de: Das Bewegen des Spielfigur-Sprites mit der Maus ist einfach. Alle Sprites haben Objektvariablen ``center_x`` und ``center_y``. Ändere diese Werte einfach in die X- und Y-Position der Maus, um das Sprite zu verschieben.

source: Now, our whole program looks like:
de: Jetzt sieht unser gesamtes Programm so aus:

source: Sprite Sample With Mouse Motion And Score
de: Sprite-Beispiel mit Mausbewegung und Spielstand

source: The Update Method
de: Die ``update``-Methode

source: Our ``update`` method needs to do three things:
de: Unsere ``update``-Methode muss drei Dinge tun:

source: Update each of the sprites
de: Aktualisieren jedes Sprite

source: Check to see if the player is touching any coins
de: Überprüfen, ob die Spielfigur Münzen berührt

source: Remove any coins colliding with the player, and update the score.
de: Entfernen aller Münzen, die mit dem Spieler kollidieren, und aktualisieren des Spielstands.

source: Each sprite has its own ``update`` method. This allows sprites to move and animate its images. Right now, our sprite does not have this method. But we will soon. Rather than call the ``update`` method of each sprite we have, there is an ``update`` method in each sprite list that will call ``update`` on each sprite in the list. Therefore, just calling ``update`` with our ``coin_list`` will cause all coin sprites to update.
de: Jedes Sprite hat eine eigene ``update``-Methode. Auf diese Weise können Sprites ihre Abbildung bewegen und animieren. Derzeit verfügt unser Sprite nicht über diese Methode. Aber wir werden sie bald implementieren. Anstatt die ``update``-Methode jedes Sprites, das wir haben, aufzurufen, gibt es in jeder Sprite-Liste eine ``update``-Methode, die ``update`` für jedes Sprite in der Liste aufruft. Wenn Sie also ``update`` mit unserer ``coin_list`` aufrufen, werden alle Münzsprites aktualisiert.

source: How do we detect what coins are touching the player? We call the ``check_for_collision_with_list`` method. Pass it in our player sprite, along with a list of all the coins. That function will return a list of all colliding sprites. If no sprites collide, the list will be empty.
de: Wie erkennen wir, welche Münzen die Spielfigur berührt? Wir nennen die Methode ``check_for_collision_with_list``. Ruf sie mit unserer Spielfigur und mit einer Liste aller Münzen auf. Diese Funktion gibt eine Liste aller kollidierenden Sprites zurück. Wenn keine Sprites kollidieren, ist die Liste leer.

source: What do we do with this ``hit_list`` we get back? We loop through it. We add one to the score for each sprite hit.
de: Was machen wir mit dieser ``hit_list``, die wir zurückbekommen? Wir iterieren durch sie. Für jeden Sprite-Treffer wird der Spielstand um eine Münze erhöht.

source: We also need to get rid of the sprite. The sprite class has a method called ``kill``. This method will remove the sprite from existence.
de: Wir müssen auch das Sprite loswerden. Die Sprite-Klasse hat eine Methode namens ``kill``. Diese Methode vernichtet das Sprite.

source: Here's the whole ``update`` method put together:
de: Hier ist die gesamte ``update``-Methode zusammengefasst:

source: Sprite Sample With Update Method
de: Sprite-Beispiel mit ``update``-Methode
