Repository: Anitha489/arcade_book
Catalog: locale/*/LC_MESSAGES/chapters/09_drawing_with_functions/drawing_with_functions.po
Languages: de

source: Drawing With Functions
de: Zeichnen mit Funktionen

source: Here is a set of examples where we take a program that already exists and put everything in functions.
de: Hier sind ein paar Beispiele, in denen wir ein existierendes Programm nehmen und alles in Funktionen packen.

source: First the original program:
de: Hier ist erst einmal das originale Programm:

source: Make The ``main`` Function
de: Erstelle die Funktion ``main``

source: Next, create a ``main()`` function. Put everything in it, and call the main function.
de: Erstelle als nächstes die ``main()``-Funktion. Steck alles in die Funktion und rufe sie auf.

source: When you do this, run your program and make sure it still works before proceeding.
de: Wenn du dies getan hast, starte dein Programm, um zu prüfen, ob alles wie vorher funktioniert, bevor du weiter liest.

source: Make The Drawing Functions
de: Erstelle die Zeichenfunktion

source: Next, pick an item to move to a function. Start with an easy one if you have it. I chose grass because it was only one line of code, and I wasn't going to ever try to position it with x, y.
de: Nimm dir als nächstes ein Bröckchen, das du in eine Funktion schieben willst. Starte mit einem einfachen, wenn du es hast. Ich hab das Zeichnen des Grases gewählt, weil es nur aus einer Zeile Code besteht und niemals mit x und y positioniert werden soll.

source: Then, I took a more complex shape and put it in a function.
de: Dann habe ich eine komplexere Form gewählt und in eine Funktion ausgelagert.

source: But this draws the snowman only at one spot. I want to draw lots of snowmen, anywhere I put them!
de: Aber dies zeichnet den Schneemann nur an einer bestimmten Stelle. Ich will viele Schneemänner an beliebigen Orten zeichnen!

source: To do this, let's add an x and y:
de: Lass und x und y hinzufügen, um dieses Ziel zu erreichen:

source: But that's not perfect. If you'll note, I added a dot at the x and y. The snowman draws way off from the dot, because originally I didn't try to draw it at 0, 0. I need to recenter the snowman on the dot.
de: Aber das ist nicht perfekt. Wie du bemerken wirst, habe ich einen Punkt zu x und y addiert. Der Schneemann wird abseits von diesem Punkt gezeichnet, weil ich ursprünglich versucht habe ihn auf 0, 0 bezogen zu zeichnen. Ich muss den Schneemann auf dem Punkt neu zentrieren.

source: We need to re-center the shape onto the spot we are drawing. Typically you'll need to subtract from all the x and y values the same amount.
de: Wir müssen die Form neu auf den Punkt, an dem wir zeichnen, zentrieren. Üblicherweise wirst du von allen x- und y-Werten den gleichen Betrag abziehen.

source: How To Animate A Drawing Function
de: Wie man eine Zeichenfunktion animiert

source: We can animate our drawing if we want. Here are the steps.
de: Wir können unsere erste Zeichnung animieren, wenn wir wollen. Hier sind die nötigen Schritte.

source: Create An ``on_draw`` Method
de: Erstelle eine ``on_draw``-Methode

source: Right now our program only draws our image once. We need to move all the drawing code in our ``main`` to an ``on_draw`` function. Then we'll tell the computer to draw that over and over.
de: Bis jetzt zeichnet unser Programm unser Bild nur einmal. Wir müssen den Zeichen-Code von unserer ``main``- in eine ``on_draw``-Funktion verschieben. Dann müssen wir dem Rechner sagen, das immer und immer wieder zu zeichnen.

source: Continuing from our last example, our program will look like:
de: Von unserem letzten Beispiel fortgeführt, wird unser Programm so aussehen:

source: Do this with your own program. Nothing will move, but it should still run.
de: Mach dies mit deinem eigenen Programm. Es wird sich nichts bewegen, aber es sollte immer noch laufen.

source: Add Variable To Control Where We Draw Our Item
de: Füge Variablen hinzu, die festlegen wo wir unser Element zeichnen

source: Next, we are going to create a variable inside of the ``on_draw`` function. This variable will hold our *x* value. Each time we call ``on_draw``, we'll change *x* so that it moves to the right.
de: Als nächstes erstellen wir eine Variable innerhalb der ``on_draw``-Funktion. Dies Variable wird unseren *x*-Wert enthalten. Jedes Mal, wenn wir ``on_draw`` aufrufen, ändern wir *x*, so dass er sich nach rechts bewegt.

source: For more information, see the `Bouncing Rectangle Example`_.
de: Für weitere Information sie dir das `Bouncing Rectangle Example`_ an.
