Repository: Anitha489/arcade_book
Catalog: locale/*/LC_MESSAGES/chapters/07_expressions/expressions.po
Languages: de

source: Variables and Expressions
de: Variablen und Ausdrücke

source: We've learned how to call functions to draw shapes like circles, but what if we could expand that? What if we could create our own instructions for drawing trees, houses, spaceships, and rainbows? What if our program could look like:
de: Wir haben gelernt Funktion aufzurufen, um Formen wie Kreise zu zeichnen, aber wie können wir das erweitern? Was ist, wenn wir unsere eigenen Anweisungen zum Zeichnen von Bäumen, Häusern, Raumschiffen und Regenbogen erstellen wollen? Unser Programm könnte wie folgt aussehen:

source: For this level of computer-programming power, we need to learn three things:
de: Für diesen Level an Rechnerprogrammier-Power, müssen wir drei Dinge lernen:

source: How to use variables (this chapter)
de: Wie man Variablen verwendet (dieses Kapitel)

source: How to write expressions (this chapter)
de: Wie man Ausdrücke eingibt (dieses Kapitel)

source: How to create out own functions (next two chapters)
de: Wie man eigene Funktionen erstellt (die nächsten beiden Kapitel)

source: How to Use Variables
de: Wie man Variablen verwendet

source: A **variable** is a value the computer stores in memory that can change. That is, it *varies*.
de: Eine **Variable** ist ein Wert, den ein Rechner speichert und der sich ändern kann. Das heißt, er ist *variabel*.

source: You've used variables in mathematics before. With computer science, we use them a lot. But in math class, you were given the equation and you had to solve for the variable. In computer science class, *we* come up with the equation and the *computer* solves the variable.
de: Du hast Variablen in Mathematik schon verwendet. In der Informatik verwenden wir sie häufig. Im Mathematikunterricht hast du aber eine Gleichung bekommen und musstest sie nach der Variablen auflösen. Im Informatikunterricht erstellen *wir* die Gleichung und der *Rechner* löst die Variable auf.

source: Here is a quick example:
de: Hier ist ein kurzes Beispiel:

source: What will the code above print? It will print ``5``.
de: Was wird der Programmcode oben ausgeben? Er wird ``5`` ausgeben.

source: The ``=`` is called an **assignment operator**. It assigns the value on the right side to the variable on the left.
de: Das ``=`` wird **Zuweisungsoperator** genannt. Es weist den Wert auf der rechten Seite der Variablen auf der linken Seite zu.

source: Here's another example. Very similar, but something is different. What will it print?
de: Hier ist ein anderes Beispiel. Es ist sehr ähnlich, aber etwas ist unterschiedlich. Was wird es ausgeben?

source: The code above prints ``x``. Why not ``5``? Because:
de: Der Code oben gibt ``x`` aus. Warum nicht ``5``? Der Grund ist:

source: If there are no quotes, the computer evaluates code like a mathematical expression.
de: Wenn es keine Anführungszeichen gibt, wertet der Rechner den Code genauso wie einen mathematischen Ausdruck aus.

source: If there are quotes, we treat what is between the quotes as a string of characters and don't change it.
de: Wenn es Anführungszeichen gibt, behandeln wir alles zwischen den Anführungszeichen als Zeichenkette und verändern sie nicht.

source: In fact, that is what we call the characters between the quotes. A **string**, which is short for "string of characters." We don't call it "text."
de: Das ist, was wir tatsächlich die Zeichen zwischen den Anführungszeichen nennen. Einen **String**, was kurz für "string of characters" (Kette von Zeichen) steht. Wir nennen es nicht "Text".

source: The following code won't print at all:
de: Der folgende Code gibt gar nichts aus:

source: The code above will fail because the computer will think that it should evaluate ``Have a great day!`` as a mathematical expression. It isn't, so the computer gets confused and generates an error. That's why we need quotes:
de: Der Code wird fehlschlagen, weil der Rechner meint, dass er ``Have a great day!`` als mathematischen Ausdruck auswerten soll. Es ist keiner, deshalb wird der Rechner verwirrt und generiert einen Fehler. Das ist der Grund, weshalb wir Anführungszeichen benötigen:

source: Variable and Function Names
de: Variablen und Funktionsnamen

source: Variable names and function names follow the same rules. There are names you *should* use, names you *shouldn't* use, and names you *can't* use.
de: Variablennamen und Funktionsnamen folgen den gleichen Regeln. Es gibt Namen, die du verwenden *solltest*, Namen, die du *nicht* verwenden *solltest*, und Namen, die du *nicht* verwenden *kannst*.

source: Good variable name examples:
de: Gute Beispiele für Variablennamen:

source: Legal, but bad variable names:
de: Erlaubte, aber schlechte Variablennamen:

source: ``temperatueInCelsius`` - Uses capital letters. Keep it lower case and use underscores.
de: ``temperatueInCelsius`` - verwendet Großbuchstaben. Bleibe bei Kleinbuchstaben und verwende Unterstriche.

source: ``x`` - Too short, and not descriptive.
de: ``x`` - zu kurz und nicht beschreibend

source: ``Simpson`` - Starts with a capital letter.
de: ``Simpson`` - beginnt mit einem Großbuchstaben

source: Variable names that won't work:
de: Variablen die nicht erlaubt sind:

source: ``tree position`` - Can't use spaces
de: ``tree position`` - Leerzeichen kann man nicht verwenden

source: ``4runner`` - Can't start with a number
de: ``4runner`` - darf nicht mit einer Ziffer anfangen

source: Sometimes we want to create a variable that won't change. We call these variables **constants**. By convention, these variable names are in all upper case. They are the only variables that use upper-case. For example:
de: Manchmal möchten wir Variablen erzeugen, die sich nicht verändern. Wir nennen diese Variablen **Konstanten**. Nach Konvention werden diese Variablennamen in Blockbuchstaben geschrieben. Sie sind nur Variablen die Blockbuchstaben verwenden. Zum Beispiel:

source: Good variable names help make code *readable*. Note the example below that calculates miles-per-gallon. It isn't easy to understand.
de: Gute Variablennamen helfen den Code *lesbar* zu machen. Betrachte das Beispiel unten, dass den Verbrauch in Meilen-pro-Gallone ausrechnet. Es ist nicht leicht zu verstehen.

source: But the code below that uses descriptive variable names *is* easy to understand.
de: Aber der Code unten verwendet beschreibende Variablennamen. Er *ist* leicht zu verstehen.

source: How to Create Expressions
de: Wie man Ausdrücke erstellt

source: Using Operators in Expressions
de: Verwendung von Operatoren in Ausdrücken

source: Great! We are part-way there. To really be powerful, variables need to be used with **expressions**. An expression is simply a mathematical equation like what you've used in math before. Here's an example:
de: Großartig! Wir sind zum Teil da. Um wirklich kraftvoll zu sein, müssen Variablen mit **Ausdrücken** verwendet werden. Ein Ausdruck ist einfach eine mathematische Formel, wie wir sie in Mathematik bisher verwendet haben. Hier ist ein Beispiel:

source: As you can probably guess, this will print out ``15``. We call the ``+`` sign an **operator**. Here are some other operators:
de: Wie du wahrscheinlich ahnst, wird dies ``15`` ausgeben. Wir nennen das ``+``-Zeichen einen **Operator**. Hier sind ein paar andere Operatoren:

source: Description
de: Beschreibung

source: Subtraction
de: Subtraktion

source: Multiplication
de: Multiplikation

source: Exponentiation (raise to the power)
de: Exponentiation (hoch)

source: Integer division (rounds down)
de: Ganzzahl-Division (rundet ab)

source: Modulus (gives remainder of division)
de: Modulo (ergibt den Rest einer Division)

source: There are two things that **don't** work like you'd expect. There is no "juxtaposition" used to multiply items. And the ``=`` is not an algebraic equality
de: Es gibt zwei Dinge, die **nicht** wie erwartet funktionieren. Man kann das Multiplikationszeichen nicht weglassen. Das ``=``-Zeichen ist keine algebraische Gleichheit.

source: Juxtaposition Doesn't Work
de: Auslassen des Multiplikationszeichens funktioniert nicht

source: Juxtaposition doesn't work for multiplication. For example, the following will **not** work:
de: Die Auslassung des Multiplikationszeichens funktioniert nicht. Das folgende Beispiel wird **nicht** funktionieren:

source: You can rewrite the code above to work by explicitly multiplying:
de: Du kannst den Code oben durch explizites Multiplizieren zum Laufen bringen:

source: Easy enough, just remember to use ``*`` any time you want to multiply.
de: Einfach genug. Denke nur daran, jedes mal ``*`` zu verwenden, wenn du multiplizieren willst.

source: Assignment Operators
de: Zuweisungsoperatoren

source: The ``=`` doesn't work the same as in algebra. The ``=`` evaluates what is on the right, and puts it in the variable on the left. For example:
de: Das ``=``-Zeichen funktioniert nicht so wie in Algebra. Das ``=``-Zeichen wertet das auf der rechten Seite aus und steckt es in die Variable auf der linken Seite. Zum Beispiel:

source: This allows us to do some strange things we can't do in algebra!
de: Das erlaubt uns einige merkwürdige Dinge zu tun, die in Mathematik nicht erlaubt sind!

source: The ``=`` sign is also considered an operator. Specifically an "assignment operator." Here are some other "assignment" operators:
de: Das ``=``-Zeichen wir auch als Operator betrachtet. Genauer ein "Zuweisungsoperator". Hier sind weitere Zuweisungsoperatoren:

source: Assignment
de: Zuweisung

source: Increment
de: Inkrement

source: Decrement
de: Dekrement

source: Multiply/Add
de: Multipliziere

source: Using Expressions In Function Calls
de: Verwendung von Funktionsaufrufen in Ausdrücken

source: We can use expressions even in the calls that we make. For example, what if we want to draw a circle in the center of the screen?
de: Wir können Ausdrücke in den Funktionsaufrufen verwenden. Was, wenn wir zum Beispiel einen Kreis in der Mitte des Zeichenbereichs zeichnen wollen?

source: We could do something like:
de: Wir könnten etwas wie folgt schreiben:

source: Order of Operations
de: Rangfolge der Operatoren

source: Python will evaluate expressions using the same order of operations that are expected in standard mathematical expressions. For example this equation does not correctly calculate the average:
de: Python wird die Operatoren in der Reihenfolge auswerten, die wir bei mathematischen Ausdrücken erwarten. So wird zum Beispiel die folgende Zuweisung nicht den korrekten Mittelwert ausrechnen:

source: The first operation done is 98/5. The computer calculates:
de: Die erste Operation, die ausgeführt wird, ist 98/5. Der Rechner berechnet:

source: rather than the desired:
de: Anstatt wie gewünscht:

source: By using parentheses this problem can be fixed:
de: Durch die Verwendung von Klammern kann dieses Problem gelöst werden:

source: Printing Variables
de: Ausgabe von Variablen

source: How can you print variables and text together? Say you've got a variable ``result`` and you want to nicely print it. Based on what we learned so far, you can do this:
de: Wie kann man Variablen und Text zusammen ausgeben? Nehmen wir an, wir haben die Variable ``result`` und wollen sie hübsch ausgeben. Basierend auf dem, was wir bisher gelernt haben, kannst du das tun:

source: But that just prints out ``bananas`` on a line by itself. Not very descriptive. What if we wanted:
de: Aber das gibt nur ``bananas`` auf einer Zeile alleine aus. Nicht wirklich anschaulich. Was wenn wir haben wollten:

source: You can do this with:
de: Du kannst das erreichen mit:

source: Better. But I want to add punctuation. If we do this:
de: Besser, aber wenn wir Interpunktion haben. Wenn wir dies tun:

source: We get an extra space before the period:
de: Bekommen wir ein Leerzeichen vor dem Punkt:

source: The ``,`` adds a space when we use it in a ``print`` statement. We don't always want that. We can instead use a ``+`` sign:
de: Das ``,`` fügt ein Leerzeichen ein, wenn wir es in einer ``print``-Anweisung verwenden. Das wollen wir nicht immer. Wir können das ``+``-Zeichen verwenden:

source: Which gets rid of all the spaces:
de: Das entfernt alle Leerzeichen:

source: So we need to add a space INSIDE the quotes where we want it:
de: Also müssen wir Leerzeichen *in* den Anführungszeichen einfügen, wo wir sie haben wollen:

source: Ok, so I think I know how to print variables. Until I try this:
de: OK, also denke ich weiß, wie man Variablen ausgibt. Bis ich das ausprobiere:

source: The computer doesn't know how to put text and numbers together. If you add two *numbers* ``20 + 20`` you get ``40``. If you add two *strings* ``"20" + "20"`` you get ``2020``, but the computer has no idea what to do with a combo of text and numbers. So the fix is to use the ``str`` function which converts the number to a string (text):
de: Der Rechner weiß nicht, wie er Text und Zahlen zusammenfügen soll. Wenn du zwei *Zahlen* ``20+20`` addierst, bekommst du ``40``. Wenn du zwei *Zeichenketten* ``"20"+"20"`` addierst, bekommst du ``2020``, aber der Rechner hat keine Ahnung, was er mit einer Kombination von Text und Zahlen machen soll. Die Korrektur ist die ``str``-Funktion, die eine Zahl in eine Zeichenkette (string) konvertiert:

source: Yes, this is a bit complex. But wait! There's more! Another way to print variables is to use a *formatted string*. Later we will spend a whole other chapter on formatted strings, but they look like:
de: Ja, das ist etwas kompliziert, aber warte! Es gibt mehr! Ein anderer Weg Variablen auszugeben sind *formatierte Zeichenketten*. Später werden wir ein ganzes Kapitel auf formatierte Zeichenketten verwenden, aber sie sehen so aus:

source: Note we start the string with an ``f`` before the quote, and the variable we want to print goes in curly braces.
de: Beachte, dass wir die Zeichenkette mit einem ``f`` vor dem Anführungszeichen anfangen und die Variable in geschweiften Klammern steht.
