Repository: Anitha489/arcade_book
Catalog: locale/*/LC_MESSAGES/labs/lab_03_function_drawing/function_drawing.po
Languages: de

source: Lab 3: Drawing with Functions
de: Übung 3: Zeichnen mit Funktionen

source: Requirements
de: Anforderungen

source: Your goal: Draw and animate an image.
de: Dein Ziel: Zeichne und animiere ein Bild.

source: Requirements for Drawing
de: Anforderungen an die Zeichnung

source: You can update your program from Lab 2, or create a new program. This lab is worth 20 points. See the point breakdown below.
de: Du kannst dein Programm aus der Übung 2 weiterverwenden oder ein neues Programm erstellen. Für diese Übung gibt es 20 Punkte. Beachte die Punkteverteilung unten.

source: Incorporate the following items:
de: Baue die folgenden Teile ein:

source: Find the folder for Lab 03 in PyCharm and start entering your code there. Feel free to use any code from Lab 02 you want, just copy it across.
de: Suche den Ordner für die Übung 3 in PyCharm und beginne dort deinen Code einzugeben. Wenn du willst kannst du beliebigen Code aus der Übung 2 verwenden, kopiere ihn einfach herüber.

source: Make sure you are putting your program in the Lab 3 folder, and not just changing Lab 2 to have Lab 3 requirements.
de: Sei dir sicher, dass du dein Programm im Ordner Übung 3 schreibst und nicht einfach die Übung 2 an die Anforderungen der Übung 3 anpasst.

source: We are going to be following the instructions/example in :ref:`custom-drawing-function`.
de: Wir werden den Anweisungen/Beispielen in :ref:`custom-drawing-function` folgen.

source: Put everything into a function as shown in :ref:`make_the_main_function`.
de: Packe alles in eine Funktion wie in :ref:`make_the_main_function`.

source: Create three functions that draw something. (15 pts total, up to 5 pts per function)
de: Erzeuge drei Funktionen, die etwas zeichnen. (15 Punkte insgesamt, bis zu fünf Punkte pro Funktion)

source: Define the function and successfully call it. (1 pt)
de: Definiere die Funktion und rufe sie erfolgreich auf. (1Punkt)

source: Make your drawing function complex. 0 points for a one-line function that just draws a rectangle, 0 points for copying the example from the book, 2 points for a cohesive multi-line function. (2 pts)
de: Mach deine Zeichenfunktion komplex. 0 Punkte gibt es für einen Einzeiler, der nur ein Rechteck zeichnet. Es gibt auch 0 Punkte für das Kopieren des Beispiels aus dem Buch. 2 Punkte gibt es für eine zusammenhängende mehrzeilige Funktion.

source: Pass in ``x`` and ``y`` parameters and successfully position the object as shown in :ref:`make_the_drawing_function`. (2 pts)
de: Übergebe ``x`` und ``y`` als Argumente und positioniere erfolgreich das Objekt wie in :ref:`make_the_drawing_function` gezeigt. (2 Punkte)

source: Drawing with functions is worth 16 points. You can get the final 4 points by animating your image.
de: Zeichnen mit Funktionen ist 16 Punkte wert. Du kannst die letzten vier Punkte durch Animation deines Bildes bekommen.

source: Requirements for Animation
de: Anforderungen an die Animation

source: Animate an object. The movement does not need to be complex. See :ref:`animate-drawing` for an example.
de: Animiere ein Objekt. Die Bewegung muss nicht komplex sein. Siehe :ref:`animate-drawing` als Beispiel.

source: Double Check
de: Doppelcheck

source: Make sure you don't put functions inside of functions. After the ``import`` statement, each function should be listed out, one ``def`` after the other. But no ``def`` inside of another ``def``.
de: Stell sicher, dass du keine Funktionen in eine andere Funktion packst. Nach der ``import``-Anweisung sollte jede Funktion angegeben sein. Ein ``def`` nach dem anderen, aber kein ``def`` in einem anderen ``def``.

source: Also make sure you have *three* functions that take in an ``(x, y)`` position to draw an object, not just one.
de: Stelle auch sicher, dass du drei Funktionen hast, die eine ``(x, y)``-Position als Parameter zum Zeichnen eines Objekts haben, nicht nur eine.
