Repository: Anitha489/arcade_book
Catalog: locale/*/LC_MESSAGES/chapters/14_classes/classes.po
Languages: de

source: Introduction to Classes
de: Einführung in Klassen

source: Classes and objects are very powerful programming tools. They make programming easier. In fact, you are already familiar with the concept of classes and objects. A class is a "classification" of an object. Like "person" or "image." An object is a particular instance of a class. Like "Mary" is an instance of "Person."
de: Klassen und Objekte sind sehr mächtige Programmierwerkzeuge. Sie vereinfachen die Programmierung. Genau genommen bist du bereits mit dem Konzept der Klassen und Objekte vertraut. Eine Klasse ist eine "Klassifikation" eines Objekts, wie "Person" oder "Abbild". Ein Objekt ist ein tatsächliches Exemplar einer Klasse, wie "Maria" ein Exemplar von "Person" ist.

source: Objects have attributes, such as a person's name, height, and age. Objects also have methods. Methods define what an object can do, like run, jump, or sit.
de: Objekte haben Attribute, wie Name, Größe und Alter einer Person. Objekte haben auch Methoden. Methoden definieren was ein Objekt tun kann, wie rennen, springen oder sitzen.

source: Why Learn About Classes?
de: Warum soll ich etwas über Klassen lernen?

source: Each character in an adventure game needs data: a name, location, strength, are they raising their arm, what direction they are headed, etc. Plus those characters do things. They run, jump, hit, and talk.
de: Jeder Charakter in einem Adventure-Spiel benötigt Daten: Einen Namen, Position, Stärke, heben sie ihren Arm, in welche Richtung bewegen sie sich und so weiter. Dazu machen Charaktere Dinge. Sie rennen, springen, schlagen zu und reden.

source: Without classes, our Python code to store this data might look like:
de: Ohne Klassen könnte der Python-Code, um diese Daten zu speichern, so aussehen:

source: In order to do anything with this character, we'll need to pass that data to a function:
de: Um irgendetwas mit diesem Charakter zu machen, müssen wir diese Daten an eine Funktion übergeben:

source: Now imagine creating a program that has a set of variables like that for each character, monster, and item in our game. Then we need to create functions that work with those items. We've now waded into a quagmire of data. All of a sudden this doesn't sound like fun at all.
de: Stelle dir jetzt vor ein Programm zu erstellen, das eine Menge von Variablen wie diese für jeden Charakter, Monster und Gegenstand in deinem Spiel hat. Dann müssen wir noch Funktionen schreiben, die mit diesen Elementen arbeiten. Wir sind jetzt in Sumpf von Daten gelaufen. Auf einmal klingt das nicht mehr nach Spaß.

source: But wait, it gets worse! As our game expands, we may need to add new fields to describe our character. In this case we've added ``max_speed``:
de: Aber warte, es wird noch schlimmer! Während unser Spiel größer wird, müssen wir neue Datenfelder hinzufügen, um unseren Charakter zu beschreiben. In diesem Fall haben wir ``max_speed`` hinzugefügt:

source: In example above, there is only one function. But in a large video game, we might have hundreds of functions that deal with the main character. Adding a new field to help describe what a character has and can do would require us to go through each one of those functions and add it to the parameter list. That would be a lot of work. And perhaps we need to add ``max_speed`` to different types of characters like monsters. There needs to be a better way. Somehow our program needs to package up those data fields so they can be managed easily.
de: Im Beispiel oben gibt es nur eine Funktion, aber in einem großen Videospiel könnten wir Hunderte Funktionen, die den Hauptcharakter betreffen, existieren. Das Hinzufügen eines neuen Datenfelds, das beschreibt, was ein Charakter hat und tun kann, würde uns zwingen durch jede dieser Funktionen zu gehen und es zur Parameterliste hinzufügen. Das wäre eine Menge Arbeit. Vielleicht müssen wir ``max_speed`` zu verschiedenen Charakteren wie Monstern hinzufügen. Es muss einen besseren Weg geben. Irgendwie muss unser Programm diese Datenfelder zusammenpacken, so dass sie sich einfach verwalten lassen.

source: Defining and Creating Simple Classes
de: Definieren und Erstellen einfacher Klassen

source: A better way to manage multiple data attributes is to *define* a structure that has all of the information. Then we can give that "grouping" of information a name, like *Character* or *Address*. This can be easily done in Python and any other modern language by using a *class*.
de: Ein besserer Weg mehrere Datenattribute zu handhaben, ist eine Struktur zu *definieren*, die all diese Information umfasst. Dann können wir dieser "Gruppierung" von Information einen Namen wie *Charakter* oder *Adresse* geben. Dies kann in Python und jeder anderen modernen Sprache durch Verwendung einer *Klasse* erreicht werden.

source: For example, we can *define* a class representing a character in a game:
de: Zum Beispiel können wir eine Klasse, die einen Charakter im Spiel repräsentiert, *definieren*:

source: Here's another example, we *define* a class to hold all the fields for an address:
de: Hier ist ein anderes Beispiel. Wir *definieren* eine Klasse, die alle Datenfelder einer Adresse enthält:

source: Define an address class
de: Definiere eine Adress-Klasse

source: In the code above, ``Address`` is the class name. The variables in the class, such as ``name`` and ``city``, are called *attributes* or *fields*. (Note the similarities and differences between declaring a class and declaring a function.)
de: Im Beispiel oben ist ``Address`` der Klassenname. Die Variablen in der Klasse, wie ``name`` und ``city``, werden *Attribute* oder *Felder* genannt. (Beachte die Ähnlichkeiten und Unterschiede zwischen der Deklaration einer Klasse und einer Funktion.)

source: Unlike functions and variables, class names should begin with an upper case letter. While it is possible to begin a class with a lower case letter, it is not considered good practice.
de: Anders als bei Funktionen und Variablen sollen Klassennamen immer mit einem Großbuchstaben anfangen. Auch wenn es möglich ist, einen Klassennamen mit einem Kleinbuchstaben anzufangen, gilt das als schlechter Stil.

source: The ``def __init__(self):`` in a special function called a *constructor* that is run automatically when the class is created. We'll discuss the constructor more in a bit.
de: Die ``def __init__(self):`` ist eine spezielle Funktion, die *Konstruktor* genannt wird. Sie wird automatisch ausgeführt, wenn ein Objekt der Klasse erzeugt wird. Wir werden den Konstruktor in Kürze mehr besprechen.

source: The ``self.`` is kind of like the pronoun *my*. When inside the class ``Address`` we are talking about *my* name, *my* city, etc. We don't want to use ``self.`` outside of the class definition for ``Address``, to refer to an ``Address`` field. Why? Because just like the pronoun "my," it means someone totally different when said by a different person!
de: Das ``self.`` ist so ähnlich wie das Pronomen *mein*. In der Klasse ``Address`` reden wir von *meinem* ``name``, *meiner* ``city`` und so weiter. Wir wollen aber ``self.`` nicht außerhalb der Klassendefinition für ``Address`` für den Zugriff auf ein Attribut von ``Address`` verwenden. Warum? Weil es genau wie das Pronomen "mein" etwas komplett unterschiedliches bedeutet, wenn es von verschiedenen Personen gesagt wird!

source: To better visualize classes and how they relate, programmers often make diagrams. A diagram for the Address class would look like the figure below. See how the class name is on top with the name of each attribute listed below. To the right of each attribute is the data type, such as string or integer.
de: Um zu verdeutlichen, wie Klassen aufgebaut sind und wie sie in Beziehung stehen, zeichnen Programmierer oft Diagramme. Ein Diagramm für die Adressklasse würde wie in der Abbildung unten aussehen. Der Klassenname steht oben und jedes Attribut wird unten aufgelistet. Rechts von jedem Attribut steht sein Datentyp, wie String oder Integer.

source: Class Diagram
de: Klassendiagramm

source: The class code *defines* a class but it does not actually create an *instance* of one. The code told the computer what fields an address has and what the initial default values will be. We don't actually have an address yet though. We can define a class without creating one just like we can define a function without calling it. To create a class and set the fields, look at the example below:
de: Der Klassen-Code *definiert* eine Klasse, aber er erzeugt nicht wirklich ein *Objekt* (Instanz) einer Klasse. Der Code hat dem Rechner gesagt, welche Datenfelder eine Adresse hat und was ihre Standardwerte sein werden. Wir haben bis jetzt noch keine Adresse. Wir können eine Klasse definieren, ohne ein Objekt davon zu erzeugen, genau wie wir eine Funktion definieren können, ohne sie aufzurufen. Sieh dir das Beispiel unten an, wie man ein Objekt einer Klasse erzeugt und die Attribute setzt:

source: Create an instance of the address class
de: Erzeuge ein Exemplar der Klasse ``Address``

source: An instance of the address class is created in line 2. Note how the class ``Address`` name is used, followed by parentheses. The variable name can be anything that follows normal naming rules.
de: Ein Exemplar der Klasse ``Address`` wird in Zeile 2 erzeugt. Beachte, wie der Klassenname ``Address`` gefolgt von zwei runden Klammern verwendet wird. Der Variablenname kann irgendetwas sein, das den normalen Regeln für Variablennamen folgt.

source: To set the fields in the class, a program must use the dot operator. This operator is the period that is between the ``home_address`` and the field name. See how lines 5-10 use the dot operator to set each field value.
de: Ein Programm muss den Punktoperator verwenden, um auf die Attribute des Objekts zuzugreifen. Dieser Operator ist der Punkt zwischen ``home_address`` und dem Attributnamen. Siehe wie in den Zeilen 5-10 der Punktoperator verwendet wird, um jeden Attributwert zu setzen.

source: A very common mistake when working with classes is to forget to specify which instance of the class you want to work with. If only one address is created, it is natural to assume the computer will know to use that address you are talking about. This is not the case however. See the example below:
de: Ein häufiger Fehler beim Programmieren mit Klassen ist, das Objekt mit dem man arbeiten will zu vergessen. Wenn nur eine Adresse erzeugt wird, nimmt man natürlich an, dass der Rechner weiß, dass man über diese Adresse spricht. Das ist aber nicht der Fall. Siehe das Beispiel unten:

source: A second address can be created and fields from both instances may be used. See the example below:
de: Eine zweite Adresse kann erzeugt werden und die Attribute beider Objekte können verwendet werden. Siehe das Beispiel unten:

source: Working with two instances of address
de: Arbeiten mit zwei Exemplaren der Adresse

source: Line 11 creates the first instance of ``Address``; line 22 creates the second instance. The variable ``home_address`` points to the first instance and ``vacation_home_address`` points to the second.
de: Zeile 11 erzeugt das erste Exemplar von ``Address`` und Zeile 22 erzeugt das zweite Exemplar. Die Variable ``home_address`` zeigt auf das erste Exemplar und ``vacation_home_address`` zeigt auf das zweite.

source: Lines 25-30 set the fields in this new class instance. Line 32 prints the city for the home address, because ``home_address`` appears before the dot operator. Line 33 prints the vacation address because ``vacation_home_address`` appears before the dot operator.
de: In den Zeilen 25-30 werden die Attribute des neuen Exemplars der Klasse gesetzt. Zeile 32 gibt die Stadt der Heimatadresse aus, weil ``home_address`` vor dem Punktoperator erscheint. Zeile 33 gibt die Ferienadresse aus, weil ``vacation_home_address`` vor dem Punktoperator steht.

source: In the example Address is called the class because it defines a new classification for a data object. The variables ``home_address`` and ``vacation_home_address`` refer to objects because they refer to actual instances of the class ``Address``. A simple definition of an object is that it is an instance of a class. Like "Bob" and "Nancy" are instances of a Human class.
de: Im Beispiel wird ``Address`` Klasse genannt, weil sie eine neue Klassifikation für das Datenobjekt definiert. Die Variablen ``home_address`` und ``vacation_home_address`` beziehen sich auf zwei tatsächliche Objekte der Klasse ``Address``. Eine einfache Definition eines Objekts ist, dass es ein Exemplar einer Klasse ist, wie "Bob" und "Nancy" Exemplare der Menschen-Klasse sind.

source: By using www.pythontutor.com_ we can `visualize the execution of the code`_ (see below). There are three variables in play. One points to the class definition of ``Address``. The other two variables point to the different address objects and their data.
de: Auf www.pythontutor.com_ können wir unter `visualize the execution of the code`_ (siehe unten) die Ausführung des Programms visualisieren lassen. Es gibt drei Variablen bei der Ausführung. Eine zeigt auf die Definition der Klasse ``Address``. Die anderen beiden Variablen zeigen auf die beiden verschiedenen Adressobjekte und ihre Daten.

source: Two Addresses
de: Zwei Adressen

source: Putting lots of data fields into a class makes it easy to pass data in and out of a function. In the code below, the function takes in an address as a parameter and prints it out on the screen. It is not necessary to pass parameters for each field of the address.
de: Steckt man viele Attribute in eine Klasse, wird es einfach, Daten in und aus einer Funktion heraus zu geben. Im Code unten, übernimmt die Funktion eine Adresse als Parameter und gibt sie auf dem Bildschirm aus. Es ist nicht nötig, Argumente für jedes einzelne Attribut der Adresse zu übergeben.

source: Adding Methods to Classes
de: Methoden zu Klassen hinzufügen

source: In addition to attributes, classes may have methods. A method is a function that exists inside of a class. Expanding the earlier example of a ``Dog`` class from the review problem 1 above, the code below adds a method for a dog barking.
de: Zusätzlich zu Attributen können Klassen Methoden haben. Eine Methode ist eine Funktion die innerhalb einer Klasse existiert. Der Code unten erweitert das frühere Beispiel der ``Dog``-Klasse aus dem Wiederholungsproblem 1 oben um eine Bellen-Methode.

source: The method definition is contained in lines 7-8 above. Method definitions in a class look almost exactly like function definitions. The big difference is the addition of a parameter ``self`` on line 7. The first parameter of any method in a class must be ``self``. This parameter is required even if the function does not use it.
de: Die Methode steht in den Zeilen 7-8 oben. Definitionen von Methoden in einer Klasse sehen fast genau so aus wie Funktionsdefinitionen. Der große Unterschied ist der zusätzliche Parameter ``self`` in Zeile 7. Der erste Parameter jeder Methode einer Klasse muss immer ``self`` sein. Dieser Parameter ist notwendig, auch wenn die Funktion ihn nicht verwendet.

source: Here are the important items to keep in mind when creating methods for classes:
de: Hier sind die wichtigen Punkte, wenn man Methoden für Klassen erstellt:

source: Attributes should be listed first, methods after.
de: Attribute sollten zuerst aufgeführt werden, die Methoden danach.

source: The first parameter of any method must be self.
de: Der erste Parameter jeder Methode muss immer ``self`` sein.

source: Method definitions are indented exactly one tab stop.
de: Methodendefinitionen werden genau einen Schritt eingerückt.

source: Methods may be called in a manner similar to referencing attributes from an object. See the example code below.
de: Methoden können ähnlich wie Attribute eines Objekts aufgerufen werden. Sieh das Beispiel unten.

source: Line 1 creates the dog. Lines 3-5 set the attributes of the object. Line 7 calls the ``bark`` function. Note that even through the ``bark`` function has one parameter, ``self``, the call does not pass in anything. This is because the first parameter is assumed to be a reference to the dog object itself. Behind the scenes, Python makes a call that looks like:
de: Zeile 1 erzeugt den Hund. In den Zeilen 3-5 werden die Attribute gesetzt. Zeile 7 ruft die Methode ``bark`` auf. Beachte, dass obwohl ``bark`` einen Parameter hat, beim Aufruf kein Argument übergeben wird. Die liegt daran, dass der erste Parameter als Referenz auf das ``Dog``-Objekt selbst verwendet wird. Hinter den Kulissen ruft Python das Ganze so auf:

source: If the ``bark`` function needs to make reference to any of the attributes, then it does so using the ``self`` reference variable. For example, we can change the ``Dog`` class so that when the dog barks, it also prints out the dog's name. In the code below, the name attribute is accessed using a dot operator and the ``self`` reference.
de: Wenn die ``bark``-Funktion auf eines der Attribute zugreifen will, dann verwendet sie die ``self``-Referenzvariable. So können wir zum Beispiel die Klasse ``Dog`` so anpassen, dass sie, wenn er bellt, auch seinen Namen ausgibt. Im Code unten wird auf das Attribut ``name`` mit dem Punktoperator und die Referenz ``self`` zugegriffen.

source: Attributes are adjectives, and methods are verbs. The drawing for the class would look like Figure 12.3.
de: Attribute sind Adjektive und Methoden Verben. Eine Zeichnung der Klasse würde wie Abbildung 12.3 aussehen.

source: Dog Class
de: Klasse ``Dog``

source: Example: Ball Class
de: Beispiel: Ball-Klasse

source: This example code could be used in Python/Arcade to draw a ball. Having all the parameters contained in a class makes data management easier. The diagram for the ``Ball`` class is shown in the figure below.
de: Dieser Beispielcode könnte in Python/Arcade verwendet werden, um einen Ball zu zeichnen. Dadurch, dass alle Parameter in einer Klasse gekapselt sind, wird die Datenverwaltung einfacher. Das Diagramm für die Klasse ``Ball`` ist in der Abbildung unten zu sehen.

source: Ball Class
de: Ball-Klasse

source: Below is the code that would go ahead of the main program loop to create a ball and set its attributes:
de: Unten steht der Code, der vor die Hauptschleife kommen würde, um einen Ball zu erzeugen und seine Attribute zu setzen:

source: This code would go inside the main loop to move and draw the ball:
de: Dieser Code würde in die Hauptschleife kommen, um den Ball zu bewegen und zu zeichnen:

source: References
de: Referenzen

source: Here's where we separate the true programmers from the want-to-be's. Understanding class references. Take a look at the following code:
de: Hier kommt das, was echte Programmierer von Möchte-Gern-Programmierern trennt: Klassenreferenzen zu verstehen. Sieh dir den folgenden Code an:

source: The code above creates two instances of the ``Person()`` class, and using `www.pythontutor.com`_ we can `visualize the two classes`_ in the figure.
de: Der Code oben erzeugt zwei Exemplare der Klasse ``Person`` und mit `www.pythontutor.com`_ können wir die zwei Klassen mit `visualize the two classes`_ in der Abbildung visualisieren.

source: Two Persons
de: Zwei Personen

source: The code above has nothing new. But the code below does:
de: Der Code oben enthält nichts Neues, aber der Code unten schon:

source: See the difference on line 10?
de: Siehst du den Unterschied in Zeile 10?

source: A common misconception when working with objects is to assume that the variable ``bob`` *is* the ``Person`` object. This is not the case. The variable ``bob`` is a *reference* to the ``Person`` object. That is, it stores the memory address of where the object is, and not the object itself.
de: Ein übliches Missverständnis, wenn man mit Objekten arbeitet, ist anzunehmen, dass die Variable ``bob`` das ``Person``-Objekt *ist*. Das ist nicht der Fall. Die Variable ``bob`` ist eine ``Referenz`` (Verweis) auf das ``Person``-Objekt. Das heißt, es speichert die Adresse wo sich das Objekt im Speicher befindet und nicht das Objekt selbst.

source: If ``bob`` actually was the object, then line 9 could create a *copy* of the object and there would be two objects in existence. The output of the program would show both Bob and Nancy having 100 dollars. But when run, the program outputs the following instead:
de: Wenn ``bob`` tatsächlich das Objekt wäre, würde Zeile 9 eine *Kopie* des Objekts erzeugen und es gäbe danach zwei Objekte. Das Programm würde sowohl für Bob und Nancy 100 Dollar ausgeben. Wenn das Programm abläuft, gibt es stattdessen das folgende aus:

source: What ``bob`` stores is a *reference* to the object. Besides reference, one may call this *address*, *pointer*, or *handle*. A reference is an address in computer memory for where the object is stored. This address is a hexadecimal number which, if printed out, might look something like ``0x1e504``. When line 9 is run, the address is copied rather than the entire object the address points to. See the figure below.
de: Was ``bob`` speichert, ist eine *Referenz* auf das Objekt. Man kann statt Referenz dies auch *Adresse*, *Zeiger* oder *Handle* nennen. Eine Referenz ist die Adresse im Speicher des Rechners, an der das Objekt gespeichert ist. Diese Adresse ist eine hexadezimale Zahl, die, wenn man sie ausgibt, so ähnlich wie ``0x1e504`` aussieht. Wenn die Zeile 9 ausgeführt wird, wird nur die Adresse kopiert und nicht das gesamte Objekt, auf das die Adresse zeigt. Siehe die Abbildung unten.

source: Class References
de: Klassenreferenzen

source: We can also run this in www.pythontutor.com to see how both of the variables `are pointing to the same object`_.
de: Wir können dies ebenfalls auf www.pythontutor.com ausführen um zu sehen, dass die Variablen `are pointing to the same object`_.

source: One Person, Two Pointers
de: Eine Person - zwei Zeiger

source: Functions and References
de: Funktionen und Referenzen

source: Look at the code example below. Line 1 creates a function that takes in a number as a parameter. The variable ``money`` is a variable that contains a copy of the data that was passed in. Adding 100 to that number does not change the number that was stored in ``bob.money`` on line 11. Thus, the print statement on line 14 prints out 100, and not 200.
de: Sieh dir das Codebeispiel unten an. Zeile 1 erzeugt eine Funktion, die eine Zahl als Parameter übernimmt. Die Variable ``money`` ist eine Variable, die eine Kopie der Daten enthält, die übergeben wurden. 100 zu der Zahl zu addieren verändert nicht die Zahl, die in ``bob.money`` in Zeile 11 gespeichert wurde. Die ``print``-Anweisung gibt deshalb 100 statt 200 aus.

source: `Running on PythonTutor`_ we see that there are two instances of the ``money`` variable. One is a copy and local to the give_money1 function.
de: `Running on PythonTutor`_ sehen wir, dass es zwei Exemplare der Variable ``money`` gibt. Eine ist eine Kopie und lokal in der Funktion ``give_money`` verfügbar.

source: Function References
de: Funktionsreferenzen

source: Look at the additional code below. This code does cause ``bob.money`` to increase and the ``print`` statement to print 200.
de: Sieh dir den zusätzlichen Code unten an. Dieser Code sorgt dafür, dass sich ``bob.money`` erhöht und die ``print``-Anweisung gibt 200 aus.
