Repository: Anitha489/arcade_book
Catalog: locale/*/LC_MESSAGES/chapters/14_classes/classes.po
Languages: de

source: In the example above, lines 16 and 17 print out the static variable. Line 17 is the "proper" way to do so. Unlike before, we can refer to the class name when using static variables, rather than a variable that points to a particular instance. Because we are working with the class name, by looking at line 17 we instantly can tell we are working with a static variable. Line 16 could be either an instance or static variable. That confusion makes line 17 the better choice.
de: Im obigen Beispiel geben die Zeilen 16 und 17 die Klassenvariable aus. Zeile 17 ist der "richtige" Weg, dies zu tun. Anders als zuvor können wir bei der Verwendung von Klassenvariablen auf den Klassennamen verweisen, anstatt auf eine Variable, die auf ein bestimmtes Objekt verweist. Da wir mit dem Klassennamen arbeiten, können wir in Zeile 17 sofort erkennen, dass wir mit einer Klassenvariablen arbeiten. Zeile 16 kann entweder eine Objektvariable oder eine Klassenvariable sein. Diese Unklarheit macht Zeile 17 zur besseren Wahl.

source: Line 22 prints out the instance variable, just like we've done in prior examples. Line 23 will generate an error because each instance of y is different (it is an instance variable after all) and we aren't telling the computer what instance of ``ClassA`` we are talking about.
de: Zeile 22 gibt die Objektvariable aus, genau wie in den vorherigen Beispielen. Zeile 23 erzeugt einen Fehler, weil jedes Exemplar von ``y`` anders ist (es ist schließlich eine Objektvariable) und wir dem Rechner nicht sagen, um welches Exemplar von ``ClassA`` es sich handelt.

source: Instance Variables Hiding Static Variables
de: Objektvariable verdecken Klassenvariablen

source: This is one "feature" of Python I dislike. It is possible to have a static variable, and an instance variable *with the same name*. Look at the example below:
de: Dies ist eine Eigenschaft von Python, die ich nicht mag. Es ist möglich, eine Klassenvariable und eine Objektvariable *mit demselben Namen* zu haben. Schaue dir das folgende Beispiel an:

source: Allowing instance variables to hide static variable caused confusion for me for many years!
de: Das Verbergen von Klassenvariablen durch Objektvariablen hat mich viele Jahre durcheinander gebracht!
