Repository: Anitha489/arcade_book
Catalog: locale/*/LC_MESSAGES/chapters/14_classes/classes.po
Languages: de

source: Why is this? Because ``person`` contains a copy of the memory address of the object, not the actual object itself. One can think of it as a bank account number. The function has a copy of the bank account number, not a copy of the whole bank account. So using the copy of the bank account number to deposit 100 dollars causes Bob's bank account balance to go up.
de: Warum ist das so? Weil ``person`` eine Kopie der Speicheradresse des Objekts und nicht das tatsächliche Objekt ist. Man kann sich das wie eine Kontonummer vorstellen. Die Funktion hat eine Kopie der Kontonummer und nicht eine Kopie des gesamten Bankkontos. So kann man die Kontonummer verwenden, um 100 Dollar auf Bobs Bankkonto zu überweisen und Bobs Bankguthaben erhöht sich um 100 Dollar.

source: Arrays work the same way. A function that takes in an array (list) as a parameter and modifies values in that array will be modifying the same array that the calling code created. The address of the array is copied, not the entire array.
de: Arrays funktionieren auf dieselbe Art. Eine Funktion, die ein Array (Liste) als Parameter übernimmt und die Werte in diesem Array verändert, wird das gleiche Array verwenden, das der aufrufende Code erzeugt hat. Die Adresse des Arrays wird kopiert und nicht das gesamte Array.

source: Review Questions
de: Wiederholungsfragen

source: Create a class called ``Cat``. Give it attributes for name, color, and weight. Give it a method called ``meow``.
de: Erstelle eine Klasse ``Cat``. Gib ihr Attribute für Name, Farbe und Gewicht. Gib ihr eine Methode ``meow`` genannt.

source: Create an instance of the cat class, set the attributes, and call the ``meow`` method.
de: Erzeuge ein Exemplar der Klasse ``Cat``, setze die Attribute und rufe die Methode ``meow`` auf.

source: Create a class called ``Monster``. Give it an attribute for name and an integer attribute for health. Create a method called ``decrease_health`` that takes in a parameter amount and decreases the health by that much. Inside that method, print that the animal died if health goes below zero.
de: Erstelle eine Klasse ``Monster``. Gib ihr ein Attribut für den Namen und ein Ganzzahl-Attribut für Gesundheitszustand. Erstelle eine Methode ``decrease_health``, die einen Parameter ``amount`` hat und das den Gesundheitszustand um diese Anzahl reduziert. Gib in der Methode aus, dass das Tier gestorben ist, wenn der Gesundheitszustand kleiner als Null wird.

source: Constructors
de: Konstruktoren

source: There's a terrible problem with our class for Dog listed below. When we create a dog, by default the dog has no name. Dogs should have names! We should not allow dogs to be born and then never be given a name. Yet the code below allows this to happen, and that dog will never have a name.
de: Es gibt ein schreckliches Problem mit unserer Klasse ``Dog`` unten. Wenn wir einen Hund erzeugen, hat er standardmäßig keinen Namen. Hunde sollten Namen haben! Wir sollten nicht erlauben, dass ein Hund geworfen wird und niemals einen Namen bekommt. Der Code unten erlaubt dies jedoch und dieser Hund wird nie einen Namen bekommen.

source: Python doesn't want this to happen. That's why Python classes have a special function that is called any time an instance of that class is created. By adding a function called a constructor, a programmer can add code that is automatically run each time an instance of the class is created. See the example constructor code below:
de: Python möchte nicht, dass dies passiert. Deshalb haben Python-Klassen eine spezielle Funktion, die immer aufgerufen wird, wenn ein Exemplar der Klasse erzeugt wird. Durch Hinzufügen einer Konstruktor genannten Funktion, kann ein Programmierer Code hinzufügen, der bei jeder Erstellung eines Exemplars der Klasse automatisch aufgerufen wird. Siehe den folgenden Beispiel-Konstruktorcode:

source: Example of a class with a constructor
de: Beispiel einer Klasse mit Konstruktor

source: The constructor starts on line 2. It must be named ``__init__``. There are two underscores before the init, and two underscores after. A common mistake is to only use one.
de: Der Konstruktor beginnt in Zeile 2. Er muss ``__init__`` heißen. Es gibt zwei Unterstriche vor init und zwei danach. Ein üblicher Fehler ist nur einen zu schreiben.

source: The constructor must take in self as the first parameter just like other methods in a class. When the program is run, it will print::
de: Der Konstruktor muss ``self`` als ersten Parameter haben, genau wie alle anderen Methoden einer Klasse. Wenn das Programm ausgeführt wird, wird Folgendes ausgegeben:

source: A new dog is born!
de: Ein neuer Hund wird geworfen!

source: When a Dog object is created on line 8, the ``__init__`` function is automatically called and the message is printed to the screen.
de: Wenn in Zeile 8 ein ``Dog``-Objekt erstellt wird, wird automatisch die Funktion ``__init__`` aufgerufen und die Nachricht auf dem Bildschirm ausgegeben.

source: Avoid This Mistake
de: Vermeide diesen Fehler

source: Put everything for a method into just one definition. Don't define it twice. For example:
de: Schreibe alles für eine Methode in eine Definition. Definiere es nicht zweimal. Zum Beispiel:

source: The computer will just ignore the first ``__init__`` and go with the last definition. Instead do this:
de: Der Computer ignoriert einfach das erste `` __init__`` und geht zur letzten Definition über. Schreibe stattdessen folgendes:

source: A constructor can be used for initializing and setting data for the object. The example Dog class above still allows the name attribute to be left blank after the creation of the dog object. How do we keep this from happening? Many objects need to have values right when they are created. The constructor function can be used to make this happen. See the code below:
de: Ein Konstruktor kann zum Initialisieren und Festlegen von Daten für das Objekt verwendet werden. In der obigen Beispielklasse ``Dog`` kann das Attribut ``name`` nach der Erstellung des Hundeobjekts weiterhin leer gelassen werden. Wie verhindern wir das? Viele Objekte müssen zum Zeitpunkt der Erstellung über Werte verfügen. Die Konstruktorfunktion kann verwendet werden, um dies zu erreichen. Siehe den Code unten:

source: Constructor that takes in data to initialize the class
de: Konstruktor, der Daten übernimmt um das Exemplar zu initialisieren

source: On line 3 the constructor function now has an additional parameter named ``new_name``. The value of this parameter is used to set the name attribute in the ``Dog`` class on line 8. It is no longer possible to create a ``Dog`` class without a name. The code on line 15 tries this. It will cause a Python error and it will not run. A common mistake is to name the parameter of the ``__init__`` function the same as the attribute and assume that the values will automatically synchronize. This does not happen.
de: In Zeile 3 hat die Konstruktorfunktion jetzt einen zusätzlichen Parameter mit dem Namen ``new_name``. Der Wert dieses Parameters wird verwendet, um das Attribut ``name`` in der Klasse ``Dog`` in Zeile 8 festzulegen. Es ist nicht mehr möglich, eine Klasse ``Dog`` ohne Namen zu erstellen. Der Code in Zeile 15 versucht dies. Er wird einen Python-Fehler verursachen und nicht ausgeführt. Ein häufiger Fehler besteht darin, den Parameter der Funktion ``__init__`` mit dem Attribut zu benennen und anzunehmen, dass die Werte automatisch synchronisiert werden. Das passiert nicht.

source: Should class names begin with an upper or lower case letter?
de: Sollten Klassennamen mit einem Groß- oder Kleinbuchstaben beginnen?

source: Should method names begin with an upper or lower case letter?
de: Sollten Methodennamen mit einem Groß- oder Kleinbuchstaben beginnen?

source: Should attribute names begin with an upper or lower case letter?
de: Sollten Attributnamen mit einem Groß- oder Kleinbuchstaben beginnen?

source: Which should be listed first in a class, attributes or methods?
de: Was sollte zuerst in einer Klasse aufgeführt werden, Attribute oder Methoden?

source: What are other names for a reference?
de: Welche anderen Bezeichnungen gibt es für "Referenz"?

source: What is another name for instance variable?
de: Wie nennt man Variablen eines Exemplars einer Klasse?

source: What is the name for an instance of a class?
de: Wie nennt man ein Exemplar einer Klasse?

source: Create a class called Star that will print out "A star is born!" every time it is created.
de: Erstelle eine Klasse mit dem Namen Star, die "Ein Stern ist geboren!" jedes Mal ausgibt, wenn ein Exemplar erzeugt wird.

source: Create a class called Monster with attributes for health and a name. Add a constructor to the class that sets the health and name of the object with data passed in as parameters.
de: Erstelle eine Klasse namens Monster mit Attributen für Gesundheit und Namen. Füge der Klasse einen Konstruktor hinzu, der den Zustand und den Namen des Objekts mit den als Parameter übergebenen Daten festlegt.

source: Inheritance
de: Vererbung

source: Another powerful feature of using classes and objects is the ability to make use of *inheritance*. It is possible to create a class and inherit all of the attributes and methods of a *parent class*.
de: Ein weiteres leistungsfähiges Merkmal der Verwendung von Klassen und Objekten ist die Möglichkeit, *Vererbung* zu nutzen. Es ist möglich, eine Klasse zu erstellen und alle Attribute und Methoden einer *Elternklasse* zu erben.

source: For example, a program may create a class called ``Boat`` which has all the attributes needed to represent a boat in a game:
de: Zum Beispiel kann ein Programm eine Klasse namens ``Boat`` erstellen, die alle Attribute besitzt, die benötigt werden, um ein Boot in einem Spiel darzustellen:

source: Class definition for a boat
de: Klassendefinition eines Boots

source: To test out our code:
de: So testen wir unseren Code:

source: Floating our boat
de: Unser Boot schwimmen lassen

source: The output:
de: Die Ausgabe:

source: (If you watch the video for this section of the class, you'll note that the "Boat" class in the video doesn't actually run. The code above has been corrected but I haven't fixed the video. Use this as a reminder, no matter how simple the code and how experienced the developer, test your code before you deliver it!)
de: (Wenn du dir das Video für diesen Abschnitt des Kurses ansiehst, wirst du feststellen, dass die "Boot" -Klasse im Video nicht tatsächlich ausgeführt wird. Der obige Code wurde korrigiert, aber ich habe das Video nicht repariert. Verwende dies als Warnung, egal wie einfach der Code ist und wie erfahren der Entwickler ist, testen Sie Ihren Code, bevor du ihn auslieferst!)

source: Our program also needs a submarine. Our submarine can do everything a boat can, plus we need a command for ``submerge``. Without inheritance we have two options.
de: Unser Programm braucht auch ein U-Boot. Unser U-Boot kann alles, was ein Boot kann, und wir brauchen ein Kommando für ``submerge`` (tauchen). Ohne Vererbung haben wir zwei Möglichkeiten.

source: One, add the ``submerge()`` command to our boat. This isn't a great idea because we don't want to give the impression that our boats normally submerge.
de: Erstens, füge unserem Boot die Anweisung ``submerge`` hinzu. Dies ist keine gute Idee, da wir nicht den Eindruck erwecken möchten, dass unsere Boote normalerweise unter Wasser sind.

source: Two, we could create a copy of the ``Boat`` class and call it ``Submarine``. In this class we'd add the ``submerge()`` command. This is easy at first, but things become harder if we change the ``Boat`` class. A programmer would need to remember that we'd need to change not only the ``Boat`` class, but also make the same changes to the ``Submarine`` class. Keeping this code synchronized is time consuming and error-prone.
de: Zweitens könnten wir eine Kopie der Klasse ``Boat`` erstellen und sie ``Submarine`` nennen. In dieser Klasse würden wir die Anweisung ``submerge`` hinzufügen. Das ist zunächst einfach, aber es wird schwieriger, wenn wir die Bootsklasse wechseln. Ein Programmierer müsste sich daran erinnern, dass wir nicht nur die Klasse ``Boat`` ändern müssen, sondern auch die Klasse ``Submarine``. Das Synchronisieren dieses Codes ist zeitaufwändig und fehleranfällig.

source: Luckily, there is a better way. Our program can create *child classes* that will inherit all the attributes and methods of the *parent class*. The child classes may then add fields and methods that correspond to their needs. For example:
de: Zum Glück gibt es einen besseren Weg. Unser Programm kann *Kindklassen* erstellen, die alle Attribute und Methoden der *Elternklasse* erben. Die Kindklassen können dann Attribute und Methoden hinzufügen, die ihren Anforderungen entsprechen. Zum Beispiel:

source: Line 1 is the important part. Just by putting ``Boat`` in between the parentheses during the class declaration, we have automatically picked up every attribute and method that is in the Boat class. If we update ``Boat``, then the child class ``Submarine`` will automatically get these updates. Inheritance is that easy!
de: Zeile 1 ist der wichtige Teil. Nur dadurch, dass wir ``Boat`` während der Klassendeklaration in die Klammern geschrieben haben, haben wir jedes Attribut und jede Methode in der Klasse ``Boat`` automatisch aufgenommen. Wenn wir ``Boat`` aktualisieren, erhält die Kindklasse ``Submarine`` diese Änderungen automatisch. Vererbung ist so einfach!

source: The next code example is diagrammed out in the figure below.
de: Das nächste Codebeispiel wird in der Abbildung unten dargestellt.

source: Person, Employee, Customer Classes Examples
de: Beispiel Person-, Mitarbeiter- und Kunden-Klassen

source: By placing ``Person`` between the parentheses on lines 5 and 13, the programmer has told the computer that Person is a parent class to both ``Employee`` and ``Customer``. This allows the program to set the name attribute on lines 19 and 22.
de: Durch das Platzieren von ``Person`` zwischen den Klammern in den Zeilen 5 und 13 hat der Programmierer dem Computer mitgeteilt, dass ``Person`` eine Elternklasse ist, und zwar sowohl für ``Employee`` als auch ``Customer``. Dadurch kann das Programm das Attribut ``name`` in den Zeilen 19 und 22 festlegen.

source: Methods are also inherited. Any method the parent has, the child class will have too. But what if we have a method in both the child and parent class?
de: Methoden werden ebenfalls vererbt. Jede Methode, die die Elternklasse hat, wird auch die Kindklasse haben. Aber was ist, wenn wir sowohl in der Kind- als auch in der Elternklasse eine Methode haben, die den gleichen Namen hat?

source: We have two options. We can run them both with ``super()`` keyword. Using ``super()`` followed by a dot operator, and then finally a method name allows you to call the parent's version of the method.
de: Wir haben zwei Möglichkeiten. Wir können die Methode der Elternklasse dem Schlüsselwort ``super`` in der Methode der Kindklasse aufrufen. Mit ``super`` gefolgt von einem Punktoperator und schließlich einem Methodennamen kann man die Methode der Elternklasse aufrufen.

source: The code above shows the first option using ``super`` where we run not only the child constructor but also the parent constructor.
de: Der obige Code zeigt die erste Option mit ``super``, bei der wir nicht nur den Konstruktor der Kindklasse, sondern auch den Konstruktor der Elternklasse ausführen.

source: If you are writing a method for a child and want to call a parent method, normally it will be the first statement in the child method. Notice how it is in the example above.
de: Wenn Sie eine Methode für eine Kindklasse schreiben und eine Methode der Elternklasse aufrufen möchten, ist dies normalerweise die erste Anweisung in der untergeordneten Methode. Beachten Sie, wie es im obigen Beispiel ist.

source: All constructors should call the parent constructor because then you'd have a child without a parent and that is just sad. In fact, some languages force this rule, but Python doesn't.
de: Alle Konstruktoren sollten den Konstruktor der Elternklasse aufrufen, da man sonst ein Kind ohne Eltern hätte, und das ist nur traurig. Einige Sprachen erzwingen diese Regel, Python jedoch nicht.

source: The second option? Methods may be overridden by a child class to provide different functionality. The example below shows both options. The ``Employee.report`` overrides the ``Person.report`` because it never calls and runs the parent ``report`` method. The ``Customer`` report does call the parent and the report method in ``Customer`` adds to the ``Person`` functionality.
de: Die zweite Möglichkeit? Methoden können von einer Kindklasse überschrieben werden, um andere Funktionen bereitzustellen. Das folgende Beispiel zeigt beide Optionen. Der ``Employee.report`` überschreibt den ``Person.report``, da er niemals die übergeordnete ``report``-Methode aufruft und ausführt. Der Bericht ``Kunde`` ruft das übergeordnete Element auf, und die Berichtsmethode in ``Kunde`` erweitert die Funktionalität von ``Person``.

source: Overriding constructors
de: Konstruktoren überschreiben

source: Is-A and Has-A Relationships
de: Ist-Ein- und Hat-Ein-Beziehungen

source: Classes have two main types of relationships. They are "is a" and "has a" relationships.
de: Es gibt zwei Arten von Beziehungen zwischen Klassen. Das sind die "ist ein" (englisch "is a") und "hat ein" ("has a").

source: A parent class should always be a more general, abstract version of the child class. This type of child to parent relationship is called an *is a* relationship. For example, a parent class ``Animal`` could have a child class ``Dog``. The dog *is an* animal. The ``Dog`` class could have a child class Poodle. The poodle *is a* dog, and *is an* animal.
de: Eine Elternklasse sollte immer eine allgemeinere, abstraktere Version der Kindklasse sein. Diese Art der Beziehung zwischen Kind und Eltern wird als *Ist-Ein-Beziehung* bezeichnet. Zum Beispiel könnte eine Elternklasse ``Animal`` eine Kindklasse ``Dog`` haben. Der Hund *ist ein* Tier. Die Klasse ``Hund`` könnte eine Kinderklasse ``Poodle`` (Pudel) haben. Der Pudel *ist ein* Hund und *ist ein* Tier.

source: It does not work the other way! A dolphin *is a* mammal, but a mammal is not always a dolphin. So the class ``Dolphin`` should never be a parent to a class ``Mammal``.
de: Anders herum funktioniert es nicht! Ein Delphin ist ein Säugetier, aber ein Säugetier ist nicht immer ein Delphin. Daher sollte die Klasse ``Dolphin`` niemals eine Elternklasse von ``Mammal`` sein.

source: Unrelated items that do not pass the *is a* test should not form parent/child relationships. For example, a class ``Table`` should not be a parent to a class ``Chair`` because a chair is not a table.
de: Nicht verwandte Elemente, die den Test *ist ein* nicht bestehen, sollten keine Eltern-Kind-Beziehungen eingehen. Zum Beispiel sollte eine Klasse ``Table`` kein Elternteil einer Klasse ``Chair`` sein, da ein Stuhl kein Tisch ist.

source: The other type of relationship is the *has a* relationship. These relationships are implemented in code by class attributes. A dog has a name, and so the ``Dog`` class has an attribute for name. Likewise a person could have a dog, and that would be implemented by having the Person class have an attribute for ``Dog``. The ``Person`` class would not derive from ``Dog`` because that would be some kind of insult.
de: Die andere Art der Beziehung ist die *Hat-Ein-Beziehung*. Diese Beziehungen werden durch Attribute im Code implementiert. Ein Hund hat einen Namen, und so hat die Klasse ``Dog`` ein Attribut ``name``. Ebenso könnte eine Person einen Hund haben, und dies würde implementiert, indem die Person-Klasse ein Attribut für ``Dog`` hat. Die Klasse ``Person`` würde sich nicht von ``Dog`` ableiten, weil das eine Art Beleidigung wäre.

source: Looking at the prior code example we can see:
de: Wenn wir uns das vorherige Codebeispiel ansehen, sehen wir:

source: Employee is a person.
de: Mitarbeiter ist eine Person.

source: Customer is a person.
de: Kunde ist eine Person

source: Person has a name.
de: Eine Person hat einen Namen.

source: Employee has a job title.
de: Ein Mitarbeiter hat eine Berufsbezeichnung.

source: Customer has an e-mail.
de: Ein Kunde hat eine E-Mail-Adresse.

source: Static Variables vs. Instance Variables
de: Klassen- und Objektvariablen

source: The difference between static and instance variables is confusing. Thankfully it isn't necessary to completely understand the difference right now. But if you stick with programming, it will be. Therefore we will briefly introduce it here.
de: Der Unterschied zwischen Klassen- und Objektvariablen ist verwirrend. Zum Glück ist es nicht notwendig, den Unterschied jetzt vollständig zu verstehen. Aber wenn du bei der Programmierung bleibst, wirst du den Unterschied verstehen (müssen). Deshalb werden wir ihn hier kurz vorstellen.

source: There are also some oddities with Python that kept me confused the first several years I've made this book available. So you might see older videos and examples where I get it wrong.
de: Es gibt auch einige Kuriositäten bei Python, die mich in den ersten Jahren, in denen ich dieses Buch zur Verfügung gestellt habe, verwirrt haben. Du siehst also möglicherweise ältere Videos und Beispiele, bei denen ich etwas falsch mache.

source: An *instance variable* is the type of class variable we've used so far. Each instance of the class gets its own value. For example, in a room full of people each person will have their own age. Some of the ages may be the same, but we still need to track each age individually.
de: Eine *Objektvariable* ist die Art von Attributen, die wir bisher verwendet haben. Jedes Exemplar der Klasse erhält einen eigenen Wert. In einem Raum voller Menschen hat zum Beispiel jede Person ihr eigenes Alter. Einige mögen gleich alt sein, aber wir müssen jedes Alter einzeln speichern.

source: With instance variables, we can't just say "age" with a room full of people. We need to specify *whose* age we are talking about. Also, if there are no people in the room, then referring to an age when there are no people to have an age makes no sense.
de: Bei Objektvariablen können wir bei einem Raum voller Menschen nicht einfach "Alter" sagen. Wir müssen angeben, über *wessen* Alter wir sprechen. Befinden sich keine Personen im Raum, ist es sinnlos, sich auf ihr Alter zu beziehen.

source: With *static variables* the value is the same for every single instance of the class. Even if there are no instances, there still is a value for a static variable. For example, we might have a ``count`` static variable for the number of ``Human`` classes in existence. No humans? The value is zero, but the count variable still exists.
de: Bei *Klassenvariablen* ist der Wert für jedes einzelne Exemplar der Klasse gleich. Auch wenn es keine Exemplare gibt, gibt es immer noch einen Wert für eine Klassenvariable. Zum Beispiel könnten wir eine Klassenvariable ``count`` für die Anzahl der existierenden ``Human``-Objekte haben. Keine Menschen? Der Wert ist Null, aber die Zählvariable ist noch vorhanden.

source: In the example below, ``ClassA`` creates an instance variable. ``ClassB`` creates a static variable.
de: Im Beispiel unten erzeugt ``ClassA`` eine Objektvariable und ``ClassB`` eine Klassenvariable.
