Repository: Anitha489/arcade_book
Catalog: locale/*/LC_MESSAGES/chapters/11_loops_and_random_numbers/loops_and_random_numbers.po
Languages: de

source: A very common operation is to loop until the user performs a request to quit:
de: Eine häufige Aufgabe ist zu wiederholen, bis der Benutzer ein Ende der Bearbeitung anfordert:

source: Looping until the user wants to quit
de: Wiederholen, bis der Benutzer genug hat

source: There may be several ways for a loop to quit. Using a Boolean variable to trigger the event is a way of handling that. Here's an example:
de: Es gibt mehrere Arten eine Schleife zu beenden. Die Verwendung einer Booleschen Variablen, um das Ereignis auszulösen, ist eine Art. Hier ist ein Beispiel:

source: Looping until the game is over or the user wants to quit
de: Wiederholen, bis das Spiel zu Ende ist und der Benutzer genug hat

source: This isn't perfect though, because if the user says she wants to quit, the code will still ask if she wants to attack the dragon. How could you fix this?
de: Dies ist nicht perfekt. Wenn die Benutzerin sagt, dass es ihr reicht, wird das Programm sie trotzdem fragen, ob sie den Drachen angreifen will. Wie kannst du das reparieren?

source: Here is an example of using a while loop where the code repeats until the value gets close enough to zero:
de: Hier ist ein Beispiel mit einer ``while``-Schleife, in der der Code wiederholt wird, bis der Wert nahe genug an der Null ist:

source: Common Problems With ``while`` Loops
de: Typische Probleme mit ``while``-Schleifen

source: The programmer wants to count down from 10. What is wrong and how can it be fixed?
de: Der Programmierer wollt von 10 nach unten zählen. Was ist falsch und wie kann es repariert werden?

source: What is wrong with this loop that tries to count to 10? What will happen when it is run? How should it be fixed?
de: Was ist an dieser Schleife falsch, die bis 10 zählen soll? Was wird passieren, wenn sie ausgeführt wird? Wie soll das repariert werden?

source: Example ``while`` Loops
de: Beispiel ``while``-Schleifen

source: Here's a program that covers the different uses of the while loop that we just talked about.
de: Hier ist ein Programm, das die verschiedenen Anwendungsformen von ``while``-Schleifen zeigt, die wir gerade besprochen haben.

source: The ``break`` And ``continue`` Statements
de: Die Anweisungen ``break`` und ``continue``

source: If you are in the middle of a loop, and your code encounters a ``break`` statement, you'll immediately exit the loop.
de: Wenn du mitten in einer Schleife bist und der Code läuft auf eine ``break``-Anweisung, wird die Schleife sofort beendet.

source: If you are in the middle of a loop, and your code encounters a ``continue`` statement, you'll immediately be sent back up to the top of the loop.
de: Wenn du mitten in einer Schleife bist und dein Code läuft auf eine ``continue``-Anweisung, wirst du sofort an den Anfang des Schleifenkörpers zurück geschickt.

source: Random Numbers
de: Zufallszahlen

source: Random numbers are heavily used in computer science for programs that involve games or simulations.
de: Zufallszahlen werden in der Informatik oft in Programmen eingesetzt, wenn es um Spiele oder Simulationen geht.

source: The ``randrange`` Function
de: Die ``randrange``-Funktion

source: By default, Python does not know how to make random numbers. It is necessary to have Python import a code library that can create random numbers. So to use random numbers, the first thing that should appear at the top of the program is an import statement:
de: Python weiß an sich nicht, wie es Zufallszahlen erzeugen soll. Man muss Python eine Code-Bibliothek importieren lassen, die Zufallszahlen erzeugen kann. Deshalb ist das Erste, was am Anfang eines Programms erscheinen sollte, wenn man Zufallszahlen braucht, eine ``import``-Anweisung:

source: Just like with pygame, it is important not to create a file with the same name as what is being imported. Creating a file called random.py will cause Python to start importing that file instead of the system library that creates random numbers.
de: Genau wie mit arcade, ist es wichtig, die Datei nicht so zu nennen, wie etwas das importiert werden soll. Wenn du eine Datei erzeugst, die random.py heißt, wird Python diese Datei anstelle der System-Bibliothek zum Erzeugen von Zufallszahlen importieren.

source: After this, random numbers can be created with the ``randrange`` function. For example, this code creates random numbers from 0 to 49. By default the lower bound is 0.
de: Nach dem Import können Zufallszahlen mit der ``randrange``-Funktion erzeugt werden. Dieser Code erzeugt zum Beispiel Zufallszahlen von 0 bis 49. Standardmäßig ist die untere Schranke 0.

source: Random number from 0 to 49
de: Zufallszahlen von 0 bis 49

source: The next code example generates random numbers from 100 to 200. Just like the range function the second parameter specifies an upper-bound that is not inclusive. Therefore if you want random numbers up to and including 200, specify 201.
de: Das nächste Codebeispiel erzeugt Zufallszahlen von 100 bis 200. Genau wie bei der ``range``-Funktion, ist der zweite Parameter die nicht-inklusive, obere Schranke. Wenn du Zufallszahlen bis und einschließlich 200 haben willst, gib deshalb 201 an.

source: Random number from 100 to 200
de: Zufallszahlen von 100 bis 200

source: Random Chance
de: Zufallsauswahl

source: Often in games there is a random chance of something happening. How do we program this? It isn't too hard. Here's an example where we have a 1 in 5 chance of meeting a dragon:
de: In Spielen gibt es oft eine zufällige Chance, dass etwas passiert. Wie setzen wir das um? Es ist nicht besonders schwierig. Hier ist ein Beispiel, in dem wir eine 1 zu 5 Chance haben, auf einen Drachen zu treffen:

source: Random Chance of Something Happening
de: Zufällige Chance, dass etwas passiert

source: This code repeats twenty times. Inside the loop, we "roll the dice" and get a number between 0 and 4. If we roll a 0, then we encounter a dragon. Otherwise we don't.
de: Dieser Code wird 20 mal wiederholt. In der Schleife "werfen wir einen Würfel" und bekommen eine Zahl zwischen 0 und 4. Wenn wir eine 0 werfen, dann treffen wir auf einen Drachen, andernfalls nicht.

source: The ``random`` Function
de: Die Funktion ``random``

source: All of the prior code generates integer numbers. If a floating point number is desired, a programmer may use the ``random`` function.
de: Der gesamte vorherige Code generiert Ganzzahlen. Wenn eine Gleitkommazahl gewünscht wird, kann ein Programmierer die Funktion ``random`` verwenden.

source: The code below generates a random number from 0 to 1 such as 0.4355991106620656.
de: Der Code unten generiert eine Zufallszahl von 0 bis 1, zum Beispiel 0,4355991106620656.

source: Random floating point number from 0 to 1
de: Zufällige Gleitkommazahl von 0 bis 1

source: With some simple math, this number can be adjusted. For example, the code below generates a random floating point number between 10 and 15:
de: Mit etwas einfacher Mathematik kann diese Zahl angepasst werden. Der folgende Code generiert beispielsweise eine zufällige Gleitkommazahl zwischen 10 und 15:

source: Random floating point number between 10 and 15
de: Zufällige Gleitkommazahl zwischen 10 und 15

source: Number Guessing Game Example
de: Beispiel für ein Zahlenratespiel

source: Here is the code for the number guessing game at the start of the chapter.
de: Hier folgt der Code für das Zahlenratespiel vom Anfang des Kapitels.

source: Mudball Example
de: Beispiel Mudball

source: This is a fun text-only game that two players can play. It uses a few concepts we haven't covered yet.
de: Dies ist ein spaßiges Nur-Text-Spiel, das zwei Spieler spielen können. Es werden einige Konzepte verwendet, die wir noch nicht behandelt haben.
