Repository: Anitha489/arcade_book
Catalog: locale/*/LC_MESSAGES/chapters/11_loops_and_random_numbers/loops_and_random_numbers.po
Languages: de

source: Guessing Games with Random Numbers and Loops
de: Ratespiele mit Zufallszahlen und Schleifen

source: Our next step is how to loop a section of code. Most games "loop." They repeat the same code over and over. For example the number guessing game below loops for each guess that the user makes:
de: Unser nächster Schritt ist, einen Programmabschnitt zu wiederholen. Die meisten Spiele "wiederholen". Sie führen den gleichen Programmcode immer und immer wieder aus. Im Zahlenratespiel wird zum Beispiel für jeden Rateversuch der Programmcode wiederholt.

source: (Code for this program is below: :ref:`number-guessing-game-code`)
de: (Der Code für dieses Programm steht unten: :ref:`number-guessing-game-code`)

source: Wait, what does this looping have to do with graphics and video games? A lot. Each *frame* the game displays is one time through a loop. You may be familiar with the frames-per-second (FPS) statistic that games show. The FPS represents the number of times the computer updates the screen each second. The higher the rate, the smoother the game. (Although an FPS rate past 60 is faster than most screens can update, so there isn't much point to push it past that.) The figure below shows the game Eve Online and a graph showing how many frames per second the computer is able to display.
de: Warte, was hat diese Wiederholerei mit Grafiken und Computerspielen zu tun? Eine Menge. Jeder *Frame* den das Spiel anzeigt ist ein Schleifendurchlauf. Du kennst vielleicht den Wert Frames pro Sekunde (FPS), die Spiele anzeigen. Der FPS-Wert gibt an, wie oft der Rechner den Bildschirm jede Sekunde aktualisiert. Je höher der Wert ist, desto flüssiger ist das Spiel. (Obwohl ein FPS-Wert größer als 60 schneller ist, als die meisten Bildschirme aktualisieren können, gibt es keinen Grund nicht über diesen Punkt hinaus zu gehen.) Die Abbildung unten zeigt das Spiel Eve Online und einen Graph, der anzeigt, wie oft der Rechner den Frame aktualisieren kann.

source: FPS in video games
de: FPS bei Videospielen

source: The loop in these games works like the flowchart in the figure below. Despite the complexities of modern games, the inside of this loop is similar to a calculator program. Get user input. Perform calculations. Output the result. In a video game, we try to repeat this up to 60 times per second.
de: Die Schleife in diesen Spielen funktioniert wie der Programmablaufplan in der Abbildung unten. Trotz der Komplexität moderner Spiele, ist die Schleife ähnlich zu einem Taschenrechnerprogramm. Hole die Eingabe des Benutzers. Führe Berechnungen aus. Gib das Ergebnis aus. In einem Videospiel versuchen wir das bis zu 60 mal pro Sekunde zu wiederholen.

source: Game loop
de: Spielschleife

source: There can even be loops inside of other loops. A real "loop the loop." Take a look at the "Draw Everything" box in Figure 4.2. This set of code loops through and draws each object in the game. That loop is inside of the larger loop that draws each frame of the game, which looks like the figure below.
de: Schleifen können sogar innerhalb von anderen Schleifen sein. Schau dir den Kasten "Draw Everything" in der Abbildung oben an. Dieser Codeabschnitt wird wiederholt und zeichnet jedes Objekt des Spiels. Diese Schleife ist in einer größeren Schleife, die jeden Frame des Spiels zeichnet. Dies sieht aus, wie in der Abbildung unten dargestellt.

source: Draw everything loop
de: Zeichne-Alles-Schleife

source: There are two major types of loops in Python, ``for`` loops and ``while`` loops. If you want to repeat a certain number of times, use a ``for`` loop. If you want to repeat until something happens (like the user hits the quit button) then use a ``while`` loop.
de: In Python gibt es zwei Hauptarten von Schleifen, ``for``-Schleifen und ``while``-Schleifen. Wenn du etwas eine bestimmte Anzahl mal ausführen willst, nimm eine ``for``-Schleife. Wenn du etwas wiederholen willst, bis etwas passiert (der Benutzer zum Beispiel eine Taste drückt), dann nimm eine ``while``-Schleife.

source: For example, a ``for`` loop can be used to print all student records since the computer knows how many students there are. A ``while`` loop would need to be used to check for when a user hits the mouse button since the computer has no idea how long it will have to wait.
de: Man kann zum Beispiel eine ``for``-Schleife verwenden, um eine Liste aller Studierenden auszugeben, da der Rechner weiß, wie viel Studierende es gibt. Eine ``while``-Schleife müsste man nehmen, um zu prüfen, wenn der Benutzer den Mausknopf drückt, da der Rechner keine Idee hat wie lange er warten muss.

source: For Loops
de: ``for``-Schleifen

source: The ``for`` loop example below runs the print statement five times. It could just as easily run 100 or 1,000,000 times just by changing the 5 to the desired number of times to loop. Note the similarities of how the ``for`` loop is written to the if statement. Both end in a colon, and both use indentation to specify which lines are affected by the statement.
de: Die ``for``-Schleife im Beispiel unten führt die ``print``-Funktion fünfmal aus. Sie könnte genau so leicht auch 100 oder eine Million mal ausgeführt werden, einfach durch Ändern der 5 in die gewünschte Anzahl von Wiederholungen. Beachte die Ähnlichkeit der Schreibweise der ``for``-Schleife zum ``if``. Beide enden mit einem Doppelpunkt und beide verwenden die Einrückung, um festzulegen welche Zeilen zur Anweisung gehören.

source: Loop to print five times
de: Schleife um fünfmal auszugeben

source: Output:
de: Ausgabe:

source: The ``i`` on line 1 is a variable that keeps track of how many times the program has looped. It is a new variable and can be named any legal variable name. Programmers often use ``i`` as for the variable name, because the ``i`` is short for *increment*. This variable helps track when the loop should end.
de: Das ``i`` in Zeile 1 ist eine Variable, die mitzählt wie oft das Programm wiederholt hat. Es ist eine neue Variable und sie kann jeden erlaubten Variablennamen bekommen. Programmierer nehmen oft den Namen ``i`` als Variablennamen, das ``i`` eine Abkürzung für *Inkrement* ist. Diese Variable hilft zu verfolgen, wann die Schleife enden soll.

source: The ``range`` function controls how many times the code in the loop is run. In this case, five times.
de: Die ``range``-Funktion beeinflusst wie oft der Code in der Schleife ausgeführt wird. In diesem Fall ist es fünfmal.

source: The next example code will print "Please," five times and "Can I go to the mall?" only once. "Can I go to the mall?" is not indented so it is not part of the for loop and will not print until the for loop completes.
de: Das nächste Beispielprogramm wird fünfmal "Please," ausgeben und nur einmal "Can I go to the mall?". "Can I go to the mall?" ist nicht eingerückt und ist deshalb kein Teil der Schleife und wird erst nach dem Ende der schleife ausgeführt.

source: This next code example takes the prior example and indents line 3. This change will cause the program to print "Please," and "Can I go to the mall?" five times. Since the statement has been indented "Can I go to the mall?" is now part of the for loop and will repeat five times just like the word "Please,".
de: Das nächste Codebeispiel nimmt das vorherige Beispiel und rückt Zeile 3 ein. Diese Änderung sorgt dafür, dass das Programm "Please," und "Can I go to the mall?" fünfmal ausgibt. Da die Anweisung eingerückt wurde, gehört "Can I go to the mall?" zur Schleife und wird genau wie "Please," fünfmal ausgegeben.

source: You aren't stuck using a specific number with the ``range`` function. This example asks the user how many times to print using the ``input`` function we talked about back in :ref:`input-function`.
de: Du kannst nicht nur vorgegebene Zahlen in der ``range``-Funktion verwenden. Dieses Beispiel fragt den Benutzer wie oft es ausgeben soll, indem es die ``input``-Funktion, die wir im Abschnitt :ref:`input-function` kennen gelernt haben, verwendet.

source: Loop according to the user input
de: Wiederholung entsprechend Benutzereingabe

source: Or you could write a function, and take in the value by a parameter:
de: Oder du könntest eine Funktion schreiben, die einen Wert als Parameter übernimmt:

source: Loop according to a function parameter
de: Wiederholung entsprechend einem Funktionsparameter

source: The code below will print the numbers 0 to 9. Notice that the loop starts at 0 and does not include the number 10. It is natural to assume that ``range(10)`` would include 10, but it stops just short of it.
de: Der Code unten wird die Zahlen 0 bis 9 ausgeben. Beachte, dass die Wiederholung bei 0 anfängt und die Zahl 10 nicht enthält. Natürlicherweise würden wir annehmen, dass ``range(10)`` die 10 beinhaltet, aber sie hört kurz vor der 10 auf.

source: Print the numbers 0 to 9
de: Gib die Zahlen 0 bis 9 aus

source: A program does not need to name the variable ``i``, it could be named something else. For example a programmer might use ``line_number`` if she was processing a text file.
de: Ein Programm muss die Variable nicht ``i`` nennen. Es könnte sie auch sonst wie benennen. Zum Beispiel könnte eine Programmiererin ``line_number`` verwenden, wenn sie eine Textdatei bearbeitet.

source: If a programmer wants to go from 1 to 10 instead of 0 to 9, there are a couple ways to do it. The first way is to send the ``range`` function two numbers instead of one. The first number is the starting value, the second is just beyond the ending value.
de: Wenn der Programmierer aber Zahlen von 1 bis 10 haben möchte, gibt es mehrere Wege das zu erreichen. Der erste Weg ist, der ``range``-Funktion zwei Zahlen mitzugeben. Die erste Zahl ist der Startwert. Die zweite Zahl ist die Zahl, die auf den Endwert folgt.

source: It does take some practice to get used to the idea that the for loop will include the first number, but not the second number listed. The example below specifies a range of (1, 11), and the numbers 1 to 10 are printed. The starting number 1 is included, but not the ending number of 11.
de: Mit etwas Übung gewöhnt man sich schnell an die Tatsache, dass die Wiederholung die erste Zahl einschließt, aber nicht die zweite Zahl. Das Beispiel unten gibt als Bereich (1,11) an und die Zahlen 1 bis 10 werden ausgegeben. Die Startzahl 1 gehört dazu, aber die Endzahl 11 nicht.

source: Print the numbers 1 to 10, version 1
de: Gib die Zahlen 1 bis 10 aus, Version 1

source: Another way to print the numbers 1 to 10 is to still use ``range(10)`` and have the variable i go from 0 to 9. But just before printing out the variable the programmer adds one to it. This also works to print the numbers 1 to 10. Either method works just fine.
de: Der andere Weg die Zahlen 1 bis 10 auszugeben ist weiterhin ``range(10)`` zu verwenden und die Variable ``i`` von 0 bis 9 laufen zu lassen, aber vor der Ausgabe 1 dazu zu addieren. Das führt ebenfalls dazu, dass die Zahlen 1 bis 10 ausgegeben werden. Beide Methoden funktionieren gut.

source: Print the numbers 1 to 10, version 2
de: Gib die Zahlen 1 bis 10 aus, Version 2

source: Counting By Numbers Other Than One
de: Andere Schrittweiten als eins

source: If the program needs to count by 2's or use some other increment, that is easy. Just like before there are two ways to do it. The easiest is to supply a third number to the ``range`` function that tells it to count by 2's. The second way to do it is to go ahead and count by 1's, but multiply the variable by 2. The code example below shows both methods.
de: Wenn das Programm in Zweierschritten oder einem anderen Inkrement zählen soll, ist das einfach. Genau wie oben, gibt es zwei Wege. Am einfachsten ist es der ``range``-Funktion eine dritte Zahl mitzugeben, die ihr mitteilt in Zweierschritten zu zählen. Der zweite Weg ist weiterhin in Einerschritten zu zählen und den Wert der Variablen zu verdoppeln. Der Programmcode unten zeigt beide Wege.

source: Two ways to print the even numbers 2 to 10
de: Zwei Wege, die geraden Zahlen von 2 bis 10 auszugeben

source: Output::
de: Ausgabe:

source: It is also possible to count backwards down towards zero by giving the ``range`` function a negative step. In the example below, start at 10, go down to but not including 0, and do it by -1 increments. The hardest part of creating these loops is to accidentally switch the start and end numbers. The program starts at the larger value, so it goes first. Normal for loops that count up start with the smallest value listed first in the ``range`` function.
de: Es ist ebenfalls möglich rückwärts in Richtung 0 zu zählen, indem man der ``range``-Funktion eine negative Schrittweite mitgibt. Im Beispiel unten beginnen wir bei 10 und gehen nach unten, aber nicht bis zur 0, in -1 Inkrementen. Das Programm startet mit dem größeren Wert, also kommt er als erstes. Normale Wiederholungen, die hochzählen, starten mit dem kleinsten Wert als erstes Argument in der ``range``-Funktion.

source: Count down from 10 to 1
de: Runterzählen von 10 bis 1

source: If the numbers that a program needs to iterate through don't form an easy pattern, it is possible to pull numbers out of a list. (A full discussion of lists is covered in a later chapter. This is just a preview of what you can do.)
de: Wenn die Zahlen, die das Programm aufzählen soll, keinem einfachen Muster folgen, dann kann man die Zahlen aus einer Liste beziehen. (Eine ausführliche Beschreibung von Listen folgt in einem späteren Kapitel. Dies ist nur eine Vorschau auf das, was du machen kannst.)

source: Print numbers out of a list
de: Gib Zahlen aus einer Liste aus.

source: This prints::
de: Dies gibt aus:

source: Nesting Loops
de: Verschachtelte Wiederholungen

source: Try to predict what the code below will print. Then enter the code and see if you are correct.
de: Versuche vorherzusagen, was das Programm unten ausgeben wird. Gib dann den Programmcode ein und probiere aus, ob du richtig lagst.

source: This next block of code is almost identical to the one above. The second for loop has been indented one tab stop so that it is now nested inside of the first for loop. This changes how the code runs significantly. Try it and see.
de: Der Codeblock unten ist fast identisch, zu dem oben. Die zweite Wiederholung wurde einen weiteren Schritt eingerückt, so dass sie jetzt in die erste Wiederholung einbettet ist. Das verändert entscheidend, was das Programm ausführt. Probier es aus und sieh.

source: I'm not going to tell you what the code does, go to a computer and see.
de: Ich werde dir nicht verraten was das Programm macht. Geh an den Rechner und probiere es aus.

source: Keeping a Running Total
de: Eine laufende Summe führen

source: A common operation in working with loops is to keep a running total. This "running total" code pattern is used a lot in this book. Keep a running total of a score, total a person's account transactions, use a total to find an average, etc. You might want to bookmark this code listing because we'll refer back to it several times. In the code below, the user enters five numbers and the code totals up their values.
de: Eine übliche Aufgabe für Wiederholungen ist eine laufende Summe zu führen. Dieses "laufende Summe"-Codemuster wird in diesem Buch häufig verwendet. Eine laufende Summe des Punktestands, die Summe der Kontobewegungen einer Person, die Summe, um einen Durchschnittswert zu berechnen, und so weiter. Du solltest dieses Programmlisting mit einem Lesezeichen markieren, weil wir später mehrmals darauf zurückkommen. Im Programmcode unten gibt der Benutzer eine Zahl fünfmal ein und das Programm addiert ihre Werte zu einer Summe auf.

source: Keep a Running Total
de: Führe eine laufende Summe

source: Note that line 1 creates the variable total, and sets it to an initial amount of zero. It is easy to forget the need to create and initialize the variable to zero. Without it the computer will complain when it hits line 4. It doesn't know how to add n``ew_number`` to total because total hasn't been given a value yet.
de: Beachte, dass in Zeile 1 die Variable ``total`` erstellt und auf den Anfangswert Null festgelegt wird. Es ist leicht zu vergessen, dass die Variable erstellt und auf Null initialisiert werden muss. Ohne dies beschwert sich der Rechner, wenn er Zeile 4 erreicht. Er weiß nicht, wie er ``new_number`` zu ``total`` addieren soll, da ``total`` noch keinen Wert zugewiesen bekommen hat.

source: A common mistake is to use ``i`` to total instead of ``new_number``. Remember, we are keeping a running total of the values entered by the user, not a running total of the current loop count.
de: Ein üblicher Fehler ist, ``i`` zur Summe zu addieren anstatt von ``new_number``. Erinnere dich, wir wollen die Summe, der vom Benutzer eingegebenen Werte, führen und nicht die laufende Summe des Wiederholungszählers.

source: Speaking of the current loop count, we can use the loop count value to solve some mathematical operations. For example:
de: Wenn wir schon beim Wiederholungszähler sind. Wir können den Wert des Wiederholungszählers verwenden, um damit einige mathematische Operationen durchzuführen. Zum Beispiel:

source: If you aren't familiar with this type of formula, it is just a fancy way of stating:
de: Wenn du diese Art von Formel nicht kennst, es ist nur eine schicke Art zu sagen:

source: The code below adds all the numbers from 1 to 100. It demonstrates a common pattern where a running total is kept inside of a loop. This also uses a separate variable sum to track the running total.
de: Der Programmcode unten addiert alle Zahlen von 1 bis 100. Es zeigt ein übliches Muster, wo eine laufende Summe in einer Wiederholung geführt wird. Dies verwendet eine separate Variable ``sum``, um die laufende Gesamtsumme zu verfolgen.

source: Sum all numbers 1 to 100
de: Summiere alle Zahlen von 1 bis 100

source: Here's a different variation. This takes five numbers from the user and counts the number of times the user enters a zero:
de: Hier ist eine andere Variante. Diese nimmt fünf Zahlen von Benutzer und zählt wie oft der Benutzer eine 0 eingibt:

source: A programmer that understands the nested for loops and running totals should be able to predict the output of the code below.
de: Ein Programmierer, der ineinander geschachtelte Wiederholungen und laufende Summen versteht, sollte die Ausgabe des folgenden Programms vorhersagen können.

source: Don't go over this section too fast. Give it a try and predict the output of the code above. Then copy it into a Python program and run it to see if you are right. If you aren't, figure out why.
de: Geh nicht zu schnell über diesen Abschnitt hinweg. Probiere, die Ausgabe des Programmcodes oben vorherzusagen. Kopiere ihn dann in ein Python-Programm und führe ihn aus, um zu sehen, ob du recht hattest. Wenn du nicht recht hattest, finde heraus warum.

source: Example for Loops
de: Beispiel für Wiederholungen

source: This example code covers common for loops and shows how they work.
de: Dieses Beispiel deckt Gemeinsamkeiten bei Wiederholungen ab und zeigt, wie sie funktionieren.

source: While Loops
de: While-Schleifen

source: A ``for`` loop is used when a program knows it needs to repeat a block of code for a certain number of times. A ``while`` loop is used when a program needs to loop until a particular condition occurs.
de: Eine ``for``-Schleife wird verwendet, wenn das Programm weiß, dass es einen Codeblock eine bestimmte Anzahl wiederholen muss. Eine ``while``-Schleife wird verwendet, wenn das Programm wiederholen muss, bis eine bestimmte Bedingung auftritt.

source: Oddly enough, a while loop can be used anywhere a ``for`` loop is used. It can be used to loop until an increment variable reaches a certain value. Why have a ``for`` loop if a while loop can do everything? The ``for`` loop is simpler to use and code. A ``for`` loop that looks like this:
de: Seltsam genug: Es kann eine ``while``-Schleife überall verwendet werden, wo eine ``for``-Schleife verwendet wird. Sie kann verwendet werden, um eine Variable zu inkrementieren, bis sie einen bestimmten Wert erreicht. Warum gibt es eine ``for``-Schleife, wenn die ``while``-Schleife alles kann? Die ``for``-Schleife lässt sich einfacher anwenden und programmieren. Die ``for``-Schleife sieht so aus:

source: Using a ``for`` loop to print the numbers 0 to 9
de: Die Zahlen 0 bis 9 mit einer ``for``-Schleife ausgeben

source: Can be done with a ``while`` loop that looks like this:
de: Das kann auch mit einer ``while``-Schleife, die wie folgt aussieht, erreicht werden:

source: Using a while loop to print the numbers 0 to 9
de: Die Zahlen von 0 bis 9 mit einer ``while``-Schleife ausgeben

source: Line 1 of the while loop sets up a "sentinel" variable that will be used to count the number of times the loop has been executed. This happens automatically in a ``for`` loop eliminating one line of code. Line 2 contains the actual ``while`` loop. The format of the while loop is very similar to the if statement. If the condition holds, the code in the loop will repeat. Line 4 adds to the increment value. In a ``for`` loop this happens automatically, eliminating another line of code. As one can see from the code, the for loop is more compact than a ``while`` loop and is easier to read. Otherwise programs would do everything with a ``while`` loop.
de: In Zeile 1 der ``while``-Schleife wird eine "Wächter"-Variable (englisch *sentinel*) eingerichtet, die zählt, wie oft die Schleife ausgeführt wurde. Dies wird bei der ``for``-Schleife automatisch ausgeführt und spart uns eine Zeile Code. Zeile 2 enthält die eigentliche ``while``-Schleife. Das Format der ``while``-Schleife ist sehr ähnlich zum ``if``. Wenn die Bedingung erfüllt, wird der Code im Schleifenkörper ausgeführt. In Zeile 4 wird der Zähler inkrementiert. In einer ``for``-Schleife passiert auch das automatisch und spart eine weitere Zeile Code. Wie man in den Beispielen sehen kann, ist die ``for``-Schleife kompakter und einfacher zu lesen als die ``while``-Schleife. Andernfalls würde alles in Programmen mit der ``while``-Schleife umgesetzt.

source: A common mistake is to confuse the ``for`` loop and the ``while`` loop. The code below shows a programmer that can't quite make up his/her mind between a ``for`` loop or a ``while`` loop.
de: ``for``- und ``while``-Schleifen werden häufig verwechselt. Der Code unten zeigt wie ein Programmierer sich nicht so richtig zwischen ``for`` und ``while`` entscheiden kann.

source: Example of a confused loop
de: Beispiel einer verwirrten Schleife

source: Don't use range with a ``while`` loop!
de: Verwende ``range`` nicht mit einer ``while``-Schleife!

source: The ``range`` function only works with the ``for`` loop. Do not use it with the ``while`` loop!
de: Die ``range``-Funktion funktioniert nur mit der ``for``-Schleife. Verwende sie nicht mit der ``while``-Schleife.

source: Using Increment Operators
de: Verwenden von Inkrement-Operatoren

source: Increment operators are often used with ``while`` loops. It is possible to short-hand the code:
de: Inkrement-Operatoren werden oft in ``while``-Schleifen verwendet. Es ist möglich den Code zu verkürzen:

source: With the following:
de: Mit dem folgenden:

source: In the while loop it would look like:
de: In der ``while``-Schleife würde es wie folgt aussehen:

source: This can be done with subtraction and multiplication as well. For example:
de: Dies kann mit Subtraktion und Multiplikation auch gemacht werden. Zum Beispiel:

source: Is the same as:
de: Es ist das gleiche wie:

source: See if you can figure out what would this print:
de: Schau, ob du herausfinden kannst, was dies ausgeben wird:

source: Looping Until User Wants To Quit
de: Wiederholen, bis der Benutzer genug hat
