Repository: Anitha489/arcade_book
Catalog: locale/*/LC_MESSAGES/chapters/05_print_statement/print_statement.po
Languages: de

source: The ``print`` Function
de: Die Funktion ``print``

source: Printing Hello World
de: Hello World ausgeben

source: We will use a function called ``print`` to print to the screen. ``print`` is called a *function*.
de: Wir werden die ``print`` genannte Funktion benutzen, um etwas auf dem Bildschirm auszugeben. ``print`` wird eine *Funktion* genannt.

source: You've already used functions in mathematics. For example, **sin** and **cos**. Functions are followed by parentheses: ``( )``. We put the function *parameter(s)* inside the parenthesis.
de: Wir kennen Funktionen aus der Mathematik. Zum Beispiel sind **sin** und **cos** Funktionen in der Mathematik. Auf den Funktionsnamen folgen runde Klammern ``( )``. Die *Argumente* der Funktion packen wir in die Klammern.

source: With a sine function, we put in an angle. With the ``print`` function, we are going to put the text we want to print. Text must be enclosed in quotes.
de: Bei der Sinus-Funktion stecken wir den Winkel als Argument in die Klammern. Bei der ``print``-Funktion kommt der Text, den wir ausgeben wollen, in die Klammern. Text muss in Anführungszeichen stehen.

source: Note that case matters. The following will not work:
de: Beachte, dass Groß- und Kleinschreibung einen Unterschied macht. Das Folgende wird nicht funktionieren:

source: Great! Time to run it.
de: Klasse! Es wird Zeit, das Programm auszuführen.

source: Right-click on the program and select "Run 'lab_01.py'"
de: Rechtsklicke auf das Programm und wähle "Run 'lab_01.py'".

source: Before we go on, note how the PyCharm window is put together. See the output of your program at the bottom of the screen. Click the image below to make it bigger and note the:
de: Schau dir an, wie das PyCharm-Fenster aufgebaut ist, bevor wir weiter gehen. Unten findest du die Ausgabe deines Programms. Klicke auf das Bild unten um es zu vergrößern und beachte:

source: Right margin. You can write code past this point, but don’t.
de: Rechter Randbereich. Du kannst Programmcode über den Randbereich hinaus schreiben, aber lass es.

source: Where you can hover your mouse for "hints" on how to make your code better.
de: Wo du mit dem Mauszeiger herumlungern kannst, um "Hinweise" zu bekommen wie dein Code besser wird.

source: Where you can quickly click to run your program again.
de: Wo du schnell klicken kannst, um dein Programm wieder auszuführen.

source: Ok, now it's time to update our program. Go back to our program and improve it by printing multiple lines, while quoting Snoopy's famous story:
de: OK, jetzt wird es Zeit dein Programm zu aktualisieren. Gehe zurück zu deinem Programm und verbessere es durch die Ausgabe von mehreren Zeilen, die Snoopys berühmte Geschichte zitieren:

source: Multiple Print Lines
de: Mehrere Zeilen ausgeben

source: Let's add additional code:
de: Lass uns zusätzlichen Programmcode hinzufügen:

source: Go ahead and run it to make sure it outputs as expected.
de: Mach weiter und führe es aus, um zu sehen, ob die Ausgabe ist wie erwartet.

source: If quotes are used to tell the computer the start and end of the string of text you wish to print, how does a program print out a set of double quotes? (This is a double quote ``"`` and this is a single quote ``'``.) For example:
de: Wenn Anführungszeichen verwendet werden, um dem Rechner den Anfang und das Ende einer Zeichenkette, die du ausgeben willst, anzugeben, wie kann dann das Programm doppelte Anführungszeichen ausgeben? (Dies ist ein doppeltes Anführungszeichen ``"`` und dies ist ein einfaches Anführungszeichen ``'``.) Zum Beispiel:

source: This code doesn't work. The computer looks at the quote in the middle of the string and thinks that is the end of the text. Then it has no idea what to do with the commands for some reason and the quote and the end of the string confuses the computer even further.
de: Dieser Code funktioniert nicht. Der Rechner sieht das Anführungszeichen in der Mitte der Zeichenkette und denkt es ist das Ende der Zeichenkette. Danach weiß er aus irgendeinem Grund nicht mehr, was er mit den Kommandos anfangen soll. Das Anführungszeichen am Ende der Zeichenkette verwirrt ihn noch mehr.

source: It is necessary to tell the computer that we want to treat that middle double quote as text, not as a quote ending the string. This is easy, just prepend a backslash in front of quotes to tell the computer it is part of a string, not a character that terminates a string. For example:
de: Wir müssen dem Rechner sagen, dass das Anführungszeichen in der Mitte als Text behandelt werden soll und nicht als Anführungszeichen, das die Zeichenkette beendet. Das ist leicht, schreibe einfach einen Backslash vor das Anführungszeichen. Jetzt weiß der Rechner, dass es Teil der Zeichenkette und kein Zeichen zum Beenden der Zeichenkette ist. Zum Beispiel:

source: This combination of the two characters ``\"`` is called an *escape code*. Almost every language has escape codes. Here's another example:
de: Die Kombination von den beiden Zeichen ``\"`` wird Escape-Code genannt. Fast jede Sprache hat Escape-Codes. Hier ist ein anderes Beispiel:

source: print("Audrey Hepburn once said \"Nothing is impossible. The word itself says 'I'm Possible!'.\"")
de: print("Audrey Hepburn sagte einmal: \"Nothing is impossible. The word itself says 'I'm Possible!'.\"")

source: This will print:
de: Das wird ausgeben:

source: Audrey Hepburn once said "Nothing is impossible. The word itself says 'I'm Possible!'."
de: Audrey Hepburn sagte einmal: "Nothing is impossible. The word itself says 'I'm Possible!'."

source: Because the backslash is used as part of an escape code, the backslash itself must be escaped if you want to use one. For example, this code does not work correctly:
de: Weil der Backslash als Teil des Escape-Codes verwendet wird, muss er selbst als Escape-Code eingegeben werden. Dieser Code wird zum Beispiel nicht wie erwartet funktionieren:

source: Why? Because ``\n`` is an escape code. To print the backslash it is necessary to escape it like so:
de: Warum? ``\n`` ist ein Escape-Code. Um den Backslash auszugeben, muss er selbst wie im folgenden Beispiel als Escape-Code eingegeben werden:

source: There are a few other important escape codes to know. Here is a table of the important escape codes:
de: Es gibt noch ein paar weitere Escape-Codes, die man kennen sollte. Hier ist eine Tabelle mit wichtigen Escape-Codes:

source: Description
de: Beschreibung

source: Single Quote
de: Einfaches Anführungszeichen

source: Double Quote
de: Doppeltes Anführungszeichen

source: Tab
de: Tabulator

source: CR: Carriage Return (move to the left)
de: CR: Wagenrücklauf (bewege den Cursor ganz nach links)

source: LF: Linefeed (move down)
de: LF: Zeilenumbruch (bewege den Cursor eine Zeile nach unten)

source: What is a "Carriage Return" and a "Linefeed"? Try this example:
de: Was sind "Wagenrücklauf" und "Zeilenumbruch"? Probiere dieses Beispiel aus:

source: The output from this command is:
de: Die Ausgabe des Kommandos ist:

source: The ``\n`` is a linefeed. It moves "cursor" where the computer will print text down one line. The computer stores all text in one big long line. It knows to display the text on different lines because of the placement of ``\n`` characters.
de: Das ``\n`` ist ein Zeilenvorschub. Er bewegt den "Cursor", wodurch der Rechner den Text eine Zeile weiter unten ausgibt. Der Rechner speichert den Text in einer großen, langen Zeile. Er weiß, dass er den Text auf mehrere Zeilen aufteilen soll, wegen der Platzierung der ``\n``-Zeichen im Text.

source: To make matters more complex, different operating systems have different standards on what makes a line ending.
de: Um die Sache zu verkomplizieren, haben die verschiedenen Betriebssysteme verschiedene Standard, was eine Zeile beendet.

source: LF: UNIX based systems, and newer Macs.
de: LF: UNIX basierte Systeme und neuere Macs

source: CR: Older Mac based systems
de: CR: Ältere Mac basierte Systeme

source: Ok, now it is time to make this lab yours. Write program that consists of several print statements. Here is my example:
de: OK, jetzt wird es Zeit deine Aufgabe zu bearbeiten. Schreibe ein Programm, das aus mehreren print-Anweisungen besteht. Hier ist mein Beispiel:
