Repository: Anitha489/arcade_book
Catalog: locale/*/LC_MESSAGES/chapters/24_searching/searching.po
Languages: de

source: A lower bound of 89, upper bound of 95, mid point of :math:`\frac{89+95}{2}=92`.
de: Eine Untergrenze von 89, Obergrenze von 95, Mittelpunkt von :math:`\frac{89+95}{2} = 92`.

source: A lower bound of 93, upper bound of 95, mid point of :math:`\frac{93+95}{2}=94`.
de: Eine Untergrenze von 93, Obergrenze von 95, Mittelpunkt von :math:`\frac{93+95}{2} = 94`.

source: A binary search requires significantly fewer guesses. Worst case, it can guess a number between 1 and 128 in 7 guesses. One more guess raises the limit to 256. 9 guesses can get a number between 1 and 512. With just 32 guesses, a person can get a number between 1 and 4.2 billion.
de: Eine binäre Suche erfordert deutlich weniger Versuche. Im schlimmsten Fall kann es eine Zahl zwischen 1 und 128 in sieben Schritten erraten. Eine weitere Runde erhöht das Limit auf 256 Zahlen. 9 Runden können eine Zahl zwischen 1 und 512 erhalten. Mit nur 32 Runden kann eine Person eine Zahl zwischen 1 und 4,2 Milliarden erraten.

source: To figure out how large the list can be given a certain number of guesses, the formula works out like :math:`n=x^{g}` where :math:`n` is the size of the list and :math:`g` is the number of guesses. For example:
de: Um herauszufinden, wie groß die Liste mit einer bestimmten Anzahl von Rateversuche sein kann, lautet die Formel wie folgt :math:`n = x^{g}` wobei :math:`n` die Größe der Liste ist und :math:`g` ist die Anzahl der Rateversuche. Zum Beispiel:

source: :math:`2^7=128` (7 guesses can handle 128 different numbers)
de: :math:`2^7 = 128` (7 Rateversuch können 128 verschiedene Zahlen abarbeiten)

source: If you have the problem size, we can figure out the number of guesses using the log function. Specifically, *log base 2*. If you don't specify a base, most people will assume you mean the natural log with a base of :math:`e \approx 2.71828` which is not what we want. For example, using log base 2 to find how many guesses:
de: Wenn wir die Problemgröße haben, können wir die Anzahl der Vermutungen mithilfe der Logarithmusfunktion ermitteln. Insbesondere *Lograithmus zur Basis 2*. Wenn man keine Basis angibt, gehen die meisten Leute davon aus, dass man den natürliche Logarithmus mit folgender Basis meint :math:`e \approx 2,71828`, was nicht das ist, was wir wollen. Verwenden wir beispielsweise die Basis 2, um zu ermitteln, wie viele Rateversuche maximal notwendig sind:

source: Enough math! Where is the code? The code to do a binary search is more complex than a linear search:
de: Genug Mathe! Wo ist der Code? Der Code für eine binäre Suche ist komplexer als eine lineare Suche:

source: Binary search
de: Binäre Suche

source: Since lists start at element zero, line 3 sets the lower bound to zero. Line 4 sets the upper bound to the length of the list minus one. So for a list of 100 elements the lower bound will be 0 and the upper bound 99.
de: Da Listen bei Element Null beginnen, setzt Zeile 3 die Untergrenze auf Null. Zeile 4 setzt die Obergrenze auf die Länge der Liste minus eins. Für eine Liste mit 100 Elementen ist die Untergrenze 0 und die Obergrenze 99.

source: The Boolean variable on line 5 will be used to let the while loop know that the element has been found.
de: Die boolesche Variable in Zeile 5 wird verwendet, um der ``while``-Schleife mitzuteilen, dass das Element gefunden wurde.

source: Line 8 checks to see if the element has been found or if we've run out of elements. If we've run out of elements the lower bound will end up equaling the upper bound.
de: Zeile 8 prüft, ob das Element gefunden wurde oder ob keine Elemente mehr vorhanden sind. Wenn wir keine Elemente mehr haben, entspricht die Untergrenze der Obergrenze.

source: Line 11 finds the middle position. It is possible to get a middle position of something like 64.5. It isn't possible to look up position 64.5. (Although J.K. Rowling was rather clever in enough coming up with Platform :math:`9\frac{3}{4}`, that doesn't work here.) The best way of handling this is to use the ``//`` operator first introduced way back in Chapter 1. This is similar to the ``/`` operator, but will only return integer results. For example, ``11 // 2`` would give 5 as an answer, rather than 5.5.
de: Zeile 11 findet die mittlere Position. Es ist möglich, eine mittlere Position von etwa 64,5 zu erhalten. Es ist nicht möglich, Position 64,5 nachzuschlagen. (Obwohl JK Rowling so clever war, die Platform :math:`9 \frac{3}{4}` zu finden, funktioniert das hier nicht.) Der beste Weg, dies zu handhaben, ist, den ``//``-Operator zu verwenden. Der Operator wurde zum ersten Mal in Kapitel 1 eingeführt. Er ähnelt dem Operator ``/``, gibt jedoch nur ganzzahlige Ergebnisse zurück. Zum Beispiel würde ``11 // 2`` 5 anstelle von 5,5 als Antwort geben.

source: Starting at line 17, the program checks to see if the guess is high, low, or correct. If the guess is low, the lower bound is moved up to just past the guess. If the guess is too high, the upper bound is moved just below the guess. If the answer has been found, ``found`` is set to ``True`` ending the search.
de: Ab Zeile 17 prüft das Programm, ob die Vermutung zu hoch, zu niedrig oder richtig ist. Wenn die Vermutung zu niedrig ist, wird die untere Grenze nach oben verschoben, bis sie knapp hinter der Vermutung liegt. Wenn die Schätzung zu hoch ist, wird die Obergrenze direkt unter die Schätzung verschoben. Wenn die Antwort gefunden wurde, wird ``found`` auf ``True`` gesetzt, um die Suche zu beenden.

source: With the a list of 100 elements, a person can reasonably guess that on average with the linear search, a program will have to check 50 of them before finding the element. With the binary search, on average you'll still need to do about seven guesses. In an advanced algorithms course you can find the exact formula. For this course, just assume average and worst cases are the same.
de: Bei einer Liste von 100 Elementen kann man vernünftigerweise annehmen, dass ein Programm bei der linearen Suche im Durchschnitt 50 Elemente prüfen muss, bevor es das Element findet. Bei der binären Suche müssen Sie im Durchschnitt noch ungefähr sieben Vermutungen anstellen. In einem Kurs für fortgeschrittene Algorithmen findest du die genaue Formel. Nimm für diesen Kurs einfach an, dass Durchschnitt und schlechtester Fall gleich sind.
