Repository: Anitha489/arcade_book
Catalog: locale/*/LC_MESSAGES/chapters/24_searching/searching.po
Languages: de

source: Searching
de: Suchen

source: Searching is an important and very common operation that computers do all the time. Searches are used every time someone does a ctrl-f for "find", when a user uses "type-to" to quickly select an item, or when a web server pulls information about a customer to present a customized web page with the customer's order.
de: Das Suchen ist eine wichtige und sehr häufige Aufgabe, die Rechner ständig ausführen. Suchanfragen werden jedes Mal verwendet, wenn jemand eine Strg-F-Taste für "Suchen" drückt, wenn ein Benutzer ein Element mit Autovervollständigung schnell auswählt oder wenn ein Webserver Informationen über einen Kunden abruft, um eine angepasste Webseite mit dem Kundenauftrag zu präsentieren.

source: There are a lot of ways to search for data. Google has based an entire multi-billion dollar company on this fact. This chapter introduces the two simplest methods for searching, the linear search and the binary search.
de: Es gibt viele Möglichkeiten, nach Daten zu suchen. Google hat eine ganze Multi-Milliarden-Dollar-Firma auf diese Tatsache gegründet. In diesem Kapitel werden die zwei einfachsten Suchmethoden vorgestellt, die lineare Suche und die binäre Suche.

source: Reading From a File
de: Aus einer Datei lesen

source: Before discussing how to search we need to learn how to read data from a file. Reading in a data set from a file is way more fun than typing it in by hand each time.
de: Bevor wir uns mit der Suche befassen, müssen wir lernen, wie Daten aus einer Datei gelesen werden. Das Einlesen eines Datensatzes aus einer Datei macht wesentlich mehr Spaß, als ihn jedes Mal von Hand einzugeben.

source: Let's say we need to create a program that will allow us to quickly find the name of a super-villain. To start with, our program needs a database of super-villains. To download this data set, download and save this file:
de: Angenommen, wir müssen ein Programm erstellen, mit dem wir schnell den Namen eines Superschurken finden können. Zu Beginn benötigt unser Programm eine Datenbank mit Superschurken. Um diesen Datensatz herunterzuladen, lade diese Datei herunter und speichere sie:

source: These are random names generated by the `nine.frenchboys.net`_ website, although last I checked they no longer have a super-villain generator. They have other cool random name generators though.
de: Dies sind zufällige Namen, die von der `nine.frenchboys.net`_-Website generiert wurden. (Obwohl den Superschurken-Generator beim letzten Mal, wo ich nachgesehen habe, nicht mehr gab). Sie haben aber auch andere coole Zufallsgeneratoren.

source: Save this file and remember which directory you saved it to.
de: Speichere diese Datei und merke dir, in welchem ​​Verzeichnis du sie gespeichert hast.

source: In the same directory as ``super_villains.txt``, create, save, and run the following Python program:
de: Erstelle im selben Verzeichnis wie "super_villains.txt" folgendes Python-Programm, speichere es und führe es aus:

source: Read in a file
de: Datei einlesen

source: There is only one new command in this code: ``open``. Because it is a built-in function like ``print``, there is no need for an ``import``. Full details on this function can be found in the `Python documentation`_ but at this point the documentation for that command is so technical it might not even be worth looking at.
de: In diesem Code gibt es nur eine neue Anweisung: ``open``. Da es sich um eine integrierte Funktion wie ``print`` handelt, ist kein ``import`` erforderlich. Ausführliche Informationen zu dieser Funktion findest du in der `Python-Dokumentation`_, die Dokumentation für diese Anweisung ist jedoch zu diesem Zeitpunkt so technisch, dass sie möglicherweise nicht einmal einen Blick wert ist.

source: The above program has two problems with it, but it provides a simple example of reading in a file. Line 6 opens a file and gets it ready to be read. The name of the file is in between the quotes. The new variable ``my_file`` is an object that represents the file being read. Line 9 shows how a normal ``for`` loop may be used to read through a file line by line. Think of the file as a list of lines, and the new variable line will be set to each of those lines as the program runs through the loop.
de: Das obige Programm weist zwei Probleme auf, bietet jedoch ein einfaches Beispiel für das Einlesen einer Datei. Zeile 6 öffnet eine Datei und macht sie zum Lesen bereit. Der Name der Datei steht zwischen den Anführungszeichen. Die neue Variable ``my_file`` ist ein Objekt, das die gelesene Datei darstellt. Zeile 9 zeigt, wie eine normale ``for``-Schleife verwendet werden kann, um eine Datei zeilenweise durchzulesen. Stelle dir die Datei als eine Liste von Zeilen vor, und die neue Variable ``line`` wird auf jede dieser Zeilen gesetzt, wenn das Programm die Schleife durchläuft.

source: Try running the program. One of the problems with the it is that the text is printed double-spaced. The reason for this is that each line pulled out of the file and stored in the variable line includes the carriage return as part of the string. Remember the carriage return and line feed introduced back in Chapter 1? The ``print`` statement adds yet another carriage return and the result is double-spaced output.
de: Führe das Programm aus. Eines der Probleme dabei ist, dass der Text mit einer zusätzlichen Leerzeile ausgegeben wird. Der Grund dafür ist, dass jede Zeile, die aus der Datei geholt und in der Variablen ``line`` gespeichert wird, das Zeilenende als Teil der Zeichenfolge enthält. Erinnere dich an den Wagenrücklauf und den Zeilenvorschub, die in Kapitel 1 eingeführt wurden? Die ``print``-Anweisung fügt einen weiteres Zeilenende hinzu und das Ergebnis ist eine Ausgabe mit einer zusätzlichen Leerzeile.

source: The second problem is that the file is opened, but not closed. This problem isn't as obvious as the double-spacing issue, but it is important. The Windows operating system can only open so many files at once. A file can normally only be opened by one program at a time. Leaving a file open will limit what other programs can do with the file and take up system resources. It is necessary to close the file to let Windows know the program is no longer working with that file. In this case it is not too important because once any program is done running, the Windows will automatically close any files left open. But since it is a bad habit to program like that, let's update the code:
de: Das zweite Problem ist, dass die Datei geöffnet, aber nicht geschlossen wird. Dieses Problem ist nicht so offensichtlich wie das Problem der zusätzlichen Leerzeile, aber es ist wichtig. Das Windows-Betriebssystem kann nur eine bestimmte Anzahl von Dateien gleichzeitig öffnen. Eine Datei kann normalerweise nur von einem Programm gleichzeitig geöffnet werden. Wenn Sie eine Datei geöffnet lassen, können andere Programme nur eingeschränkt mit der Datei arbeiten und Systemressourcen belegen. Es ist notwendig, die Datei zu schließen, um Windows mitzuteilen, dass das Programm nicht mehr mit dieser Datei arbeitet. In diesem Fall ist dies nicht allzu wichtig, da Windows nach dem Ausführen eines Programms alle noch geöffneten Dateien automatisch schließt. Aber da es eine schlechte Angewohnheit ist, so zu programmieren, aktualisieren wir den Code:

source: The listing above works better. It has two new additions. On line 4 is a call to the ``strip`` method built into every ``String`` class. This function returns a new string without the trailing spaces and carriage returns of the original string. The method does not alter the original string but instead creates a new one. This line of code would not work:
de: Das obige Programm funktioniert besser. Es hat zwei neue Ergänzungen. In Zeile 4 steht ein Aufruf der Methode ``strip``, die in jede Klasse ``String`` eingebaut ist. Diese Funktion gibt eine neue Zeichenfolge ohne die nachfolgenden Leerzeichen und Zeilenende-Zeichen der ursprünglichen Zeichenfolge zurück. Die Methode ändert die ursprüngliche Zeichenfolge nicht, sondern erstellt eine neue. Diese Codezeile würde nicht funktionieren:

source: If the programmer wants the original variable to reference the new string, she must assign it to the new returned string as shown on line 4.
de: Wenn der Programmierer möchte, dass die ursprüngliche Variable auf die neue Zeichenfolge verweist, muss er sie der neuen zurückgegebenen Zeichenfolge wie in Zeile 4 gezeigt zuweisen.

source: The second addition is on line 7. This closes the file so that the operating system doesn't have to go around later and clean up open files after the program ends.
de: Der zweite Erweiterung befindet sich in Zeile 7. Dadurch wird die Datei geschlossen, sodass das Betriebssystem nach dem Beenden des Programms nicht mehr nachschauen und geöffnete Dateien aufräumen muss.

source: Reading Into an Array
de: Einlesen in ein Array

source: It is useful to read in the contents of a file to an array so that the program can do processing on it later. This can easily be done in python with the following code:
de: Es ist nützlich, den Inhalt einer Datei in ein Array einzulesen, damit das Programm sie später verarbeiten kann. Dies kann einfach in Python mit dem folgenden Code durchgeführt werden:

source: Read in a file from disk and put it in an array
de: Liest eine Datei von der Festplatte ein und legt sie in einem Array ab

source: This combines the new pattern of how to read a file, along with the previously learned pattern of how to create an empty array and append to it as new data comes in, which was shown back in :ref:`append_to_list`. To verify the file was read into the array correctly a programmer could print the length of the array:
de: Dies kombiniert das neue Muster zum Lesen einer Datei mit dem zuvor erlernten Muster zum Erstellen eines leeren Arrays und zum Anhängen, wenn neue Daten eingehen. Dies wurde unter :ref:`append_to_list` gezeigt. Um zu überprüfen, ob die Datei korrekt in das Array eingelesen wurde, kann ein Programmierer die Länge des Arrays ausgeben:

source: Or the programmer could print the entire contents of the array:
de: Oder der Programmierer kann den gesamten Inhalt des Arrays ausgeben:

source: Go ahead and make sure you can read in the file before continuing on to the different searches.
de: Stelle sicher, dass du die Datei lesen kannst, bevor du mit den verschiedenen Suchvorgängen fortfahren.

source: Linear Search
de: Lineare Suche

source: If a program has a set of data in an array, how can it go about finding where a specific element is? This can be done one of two ways. The first method is to use a *linear search*. This starts at the first element, and keeps comparing elements until it finds the desired element (or runs out of elements.)
de: Wenn ein Programm eine Menge von Daten in einem Array enthält, wie kann es dann herausfinden, wo sich ein bestimmtes Element befindet? Dies kann auf zwei Arten erfolgen. Die erste Methode ist die Verwendung einer *linearen Suche*. Dies beginnt beim ersten Element und führt den Vergleich der Elemente fort, bis das gewünschte Element gefunden wurde (oder keine Elemente mehr vorhanden sind).

source: Linear Search Algorithm
de: Linearer Suchalgorithmus

source: Linear search
de: Lineare Suche

source: The linear search is rather simple. Line 5 sets up an increment variable that will keep track of exactly where in the list the program needs to check next. The first element that needs to be checked is zero, so ``current_list_position`` is set to zero.
de: Die lineare Suche ist ziemlich einfach. Zeile 5 erstellt eine Inkrementvariable, die genau festhält, wo in der Liste das Programm als nächstes nachsehen muss. Das erste Element, das überprüft werden muss, steht an der Position Null, also wird ``current_list_position`` auf Null gesetzt.

source: The next line is a bit more complex. The computer needs to keep looping until one of two things happens. It finds the element, or it runs out of elements. The first comparison sees if the current element we are checking is less than the length of the list. If so, we can keep looping. The second comparison sees if the current element in the name list is equal to the name we are searching for.
de: Die nächste Zeile ist etwas komplexer. Der Rechner muss so lange eine Schleife ausführen, bis eine der beiden Situationen eintritt: Es findet das Element oder es gehen ihm die Elemente aus. Beim ersten Vergleich wird festgestellt, ob das aktuelle Position, die wir überprüfen, vor dem Ende der Liste liegt. In diesem Fall können wir die Schleife fortsetzen. Beim zweiten Vergleich wird festgestellt, ob das aktuelle Element in der Namensliste dem gesuchten Namen entspricht.

source: This check to see if the program has run out of elements *must occur first*. Otherwise the program will check against a non-existent element which will cause an error.
de: Diese Prüfung, um festzustellen, ob das Programm keine Elemente mehr hat, muss zuerst erfolgen. Andernfalls prüft das Programm auf ein nicht vorhandenes Element, was einen Fehler verursacht.

source: Line 12 simply moves to the next element if the conditions to keep searching are met in line 9.
de: Zeile 12 wechselt einfach zum nächsten Element, wenn die Bedingungen für die weitere Suche in Zeile 9 erfüllt sind.

source: At the end of the loop, the program checks to see if the end of the list was reached on line 14. Remember, a list of n elements is numbered 0 to n-1. Therefore if i is equal to the length of the list, the end has been reached. If it is less, we found the element.
de: Am Ende der Schleife prüft das Programm, ob das Ende der Liste in Zeile 14 erreicht wurde. Denke daran, dass eine Liste mit n Elementen von 0 bis n-1 nummeriert ist. Wenn also i gleich der Länge der Liste ist, ist das Ende erreicht. Wenn es weniger ist, haben wir das Element gefunden.

source: The full example with both the reading in the file and the search is below:
de: Das vollständige Beispiel mit dem Einlesen der Datei und der Suche findest du unten:

source: We can improve on this example by moving both the reading of the file and the search into their own functions:
de: Wir können dieses Beispiel verbessern, indem wir sowohl das Lesen der Datei als auch die Suche in ihre eigenen Funktionen verschieben:

source: Variations On The Linear Search
de: Variationen der linearen Suche

source: Variations on the linear search can be used to create several common algorithms. Specifically, you can use it to see if *any* items in a list match a property, or if *all* items match a property. You can also use it to pull all matching items out of a list.
de: Variationen der linearen Suche können verwendet werden, um mehrere allgemeine Algorithmen zu erstellen. Insbesondere kann man damit feststellen, ob *alle* Elemente in einer Liste mit einer Eigenschaft übereinstimmen oder ob *alle* Elemente mit einer Eigenschaft übereinstimmen. Man kann sie auch verwenden, um alle übereinstimmenden Elemente aus einer Liste zu entfernen.

source: Does At Least One Item Have a Property?
de: Hat mindestens ein Gegenstand eine Eigenschaft?

source: For example, here is a function that uses the linear search to see if there is an item in ``my_list`` that matches the value in ``key``.
de: Zum Beispiel ist hier eine Funktion, die die lineare Suche verwendet, um zu sehen, ob es ein Element in ``my_list`` gibt, das mit dem Wert in ``key`` übereinstimmt.

source: Using the ``break`` statement, which exits a loop early, we can simplify the code:
de: Mit der ``break``-Anweisung, die eine Schleife vorzeitig beendet, können wir den Code vereinfachen:

source: Do All Items Have a Property?
de: Haben alle Gegenstände eine Eigenschaft?

source: How would you test to see if *all* items in a list match a property? We just need to reverse a few things in the algorithm above.
de: Wie würden man testen, ob *alle* Elemente in einer Liste mit einer Eigenschaft übereinstimmen? Wir müssen nur ein paar Dinge im obigen Algorithmus umkehren.

source: Create a List With All Items Matching a Property
de: Erstellen einer Liste mit allen Elementen, die einer Eigenschaft entsprechen

source: Another common operation is to grab all the items out of a list that match:
de: Eine weitere häufige Operation besteht darin, alle übereinstimmenden Elemente aus einer Liste zu entfernen:

source: Full Example
de: Vollständiges Beispiel

source: For a full example, see below:
de: Ein vollständiges Beispiel findest du unten:

source: Variations On The Linear Search With Objects
de: Variationen der linearen Suche mit Objekten

source: For example, say we had a list of objects for our text adventure. We might want to check that list and see if any of the items are in the same room as our player. Or if all the items are. Or we might want to build a list of items that the user is carrying if they are all in a "special" room that represents the player's inventory.
de: Nehmen wir zum Beispiel an, wir hätten eine Liste von Objekten für unser Text-Adventure. Vielleicht möchten wir diese Liste überprüfen und herausfinden, ob sich Gegenstände im selben Raum wie unsere Spielfigur befinden. Oder ob alle Gegenstände im selben Raum sind. Oder wir möchten eine Liste der Gegenstände erstellen, die die Spielfigur mit sich trägt, wenn sich alle in einem "speziellen" Raum befinden, der das Inventar des Spielers darstellt.

source: To begin with, we'd need to define our adventure object:
de: Zunächst müssen wir unsere Klasse für Objekte im Adventure definieren:

source: Adventure Object class
de: Adventure-Objekt-Klasse

source: Is at least one object in the specified room? We can check.
de: Befindet sich mindestens ein Objekt im angegebenen Raum? Wir können das überprüfen.

source: Check if list has an item that has a property - ``while`` loop
de: Überprüfen, ob die Liste ein Element enthält, das eine Eigenschaft hat - ``while``-Schleife

source: This could also be done with a ``for`` loop. In this case, the loop will exit early by using a ``return`` once the item has been found. The code is shorter, but not every programmer would prefer it. Some programmers feel that loops should not be prematurely ended with a ``return`` or ``break`` statement. It all goes to personal preference, or the personal preference of the person that is footing the bill.
de: Dies könnte auch mit einer ``for`` -Schleife geschehen. In diesem Fall wird die Schleife mit einem ``return`` vorzeitig beendet, sobald der Gegenstand gefunden wurde. Der Programmcode ist kürzer, aber nicht jeder Programmierer würde ihn bevorzugen. Einige Programmierer sind der Meinung, dass Schleifen nicht mit einer ``return``- oder ``break``-Anweisung vorzeitig beendet werden sollten. Alles hängt von den persönlichen Vorlieben oder den persönlichen Vorlieben der Person ab, die die Rechnung bezahlt.

source: Check if list has an item that has a property - ``for`` loop
de: Überprüfen, ob die Liste ein Element enthält, das eine Eigenschaft hat - ``for``-Schleife

source: Are all the adventure objects in the same room? This code is very similar to the prior example. Spot the difference and see if you can figure out the reason behind the change.
de: Befinden sich alle Adventure-Objekte im selben Raum? Dieser Code ist dem vorherigen Beispiel sehr ähnlich. Erkennst du den Unterschied und siehst du den Grund für die Änderung.

source: Check if all items have a property
de: Überprüfen, ob alle Elemente eine Eigenschaft haben

source: What if you wanted a list of objects that are in room 5? This is a combination of our prior code, and the code to append items to a list that we learned about back in :ref:`intro-to-lists`.
de: Was ist, wenn du eine Liste der Objekte in Raum 5 haben möchtest? Dies ist eine Kombination aus unserem vorherigen Code und dem Code zum Anhängen von Elementen an eine Liste, die wir bereits kennengelernt haben (siehe :ref:`Intro-to-Lists`).

source: Create another list with all items matching a property
de: Erstelle eine weitere Liste mit allen Elementen, die einer Eigenschaft entsprechen

source: How would you run all these in a test? The code above can be combined with this code to run:
de: Wie würdest du all dies testen? Der obige Code kann mit dem folgenden Code kombiniert werden:

source: Run Sample Functions
de: Beispielfunktionen ausführen

source: For a full working example:
de: Ein voll funktionsfähiges Beispiel:

source: These common algorithms can be used as part of a solution to a larger problem, such as find all the addresses in a list of customers that aren't valid.
de: Diese Standardalgorithmen können als Teil einer Lösung für ein größeres Problem verwendet werden. Zum Beispiel, um alle Adressen in einer Liste von Kunden zu finden, die ungültig sind.

source: Binary Search
de: Binäre Suche

source: A faster way to search a list is possible with the binary search. The process of a binary search can be described by using the classic number guessing game "guess a number between 1 and 100" as an example. To make it easier to understand the process, let's modify the game to be "guess a number between 1 and 128." The number range is inclusive, meaning both 1 and 128 are possibilities.
de: Mit der binären Suche kann man eine Liste schneller durchsuchen. Der Vorgang einer binären Suche kann am Beispiel des klassischen Spiels "Rate eine Zahl zwischen 1 und 100" beschrieben werden. Um das Verständnis des Vorgangs zu erleichtern, ändern wir das Spiel so, dass "eine Zahl zwischen 1 und 128 erraten wird". Der Nummernbereich ist inklusive, das heißt, sowohl 1 als auch 128 sind möglich.

source: If a person were to use the linear search as a method to guess the secret number, the game would be rather long and boring.
de: Wenn jemand die lineare Suche als Methode zum Erraten der Geheimzahl verwenden würde, wäre das Spiel ziemlich lang und langweilig.

source: Most people will use a binary search to find the number. Here is an example of playing the game using a binary search:
de: Die meisten Leute verwenden die binäre Suche, um die Zahl zu finden. Hier ist ein Beispiel für einen Spielverlauf mit einer binären Suche:

source: Each time through the rounds of the number guessing game, the guesser is able to eliminate one half of the problem space by getting a "high" or "low" as a result of the guess.
de: Jedes Mal, wenn der Spieler eine Runde des Zahlenspiels durchläuft, ist er in der Lage, die Hälfte des Problemraums zu eliminieren, indem er als Ergebnis der Vermutung ein "zu hoch" oder "zu niedrig" erhält.

source: In a binary search, it is necessary to track an upper and a lower bound of the list that the answer can be in. The computer or number-guessing human picks the midpoint of those elements. Revisiting the example:
de: Bei einer binären Suche ist es erforderlich, eine obere und eine untere Grenze der Liste zu verfolgen, in der sich die Antwort befinden kann. Der Rechner oder der Mensch, der eine Zahl errät, wählt den Mittelpunkt dieser Elemente aus. Das überarbeitete Beispiel:

source: A lower bound of 1, upper bound of 128, mid point of :math:`\frac{128+1}{2}=64.5`.
de: Eine Untergrenze von 1, Obergrenze von 128, Mittelpunkt von :math:`\frac{128+1}{2} = 64,5`.

source: A lower bound of 65, upper bound of 128, mid point of :math:`\frac{65+128}{2}=96.5`.
de: Eine Untergrenze von 65, Obergrenze von 128, Mittelpunkt von :math:`\frac{65+128}{2} = 96,5`.

source: A lower bound of 65, upper bound of 95, mid point of :math:`\frac{65+95}{2}=80`.
de: Eine Untergrenze von 65, Obergrenze von 95, Mittelpunkt von :math:`\frac{65+95}{2} = 80`.

source: A lower bound of 81, upper bound of 95, mid point of :math:`\frac{81+95}{2}=88`.
de: Eine Untergrenze von 81, Obergrenze von 95, Mittelpunkt von :math:`\frac{81+95}{2} = 88`.
