Repository: Anitha489/arcade_book
Catalog: locale/*/LC_MESSAGES/labs/lab_08_sprites/sprites.po
Languages: de

source: Lab 8: Sprites
de: Übung 8: Sprites

source: Create a player-character sprite. Feel free to pick your own image for the sprite.
de: Erstelle ein Sprite für die Spielfigur. Wähle dein eigenes Bild für das Sprite.

source: Allow the user to move the player move by the keyboard, mouse, or game pad. Your choice. If you use the mouse, make sure you hide it.
de: Ermögliche dem Benutzer, die Spielfigur mit der Tastatur, der Maus oder dem Gamepad zu bewegen. Es ist deine Entscheidung. Wenn du die Maus verwendest, vergewissere dich, dass du sie ausblendest.

source: Create "good" sprites. Pick your own image for the sprite.
de: Erstelle "gute" Sprites. Wähle dein eigenes Bild für das Sprite.

source: Create "bad" sprites. Pick your own image for the sprite.
de: Erstelle "böse" Sprites. Wählen dein eigenes Bild für das Sprite.

source: For each good sprite collected, make the score go up. Play a 'good' sound when the user collects that item.
de: Erhöhe die Punktzahl für jedes eingesammelte gute Sprite. Spiele einen "guten" Sound ab, wenn der Benutzer diesen Gegenstand sammelt.

source: For each bad sprite touched, have the score go down. Play a 'bad' sound when the user collects that item.
de: Lasse für jedes böse Sprite die Punktzahl sinken. Spiele einen "schlechten" Sound ab, wenn der Benutzer diesen Gegenstand einsammelt.

source: Animate/move the good sprites. Pick any of the motions we showed, or make your one.
de: Animiere/bewege die guten Sprites. Wähle eine der gezeigten Bewegungen aus oder erstelle eine eigene.

source: Move the bad sprites. Move them differently than the good ones.
de: Bewege die bösen Sprites. Bewege sie anders als die Guten.

source: If the length of the good sprite list is zero, then don't move any of the sprites or the character. "Freeze" the game. To do this, note what line of the ``update`` method in the main window class causes the sprites to move. Then only run that line if you have sprites. (Check the length of the sprite list.) If you get that to work, the do something similar ``on_mouse_motion``.
de: Wenn die Länge der Liste der guten Sprites Null ist, verschiebe die Sprites oder die Spielfigur nicht mehr. "Friere" das Spiel ein. Beachte dazu, in welcher Zeile der Methode ``update`` in der Hauptfensterklasse die Sprites verschoben werden. Führe diese Zeile dann nur aus, wenn du gute Sprites hast. (Überprüfe die Länge der Sprite-Liste.) Wenn du das zum Laufen gebracht hast, tue etwas Ähnliches in ``on_mouse_motion``.

source: If the length of the good sprite list is zero, draw "Game Over" on the screen.
de: Wenn die Länge der guten Sprite-Liste Null ist, zeichne "Game Over" auf dem Bildschirm.

source: Add, commit, and push via ``git``.
de: Add, commit und push mit ``git``.

source: Turn in a URL to your project.
de: Gib eine URL für dein Projekt ab.
