Repository: Anitha489/arcade_book
Catalog: locale/*/LC_MESSAGES/chapters/28_exceptions/exceptions.po
Languages: de

source: Exceptions
de: Ausnahmen

source: When something goes wrong with your program, do you want to keep the user from seeing a red Python error message? Do you want to keep your program from hanging? If so, then you need *exceptions*.
de: Möchtest du verhindern, dass dem Benutzer eine rote Python-Fehlermeldung angezeigt wird, wenn ein Problem mit deinem Programm auftritt? Möchtest du verhindern, dass dein Programm hängt? Wenn ja, dann brauchst du *Ausnahmen* (englisch *exceptions*).

source: Exceptions are used to handle abnormal conditions that can occur during the execution of code. Exceptions are often used with file and network operations. This allows code to gracefully handle running out of disk space, network errors, or permission errors.
de: Ausnahmen werden verwendet, um abnormale Bedingungen zu behandeln, die während der Ausführung von Programmcode auftreten können. Ausnahmen werden häufig bei Datei- und Netzwerkoperationen verwendet. Auf diese Weise kann das Programm ordnungsgemäß mit Speicherplatzmangel, Netzwerkfehlern oder Berechtigungsfehlern umgehen.

source: Vocabulary
de: Wortschatz

source: There are several terms and phrases used while working with exceptions. Here are the most common:
de: Beim Arbeiten mit Ausnahmen werden mehrere Begriffe und Phrasen verwendet. Hier sind die häufigsten:

source: **Exception**: This term could mean one of two things. First, the condition that results in abnormal program flow. Or it could be used to refer to an object that represents the data condition. Each exception has an object that holds information about it.
de: **Ausnahme**: Dieser Begriff kann eines von zwei Dingen bedeuten. Erstens die Bedingung, die zu einem abnormalen Programmfluss führt. Oder er könnte verwendet werden, um auf ein Objekt zu verweisen, das die Daten der Ausnahmebedingung darstellt. Jede Ausnahme hat ein Objekt, das Informationen darüber enthält.

source: **Exception handling**: The process of handling an exception to normal program flow.
de: **Ausnahmebehandlung**: Der Prozess der Behandlung einer Ausnahme vom normalen Programmablauf.

source: **Catch block or exception block**: Code that handles an abnormal condition is said to "catch" the exception.
de: **Catch-Block oder Exception-Block**: Code, der einen abnormalen Zustand behandelt, soll die Ausnahme "abfangen".

source: **Throw or raise**: When an abnormal condition to the program flow has been detected, an instance of an exception object is created. It is then "thrown" or "raised" to code that will catch it.
de: **Auslösen oder Werfen**: Wenn eine abnormale Bedingung für den Programmablauf erkannt wurde, wird ein Exemplar eines Ausnahmeobjekts erstellt. Es wird dann "geworfen" oder "ausgelöst" zum Code, der es abfängt.

source: **Unhandled exception or Uncaught exception**: An exception that is thrown, but never caught. This usually results in an error and the program ending or crashing.
de: **Unbehandelte Ausnahme oder nicht erfasste Ausnahme**: Eine Ausnahme, die ausgelöst, aber nie abgefangen wird. Dies führt normalerweise zu einem Fehler und zum Beenden oder Abstürzen des Programms.

source: **Try block**: A set of code that might have an exception thrown in it.
de: **Try Block**: Ein Codeblock, in dem möglicherweise eine Ausnahme ausgelöst wird.

source: Most programming languages use the terms "throw" and "catch." Unfortunately Python doesn't. Python uses "raise" and "exception." We introduce the throw/catch vocabulary here because they are the most prevalent terms in the industry.
de: Die meisten Programmiersprachen verwenden die Begriffe "throw" und "catch". Python tut dies leider nicht. Python verwendet "raise" und "exception". Wir stellen hier das Wurf-/Fangvokabular vor, da es die in der Branche am häufigsten verwendeten Begriffe sind.

source: Exception Handling
de: Ausnahmebehandlung

source: The code for handling exceptions is simple. See the example below:
de: Der Code für die Behandlung von Ausnahmen ist einfach. Siehe folgendes Beispiel:

source: Handling division by zero
de: Division durch Null abhandeln

source: On line two is the ``try`` statement. Every indented line below it is part of the "try block." There may be no unindented code below the ``try`` block that doesn't start with an ``except`` statement. The ``try`` statement defines a section of code that the code will attempt to execute.
de: In Zeile zwei steht die Anweisung ``try``. Jede eingerückte Zeile darunter ist Teil des "try-Blocks". Unter dem ``try`` -Block muss eingerückter Code stehen. Erst der Teil, der mit einer ``except``-Anweisung beginnt, ist nicht mehr eingerückt. Die ``try``-Anweisung definiert einen Codeabschnitt, den der Code auszuführen versucht.

source: If there is any exception that occurs during the processing of the code the execution will immediately jump to the "catch block." That block of code is indented under the ``except`` statement on line 4. This code is responsible for handling the error.
de: Wenn während der Verarbeitung des Codes eine Ausnahme auftritt, springt die Ausführung sofort zum "catch-Block". Dieser Codeblock wird unter der Anweisung ``except`` in Zeile 4 eingerückt. Dieser Code ist für die Behandlung des Fehlers verantwortlich.

source: A program may use exceptions to catch errors that occur during a conversion from text to a number. For example:
de: Ein Programm kann Ausnahmen verwenden, um Fehler abzufangen, die bei der Konvertierung von Text in eine Zahl auftreten. Zum Beispiel:

source: Handling number conversion errors
de: Umgang mit Fehlern bei der Konvertierung von Text in Zahlen

source: An exception will be thrown on line 3 because "fred" can not be converted to an integer. The code on line 5 will print out an error message.
de: In Zeile 3 wird eine Ausnahme ausgelöst, da "fred" nicht in eine Ganzzahl konvertiert werden kann. Der Code in Zeile 5 gibt eine Fehlermeldung aus.

source: Below is an expanded version on this example. It error-checks a user's input to make sure an integer is entered. If the user doesn't enter an integer, the program will keep asking for one. The code uses exception handling to capture a possible conversion error that can occur on line 5. If the user enters something other than an integer, an exception is thrown when the conversion to a number occurs on line 5. The code on line 6 that sets ``number_entered`` to ``True`` will not be run if there is an exception on line 5.
de: Unten findest du eine erweiterte Version dieses Beispiels. Es überprüft die Eingaben eines Benutzers auf Fehler, um sicherzustellen, dass eine Ganzzahl eingegeben wurde. Wenn der Benutzer keine Ganzzahl eingibt, fragt das Programm weiterhin nach einer Ganzzahl. Der Code verwendet die Ausnahmebehandlung, um einen möglichen Konvertierungsfehler zu erfassen, der in Zeile 5 auftreten kann. Wenn der Benutzer etwas anderes als eine Ganzzahl eingibt, wird eine Ausnahme ausgelöst, wenn die Konvertierung in eine Zahl in Zeile 5 erfolgt. Der Code in Zeile 6, der ``number_entered`` auf ``True`` setzt, wird nicht ausgeführt, wenn in Zeile 5 eine Ausnahme vorliegt.

source: Better handling of number conversion errors
de: Besserer Umgang mit Fehlern bei der Umwandlung von Zahlen

source: Files are particularly prone to errors during operations with them. A disk could fill up, a user could delete a file while it is being written, it could be moved, or a USB drive could be pulled out mid-operation. These types of errors may also be easily captured by using exception handling.
de: Dateioperationen sind besonders fehleranfällig: Eine Festplatte könnte voll sein, ein Benutzer könnte eine Datei löschen, während sie geschrieben wird, sie könnte verschoben werden oder ein USB-Laufwerk könnte während des Betriebs herausgezogen werden. Diese Arten von Fehlern können ebenfalls mithilfe der Ausnahmebehandlung leicht erfasst werden.

source: Checking for an error when opening a file
de: Überprüfung auf Fehler beim Öffnen einer Datei

source: Multiple types of errors may be captured and processed differently. It can be useful to provide a more exact error message to the user than a simple "an error has occurred."
de: Mehrere Fehlertypen können erkannt und unterschiedlich verarbeitet werden. Es kann sinnvoll sein, dem Benutzer eine genauere Fehlermeldung zukommen zu lassen, als lediglich "ein Fehler ist aufgetreten".

source: In the code below, different types of errors can occur from lines 3-6. By placing ``IOError`` after ``except`` on line 7, only errors regarding Input and Output (IO) will be handled by that code. Likewise line 9 only handles errors around converting values, and line 11 covers division by zero errors. The last exception handling occurs on line 13. Since line 13 does not include a particular type of error, it will handle any error not covered by the ``except`` blocks above. The "catch-all" ``except`` must always be last.
de: Im folgenden Programmcode können verschiedene Arten von Fehlern in den Zeilen 3-6 auftreten. Wenn du ``IOError`` nach ``except`` in Zeile 7 schreibst, werden nur Fehler in Bezug auf Eingabe und Ausgabe (IO) von diesem Code behandelt. Ebenso behandelt Zeile 9 nur Fehler bei der Konvertierung von Werten und Zeile 11 die Division durch Null. Die letzte Ausnahmebehandlung findet in Zeile 13 statt. Da Zeile 13 keinen bestimmten Fehlertyp enthält, behandelt sie alle Fehler, die nicht durch die obigen ``except``-Blöcke abgedeckt sind. Das "catch all" ``except`` muss immer das letzte sein.

source: Handling different types of errors
de: Umgang mit verschiedenen Arten von Fehlern

source: A list of built-in exceptions is available from this web address:
de: Eine Liste der in Python integrierten Ausnahmen finden Sie unter folgender Adresse:

source: Example: Saving High Score
de: Beispiel: Highscore speichern

source: This shows how to save a high score between games. The score is stored in a file called ``high_score.txt``.
de: Das folgende Programm zeigt, wie du zwischen den Spielen einen Highscore speichern kannst. Der Spielstand wird in einer Datei mit dem Namen ``high_score.txt`` gespeichert.

source: Exception Objects
de: Ausnahmeobjekte

source: More information about an error can be pulled from the *exception object*. This object can be retrieved while catching an error using the ``as`` keyword. For example:
de: Weitere Informationen zu einem Fehler können aus dem *Ausnahmenobjekt* abgerufen werden. Dieses Objekt bekommt man, wenn ein Fehler mit dem Schlüsselwort ``as`` abgefangen wird. Zum Beispiel:

source: Creating an exception
de: Ausnahme erstellen

source: The ``e`` variable points to more information about the exception that can be printed out. More can be done with exceptions objects, but unfortunately that is beyond the scope of this chapter. Check the Python documentation on-line for more information about the exception object.
de: Die Variable ``e`` zeigt auf die weitere Information zu der Ausnahme, die ausgegeben werden kann. Mit Ausnahmeobjekten kann noch mehr getan werden, was jedoch den Rahmen dieses Kapitels sprengt. Weitere Informationen zum Ausnahmeobjekt findest du in der Python-Dokumentation online.

source: Exception Generating
de: Ausnahmen generieren

source: Exceptions may be generated with the ``raise`` command. For example:
de: Ausnahmen können mit dem Befehl ``raise`` erzeugt werden. Zum Beispiel:

source: Try taking the code above, and add exception handling for the ``IOError`` raised.
de: Nimm den obigen Code und füge eine Ausnahmebehandlung für den ausgelösten ``IOError`` hinzu.

source: It is also possible to create custom exceptions, but that is also beyond the scope of this book. Curious readers may learn more by going to:
de: Es ist auch möglich, benutzerdefinierte Ausnahmen zu erstellen, dies würde jedoch den Rahmen dieses Buches sprengen. Neugierige Leser erfahren mehr unter:

source: Proper Exception Use
de: Korrekte Verwendung von Ausnahmen

source: Exceptions should not be used when ``if`` statements can just as easily handle the condition. Normal code should not raise exceptions when running the "happy path" scenario. Well-constructed try/catch code is easy to follow but code involving many exceptions and jumps in code to different handlers can be a nightmare to debug. (Once I was assigned the task of debugging code that read an XML document. It generated dozens of exceptions for each line of the file it read. It was incredibly slow and error-prone. That code should have never generated a single exception in the normal course of reading a file.)
de: Ausnahmen sollten nicht verwendet werden, wenn ``if``-Anweisungen die Bedingung genauso gut verarbeiten können. Normaler Code sollte beim Ausführen des Szenarios "Happy Path" keine Ausnahmen auslösen. Gut konstruierter Try/Catch-Code ist einfach nachzuverfolgen, aber Code mit vielen Ausnahmen und Code-Sprüngen zu verschiedenen Handlern kann ein Albtraum für das Debuggen sein. (Mir wurde einmal die Aufgabe zugewiesen, den Code zum Lesen eines XML-Dokuments zu debuggen. Es wurden Dutzende von Ausnahmen für jede Zeile der gelesenen Datei generiert. Es war unglaublich langsam und fehleranfällig. Dieser Code hätte niemals eine einzige Ausnahme beim normalen Lesen einer Datei generieren dürfen.)
