Repository: Anitha489/arcade_book
Catalog: locale/*/LC_MESSAGES/chapters/04_version_control/index.po
Languages: de

source: Version Control Systems
de: Versionskontrollsysteme

source: We will use a `version control system` to track your work, and allow the instructor to give feedback. Odds are, this will be the same exact system you'd use in a large company.
de: Wir werden ein `Versionskontrollsystem` verwenden, um deine Arbeit nachzuverfolgen und dem Übungsleiter die Möglichkeit für Feedback zu geben. Die Chancen stehen gut, dass es das gleiche System ist, dass du in einer großen Firma verwenden wirst.

source: Quick Reference
de: Kurzübersicht

source: Commit and Upload
de: Commit und Upload

source: Do this whenever you are done with a session of programming:
de: Führe die folgenden Schritte immer aus, wenn du mit einer Programmiersitzung fertig bist:

source: Open "git bash" on Windows, or "terminal" on MacOS.
de: Öffne "git bash" unter Windows oder "Terminal" unter MacOS.

source: Type ``cd mydirectoryname`` where the name of the directory will be the same as the name of your repository on BitBucket. You can usually type in the first few letters and hit <tab> to fill in the rest of the directory name.
de: Gebe ``cd mydirectoryname`` ein, wobei der Verzeichnisname (mydirectoryname), der gleiche wie der Name des Repositories auf BitBucket ist. Üblicherweise reicht es ein paar Anfangsbuchstaben einzugeben und dann <tab> zu drücken, um den Rest automatisch zu ergänzen.

source: Type ``git add *``
de: Gib ``git add *`` ein

source: Type ``git commit -m "Work on lab 1"`` Update the comment between the quotes to whatever you did.
de: Gib ``git commit -m "Work on lab 1"`` ein. Ersetze dabei den Kommentar zwischen den Anführungszeichen mit dem was du geändert hast.

source: Type ``git push``
de: Gib ``git push`` ein

source: If you get an error while pushing, see :ref:`cant-push`
de: Wenn du beim letzten Schritt einen Fehler bekommst, dann siehe im Abschnitt :ref:`cant-push` nach

source: Turn In Your Work
de: Abgeben deiner Arbeit

source: Go to BitBucket
de: Gehe auf BitBucket

source: Click on "Source"
de: Klicke auf "Source".

source: Find the folder with your lab
de: Suche den Ordner mit deiner Übung

source: Copy link
de: Kopiere den Link

source: Go to Scholar for the lab
de: Gehe zu Scholar für die Übung

source: Paste link, and turn in.
de: Füge den Link ein und gib die Übung ab.

source: For more commands, see the :ref:`git_command_reference`.
de: Mehr Kommandos findest du im Abschnitt :ref:`git_command_reference`.

source: What is a Distributed Version Control System
de: Was ist ein verteiltes Versionskontrolsystem?

source: No serious development should be done without version control. In fact, version control is so important, many developers would argue that almost no development should be done without version control. Even all my notes for class I keep in version control.
de: Keine ernsthafte Entwicklung sollte ohne Versionskontrollsystem ausgeführt werden. Tatsächlich ist die Versionskontrolle so wichtig, dass viele Entwickler behaupten, dass keine Entwicklung ohne Versionsverwaltung durchgeführt werden sollte. Ich bewahre selbst alle meine Notizen für den Kurs in einer Versionsverwaltung auf.

source: Version control allows developers to:
de: Versionsverwaltung erlaubt den Entwicklern:

source: Get any prior version of a project.
de: Eine frühere Version des Projekts wieder herzustellen.

source: Released version 1.5 of your program, and now it is crashing? Quick! Go back to version 1.4.
de: Du hast die Version 1.5 deines Programms veröffentlicht und jetzt stürzt es ab? Kehre schnell zur Version 1.4 zurück!

source: Did the 'new guy' mess up the project? Revert back!
de: Hat der neue Kollege das Projekt versaut? Mache es rückgängig!

source: Know exactly what changed in the code, when, and by who. See who is actually doing the work. If a mistake gets added in, see when it was added and by whom.
de: Finde heraus, was wann und von wem im Code verändert wurde. Sehe nach, wer tatsächlich die Arbeit macht. Wenn ein Fehler eingefügt wurde, schau nach wann und von wem er eingebaut wurde.

source: Easily share code between developers.
de: Teile einfach Code zwischen Entwicklern.

source: Easily work independently of other developers.
de: Arbeite leicht unabhängig von anderen Entwicklern.

source: Recover an accidentally deleted or overwritten file.
de: Stelle eine versehentlich gelöschte oder überschriebene Datei wieder her.

source: Go back and create a bug-fix release on prior versions of a program.
de: Gehe zurück und erzeuge eine Programmversion zur Beseitigung eines Fehlers.

source: Work on multiple computers and keep files in sync.
de: Arbeite an mehreren Rechnern und halte die Dateien synchron.

source: Version control saves untold time and headaches. It used to be that version control had enough of a learning curve that some developers refused to use it. Thankfully today's version control tools are so easy to use there's no excuse not to.
de: Versionsverwaltung spart eine unermessliche Menge Zeit und Kopfschmerzen. In der Vergangenheit war die Versionsverwaltung schwer zu erlernen, so dass einige Entwickler sich weigerten sie zu benutzen. Glücklicherweise sind aktuelle Versionsverwaltungswerkzeuge einfach zu benutzen. Es gibt also keinen Grund sie nicht zu nutzen.

source: There are two main types of version control. The original version control systems were "centralized." Subversion_ (SVN) is a very popular piece of software that supports this type of version control. The other type is a "Distributed Version Control Systems" (DVCS). There are two popular versions of DVCS in use today, Git_ and Mercurial_. Mercurial is sometimes also known as Hg. Get it? Hg is the symbol for Mercury. Either Git or Hg works fine, but for this tutorial we will standardize on Git.
de: Es gibt zwei Haupttypen von Versionsverwaltung. Die ursprünglichen Versionskontrollsysteme waren "zentralisiert". Subversion_ (SVN) ist ein sehr beliebtes Stück Software, dass diesen Typ Versionsverwaltung unterstützt. Der andere Typ ist ein "verteiltes Versionskontrollsystem" (DVCS). Es gibt heutzutage zwei beliebte DVCS, Git_ und Mercurial_. Mercurial ist auch als Hg bekannt. Verstanden? Hg ist das chemische Symbol für Quecksilber (englisch Mercury). Sowohl Git als auch Hg funktionieren prima, aber in diesem Tutorial werden wir nur Git verwenden.

source: Installing Git
de: Installation von Git

source: Let's install ``git`` on your computer. If you are using a school computer with ``git`` pre-installed, you can skip this step.
de: Lass uns ``git`` auf deinem Rechner installieren. Wenn du einen Schulrechner mit ``git`` vorinstalliert verwendest, kannst du diesen Schritt überspringen.

source: Click the link below and download and install the 64-bit version of the ``git``.
de: Klicke auf den Link unten und lade die 64-Bit-Version von ``git``.

source: Forking the Repository
de: Forke das Repository

source: You should only have to fork the code **once** during class. If you do it more than once, something is wrong. Stop before you do this and see the instructor. It is a big headache for everyone if you fork more than once.
de: Du solltest nur **einmal** den Programmcode im Kurs forken müssen. Wenn du es mehr als einmal machst, ist irgendetwas falsch. Breche ab, bevor du ein zweites Mal forkst und frage den Übungsleiter. Es bereitet allen eine Menge Kopfzerbrechen, wenn du mehr als einmal forkst.

source: We are going to store our programs on-line with a website called BitBucket. BitBucket and a program called SourceTree are owned by a company called Atlassian. They offer enhanced accounts for e-mail addresses ending in ``.edu``. To use BitBucket, create an account https://bitbucket.org/account/signup/
de: Wir werden unsere Programme online auf der Webseite BitBucket speichern. BitBucket und das Programm SourceTree gehören dem Unternehmen Atlassian. Sie bieten erweiterte Accounts für E-Mail-Adressen an, die auf ``.edu`` enden. Lege einen Account auf https://bitbucket.org/account/signup/ an, um BitBucket zu verwenden.

source: Go to this web address which has a template for the labs we'll create in class: https://bitbucket.org/pcraven/arcade-games-work
de: Gehe auf die Webadresse, die eine Vorlage für die Übungen in diesem hat: https://bitbucket.org/pcraven/arcade-games-work.

source: We need to "fork" the repository. This will create your own copy of the repository that will be independent of mine. Changes you make to a "fork" aren't automatically sent to the original. Fork the repository by clicking on the plus button:
de: Wir müssen dieses Repository "abspalten (englisch fork)". Das wird deine eigene Version des Repositories erzeugen, das unabhängig von meinem ist. Änderungen in einem Fork werden nicht automatisch in das Original kopiert. Forke das Repository durch Klicken auf den Plus-Knopf:

source: Then select "Fork":
de: Wähle danach "Fork":

source: Next, select a name for your fork. Use your last name and first name. Also, select that your repository is private, so that you don't share your homework answers with the world.
de: Als nächstes wähle einen Namen für deinen Fork. Verwenden deinen Nachnamen und Vornamen. Stelle ein, dass das Repository privat ist, damit nicht die ganze Welt deine Hausaufgaben sieht.

source: Now you have your own fork. It exists on the BitBucket server only.
de: Jetzt hast du deinen eigenen Fork. Er existiert nur auf dem BitBucket-Server.

source: Share the Repository
de: Teile das Repository

source: Give read permission to the instructor ``pcraven`` for your fork so he can grade your assignments.
de: Gib dem Übungsleiter ``pcraven`` Leserechte auf deinem Fork, so dass er deine Aufgabe benoten kann.

source: Then
de: Dann

source: Check the feedback on your homework. If the instructor can't get to your homework, you'll get a zero. You need to correct this and resubmit ASAP.
de: Überprüfe das Feedback zu deiner Hausaufgabe. Wenn der Übungsleiter nicht an deine Hausaufgabe herankommt, bekommst du null Punkte. Du musst das korrigieren und so schnell wie möglich die Hausaufgabe wieder einreichen.

source: Cloning the Repository
de: Klonen des Repositories

source: Every time you start working on a new computer, you'll need to create a clone. (Unless you use a flash drive.)
de: Jedes Mal, wenn du an neuem Rechner anfängst zu arbeiten, musst du einen Klon anlegen. (Es sei denn, du benutzt einen USB-Flash-Speicher.)

source: Run the program "Git Bash" on Windows. Or, if you are on the mac, go under "Applications", find "Utilities" and in that run "Terminal".
de: Starte das Programm "Git Bash" unter Windows. Wenn du unter MacOS arbeitest, starte "Terminal".

source: Git Bash Window
de: Git Bash Fenster

source: Figure out where you want to store your files. You might want to store the files on your laptop, a flash drive, or a networked drive.
de: Entscheide ,wo du deine Dateien speichern willst. Du kannst deine Dateien auf einem Laptop, einem Flash-Speicher oder einem Netzlaufwerk speichern.

source: Figure out what directory your "Bash" window is in. Do this by typing ``pwd``, which is short for "print working directory".
de: Finde heraus, in welchem Verzeichnis dein "Bash"-Fenster ist. Gebe dazu ``pwd`` ein. Das ist kurz für "print working directory".

source: You can see what files are in the directory by typing ``ls``, short for "list files".
de: Du kannst die Dateien in dem Verzeichnis anzeigen, indem du ``ls`` (kurz für "list files") eingibst.

source: You can change directories using the ``cd`` command. You should default to your "home" directory, which is a great place to put your files. But if you want them in a different location, change to that location now. There's a lot to the ``cd`` command, but there are a few variations you need to know:
de: Du kannst das Verzeichnis mit dem Kommando ``cd`` ("change directory") wechseln. Du solltest in deinem "home"-Verzeichnis sein. Das "home"-Verzeichnis ist ein guter Ort, um deine Dateien abzulegen. Wenn du aber die Dateien an einem anderen Ort ablegen willst, wechsele das Verzeichnis jetzt. Es gibt viele Möglichkeiten beim Kommando ``cd``, aber du benötigst nur ein paar Varianten:

source: ``cd`` Change to your "home" directory.
de: ``cd`` wechsele in dein "home"-Verzeichnis.

source: ``cd mydir`` Change to ``mydir`` directory. That directory must be in the same directory you are in now. Also, if you don't want to type the full directory name, you can type the first few letters and hit <tab>.
de: ``cd mydir`` wechsele in das ``mydir``-Verzeichnis. Das Verzeichnis muss im selben Verzeichnis sein, in dem du dich gerade befindest. Wenn du dir die Eingabe des kompletten Verzeichnisnamens sparen willst, gib die ersten paar Buchstaben ein und drücke <tab>.

source: ``cd ..`` Go up one directory.
de: ``cd ..`` gehe ein Verzeichnis nach oben.

source: We want to copy the repository you created to your computer. We'll call this a "clone." A "clone" is a copy we normally try to keep synced up, which is different than a "fork." To clone the repository, hit the "plus" and then select "Clone Repository"
de: Wir wollen das Repository, das du erzeugt hast, auf deinen Rechner kopieren. Wir nennen das einen "Klon". Ein Klon ist eine Kopie, die wir normalerweise versuchen synchron zu halten. Das ist der Unterschied zu einem Fork. Um das Repository zu klonen, klicke auf das "Plus" und wähle dann "Clone Repository" aus.

source: Copy the address that it gives you. It should have **your** name, and **not** my name. If you get this wrong, you'll have to restart everything back at the clone section. (Not the fork section.)
de: Kopiere die Adresse, die angezeigt wird. Es sollte **deinen** Namen und nicht **meinen** Namen enthalten. Wenn du das falsch machst, musst du von vorn im Klon-Abschnitt anfangen. (Nicht im Abschnitt Fork.)

source: Paste the command it gives you in your command prompt:
de: Füge das Kommando, das es dir anzeigt, auf der Kommandozeile ein:

source: Then...
de: Dann...

source: There you go! You now have a directory set up where you can do your work.
de: Das war es! Du hast jetzt ein Verzeichnis, in dem du arbeiten kannst.

source: Open Project in Pycharm
de: Öffne das Projekt in PyCharm

source: Go ahead and start PyCharm, then select "File...Open" and select that directory.
de: Mach weiter und starte PyCharm. Wähle danach "File...Open" und wähle das Verzeichnis aus.

source: Your project should look like the image below. If this isn't what you have, you might have opened the wrong folder. Hit "File...Open" and try again.
de: Dein Projekt sollte wie in der Abbildung unten aussehen. Wenn das nicht so ist, hast du vielleicht das falsche Verzeichnis geöffnet. Drücke "File...Open" und probiere es wieder.

source: If you click the arrow next to the folder name, you can see all the folders in the project folder.
de: Wenn du den Pfeil neben dem Ordnernamen anklickst, kannst du alle Ordner im Projektordner sehen.

source: If you move from computer to computer hand have a flash drive, you can reopen your project be just doing "File...Open". If you don't have your flash drive, you'll need to re-clone your repository.
de: Wenn du den Rechner wechselst und deine Daten auf einem Flash-Speicher hast, kannst du dein Projekt wieder mit "File...Open" öffnen. Wenn du keinen Flash-Speicher verwendest, musst du an jedem neuen Rechner das Repository neu klonen.

source: Change a File
de: Ändern einer Datei

source: Let's practice making a quick change to one of our files. Open your project folder, open the lab 1 folder, then open lab one. Type in "Hi" or something similar.
de: Lass uns üben und schnell eine von unseren Dateien ändern. Öffne deinen Projektordner, öffne den Ordner lab 1 und öffne dann lab one. Gebe "Hallo" oder etwas Ähnliches ein.

source: Hit Ctrl-S to save.
de: Drücke Ctrl-S um zu speichern.

source: Commit Your Code
de: Commite deinen Code

source: It is time to commit. Wait! You are young and don't want to commit yet?
de: Es ist Zeit zu commiten.

source: The cool thing with version control, is that every time you commit, you can go back to the code at that point in time. Version control lets you take it all back! It is the best type of commitment ever!
de: Das Praktische an der Versionsverwaltung ist, dass jedes Mal wenn du commitest, du zum Code zu diesem Zeitpunkt zurückkehren kannst. Versionsverwaltung lässt dich alles rückgängig machen. Es ist die beste Form von Commitment (englisch für Verpflichtung/Zusage)!

source: First, open Git Bash, and switch to the directory with your project using the ``cd`` command:
de: Öffne als erstes Git Bash und wechsele in das Verzeichnis mit deinem Projekt mit dem Kommando ``cd``:

source: Optionally, we can use ``git status`` to see what files have changed:
de: Wenn du willst, kannst du mit ``git status`` anzeigen lassen, welche Dateien verändert wurden:

source: Now, add all the files that have changed. The asterisk (``*``) is a wild card character that means get all changes. Optionally, we could list out each file, but that's a lot of work and we don't want to leave anything behind anyway.
de: Jetzt fügen wir alle Dateien, die geändert wurden, hinzu. Der Asterisk (``*``) ist ein Platzhalter für alle Änderungen. Optional können wir auch jede Datei angeben, aber das ist einiges an Arbeit und wir wollen keine geänderte Datei übersehen.

source: Commit the changes:
de: Commite die Änderungen:

source: You might get an error, if the computer doesn't know who you are yet. If you get this error, it will tell you the commands you need to run. They will look like:
de: Es kann sein, dass es einen Fehler gibt, wenn der Rechner noch nicht weiß, wer du bist. Wenn dieser Fehler auftaucht, wird der Rechner dir die auszuführenden Kommandos sagen. Sie werden so aussehen:

source: Then you can re-run your commit command. You can use the "up" arrow to get commands you typed in previously so you don't need to retype anything.
de: Nachdem du diese Kommandos mit deinen Daten ausgeführt hast, kannst du das commit-Kommando noch einmal ausführen. Mit dem "hoch"-Pfeil kannst du die vorher eingegebenen Kommandos zurückholen. Du brauchst das Kommando nicht noch einmal eintippen.

source: Push Your Code
de: Pushe deinen Code

source: And push them to the server:
de: Und pushe sie auf den Server:

source: Look to see if the message says that there is an "error." The message will probably look a little different than what you see above, with other objects or threads, but there should not be any errors. If there are errors, skip down to :ref:`cant-push`.
de: Sie dir die Meldung an, ob da "error." auftaucht. Die Meldung wird wahrscheinlich etwas anders aussehen als oben gezeigt. Die Objekte und Threads sollten unterschiedlich sein. Sie sollte aber keine Fehler enthalten. Wenn es Fehler gibt, springe zum Abschnitt :ref:`cant-push`.

source: Turning In Your Programs
de: Gib deine Programme ab

source: When it comes time to turn in one of your programs, go back to BitBucket. Click on "source", find the lab file, copy the URL:
de: Wenn es Zeit wird, dein Programm abzugeben, gehe wieder auf BitBucket. Klicke auf "source", wähle die lab-Datei und kopiere die URL:

source: Now go to Scholar and paste the link into the text field for the lab you are are working on.
de: Gehe jetzt auf Scholar und füge den Link in das Textfeld für die Aufgabe, an der du arbeitest, ein.

source: What If You Can't Push?
de: Was ist, wenn du nicht pushen kannst?

source: What happens if you can't push to the server? If you get an error like what's below? (See highlighted lines.)
de: Was passiert, wenn du nicht auf den Server pushen kannst? Was ist, wenn du einen Fehler bekommst, der so ähnlich wie der unten aussieht? (Sieh dir die hervorgehobenen Zeilen an.)

source: Step 1: Make Sure You Have No Pending Changes
de: Schritt 1: Überprüfe, dass es keine unerledigten (englisch pending) Änderungen gibt

source: Run a ``git status`` and make sure you have nothing to commit. It should look like this:
de: Führe ``git status`` aus und überprüfe, dass es nichts zu committen gibt. Es sollte wie folgt aussehen:

source: If you do hove code to commit, jump up to :ref:`commit` and then come back here.
de: Wenn du Code hast, der noch committed werden muss, springe zum Abschnitt :ref:`commit` und fahre dann hier fort.

source: Step 2: Pull Changes From The Server
de: Schritt 2: Pulle Änderungen vom Server

source: Pull changes from the server:
de: Pulle Änderungen vom Server:

source: Normally, this will work fine and you'll be done. But if you have other computers that you are coding on, the computer will automatically try to merge.
de: Normalerweise funktioniert das ordentlich und du bist fertig. Wenn du aber auch an anderen Rechnern programmierst, wird der Rechner automatisch zu mergen probieren.

source: Step 2A: Merging
de: Schritt 2A: Mergen

source: If you get a screen like the image below, the computer automatically merged your code bases. It now wants you to type in a comment for the merge. We'll take the default comment. Hold down the shift key and type ``ZZ``. If that doesn't work, hit escape, and then try again.
de: Wenn der Bildschirm wie unten gezeigt aussieht, hat der Rechner deine Codebasis automatisch gemerget. Es verlangt von dir einen Kommentar für den Merge einzugeben. Wir nehmen einfach den vorgegebenen Kommentar. Halte die Shift-Taste und geben ``ZZ`` ein. Wenn das nicht funktioniert, drücke die Escape-Taste und versuche es wieder.

source: (You are in an editor called **vim** and it is asking you for a comment about merging the files. Unfortunately vim is really hard to learn. Shift-ZZ is the command to save, and all we want to do is get out of it and move on.)
de: (Du befindest dich im Editor **vim** und es fragt die nach dem Kommentar zum Mergen der Dateine. Unglücklicherweise ist vim schwer zu erlernen. Shift-ZZ ist das Kommando zum Speichern und Schließen der Datei. Alles was wir wollen ist, raus zu kommen und weiter zu machen.)

source: It should finish with something that looks like:
de: Wenn es fertig ist, sollte es so ähnlich aussehen:

source: If instead you get this:
de: Wenn du stattdessen das bekommst:

source: Then we edited the same file in the same spot. We have to tell the computer if we want our changes, or the changes on the other computer.
de: Dann haben wir die Datei am gleichen Punkt geändert. Wir müssen dem Rechner mitteilen, ob wir die Änderungen auf diesem oder dem anderen Rechner haben wollen.

source: Step 2B: Resolving a Merge Conflict
de: Schritt 2B: Auflösen des Merge-Konflikts

source: Do a ``git status``. It should look something like this:
de: Führe ``git status`` aus. Es sollte in etwa so aussehen:

source: The key thing to look for is any file that says ``both modified``.
de: Suche nach den Dateien, bei denen steht ``both modified``.

source: If you want **your** copy, type:
de: Wenn du deine Änderungen behalten willst, gib ein:

source: If instead you want **their** copy (or the copy on the other computer) type
de: Wenn du stattdessen **deren** Kopie behalten willst (oder die Kopie auf dem anderen Rechner), gib ein:

source: Then when you are all done with all merges, type:
de: Wenn du mit allen Änderungen fertig bist, gib ein:

source: Step 3: Try Pushing Again
de: Schritt 3: Versuche noch einmal zu pushen

source: Longer Git Command Reference
de: Längere Liste mit Git-Kommandos

source: In my experience with 300 level group-project classes, these commands seem to capture most of what students need to do.
de: In meiner Erfahrung mit 300 Gruppenprojekt-Kursen sind das die Kommandos, die fast alles abdecken, was die Studierenden machen müssen.

source: Command
de: Kommando

source: Description
de: Beschreibung

source: See what has changed
de: Zeigt an, was sich geändert hat
