Repository: Anitha489/arcade_book
Catalog: locale/*/LC_MESSAGES/chapters/04_version_control/index.po
Languages: de

source: Grab stuff from the server, but don't merge
de: Holt Sachen von Server, aber merget sie nicht.

source: Abort a merge
de: Bricht den Merge ab

source: Fetch and Merge
de: Holt und merget

source: Add myfile.txt to be committed
de: Fügt myfile.txt zur Liste, die commitet werden soll, hinzu

source: Add everything
de: Füge alles hinzu

source: Search all files to see if there is merge error text. Do this before committing
de: Sucht alle Dateien mit einem Merge-Fehlertext. Führe dies vor einem Commit aus

source: Toss your changes in a merge, use theirs
de: Verwerfe die Änderungen in einem Merge, nimm die deren

source: Toss their changes, use yours
de: Verwirf deren Änderungen, nimm deine

source: Remove all your changes, go back to what was last committed. Untracked files are kept.
de: Löscht alle Änderungen und kehrt zu dem zurück, was zuletzt commitet wurde. Ungetrackte Dateien bleiben erhalten

source: Remove untracked files
de: Entfernt ungetrackte Dateien

source: Find the hash of a check-in, and you can go back to that check in. (Don't use 44fd, but replace with the has you want.)
de: Findet den Hash eines Check-In und du kannst zurück zu diesem Check-In gehen. (Verwende das was du suchst und nicht 44fd.)

source: Go back to most recent check in on the master branch.
de: Kehre zu dem letzten Check-In im Master-Branch zurück

source: Commit your work. Use a descriptive message or the other people in the class will be irritated with you.
de: Commitet deine Arbeit. Verwende einen beschreibenden Kommentar oder andere im Kurs werden irritiert von dir

source: Push commit up to the server.
de: Pushe die Commits auf den Server
