Repository: Anitha489/arcade_book
Catalog: locale/*/LC_MESSAGES/chapters/xx_flowchart/index.po
Languages: de

source: Flowchart For Setup And Version Control
de: Flussdiagramm für Setup und Versionskontrolle

source: Step A - Set Up The Software
de: Schritt A - Einrichten der Software

source: Does the computer you are working on have Python, PyCharm, Arcade, and Git installed?
de: Ist auf dem Rechner, auf dem Sie arbeiten, Python, PyCharm, Arcade und Git installiert?

source: No, software is needed to be installed - Go to :ref:`chapter-setup`, then continue below.
de: Nein, es muss Software installiert werden - Gehen Sie zu :ref:`chapter-setup` und fahren Sie unten fort.

source: Yes, everything is installed - Continue below
de: Ja, alles ist installiert - weiter unten

source: Step B - Get Your Files On The Computer
de: Schritt B - Holen Sie sich Ihre Dateien auf den Rechner

source: Do you have the folder with all your Python files on your computer?
de: Haben Sie den Ordner mit all Ihren Python-Dateien auf Ihrem Rechner?

source: No, and I have **never** "forked" the repository (never fork more than once) - Go to :ref:`fork-repository` and then :ref:`share-repository`. Proceed to the bullet point below.
de: Nein, und ich habe das Repository **nie** "geforkt" (forke niemals mehr als einmal) - Gehe zu :ref:`fork-repository` und dann :ref:`share-repository`. Fahren Sie mit dem Aufzählungspunkt unten fort.

source: No, but once I forked the repository - Go to :ref:`clone-repository`. Then continue below.
de: Nein, aber nachdem ich das Repository geforkt habe - Gehe zu :ref:`clone-repository`. Dann weiter unten.

source: Yes, continue below.
de: Ja, weiter unten.

source: Step C - Pull Changes From Other Computers
de: Schritt C - Änderungen von anderen Rechnern übernehmen

source: Have you edited your code on another computer?
de: Haben Sie Ihren Programmcode auf einem anderen Rechner bearbeitet?

source: Yes - Do :ref:`pull-changes` then continue below.
de: Ja - Führe :ref:`pull-changes` dann weiter unten aus.

source: No - Continue
de: Nein - Weiter

source: Step D - Edit Your Programs
de: Schritt D - Bearbeiten Sie Ihre Programme

source: Next :ref:`open-in-pycharm` and edit your program. When you are done, continue to the next step.
de: Weiter :ref:`open-in-pycharm` und bearbeiten Sie Ihr Programm. Wenn Sie fertig sind, fahren Sie mit dem nächsten Schritt fort.

source: Step E - Commit and Push Your Code
de: Schritt E - Commit und push Sie Ihren Programmcode

source: Was there any error in pushing your code?
de: Gab es einen Fehler beim Pushen Ihres Codes?

source: Yes - Follow the instructions with :ref:`cant-push`
de: Ja - Folgen Sie den Anweisungen mit :ref:`cant-push`

source: No - Continue below
de: Nein - Weiter unten

source: Step F - Turn In Your Labs
de: Schritt F - Geben Sie Ihre Übungen ab

source: Are you ready to turn in your program?
de: Sind Sie bereit, Ihr Programm einzureichen?

source: No - Then you are done for now!
de: Nein - dann sind Sie vorerst fertig!

source: Yes - :ref:`turn-in-program`
de: Ja - :ref:`turn-in-program`
