Repository: Anitha489/arcade_book
Catalog: locale/*/LC_MESSAGES/labs/lab_11_array_backed_grids/array_backed_grids.po
Languages: de

source: Lab 11: Array-Backed Grids
de: Übung 11: Array-basierte Gitterraster

source: Part 1
de: Teil 1

source: Start with the program at the end of :ref:`array-backed-grids`. Modify it so that rather than just changing the block the user clicks on, also change the blocks of the squares next to the user's click. (5 pts) If the user clicks on an edge, make sure the program doesn't crash and still handles the click appropriately. (5 pts)
de: Beginne mit dem Programm am Ende von :ref:`array-backed-grids`. Ändere es so, dass nicht nur der Block geändert wird, auf den der Benutzer klickt, sondern auch die Blöcke der Quadrate neben dem Klick des Benutzers. (5 Punkte) Vergewissere dich, dass das Programm nicht abstürzt und den Klick trotzdem entsprechend behandelt, wenn der Benutzer auf eine Kante klickt. (5 Punkte)

source: Example of working Lab 11
de: Beispiel einer funktionierenden Übung 11

source: Part 2
de: Teil 2

source: Create another program, again starting with the code at the end of :ref:`array-backed-grids`.
de: Erstelle ein anderes Programm, und beginne erneut mit dem Programmcode am Ende von :ref:`array-backed-grids`.

source: Write a loop that will count all of the cells that are selected in the grid and print them out. Put this code at the end of your ``on_mouse_press`` function. (2 pts)
de: Schreibe eine Schleife, in der alle im Raster ausgewählten Zellen gezählt und ausgegeben werden. Füge diesen Programmcode am Ende deiner Funktion ``on_mouse_press`` ein. (2 Punkte)

source: Sample Output
de: Beispielausgabe

source: Write another loop that will print how many cells are selected in each row: (3 pts)
de: Schreibe eine weitere Schleife, die angibt, wie viele Zellen in jeder Zeile ausgewählt sind: (3 Punkte)

source: Update the code so that it prints the count in both rows and columns: (1 pt)
de: Aktualisiere den Programmcode so, dass er die Anzahl in Zeilen und Spalten ausgibt: (1 Punkt)

source: Update the code so that the program will also print how many cells are continuously selected in a row, if that number is greater than 2. (4 pts)
de: Aktualisiere den Programmcode, damit das Programm auch ausgibt, wie viele Zellen fortlaufend in einer Reihe ausgewählt sind, wenn diese Anzahl größer als 2 ist. (4 Punkte)

source: To do this, create a new variable (like ``continuous_count``) that is reset to zero for each row. If the current grid location is one, then add one to ``continuous_count``. If it is zero, check if ``continuous_count`` is greater than 2. If so, print the count. Regardless, reset it back to zero.
de: Erstelle dazu eine neue Variable (wie ``continuous_count``), die für jede Zeile auf Null zurückgesetzt wird. Wenn der aktuelle Rasterplatz eins ist, dann addieren Sie eins zu ``continuous_count``. Wenn es Null ist, prüfe, ob ``continuous_count`` größer als 2 ist. Wenn ja, gib die Anzahl aus. Setze sie davon unabhängig auf Null zurück.

source: You'll also need to do the same ``if`` after the loop with the row is done. If the row goes up to the grid-edge, then the blocks-in-a-row won't trigger without this second check.
de: Du musst auch dasselbe ``if`` ausführen, nachdem die Schleife mit der Zeile abgeschlossen ist. Wenn die Reihe bis zur Kante des reicht, werden die Blöcke in dieser Reihe ohne diese zweite Prüfung nicht ausgelöst.
