Repository: Anitha489/arcade_book
Catalog: locale/*/LC_MESSAGES/labs/lab_07_user_control/user_control.po
Languages: de

source: Lab 7: User Control
de: Übung 7: Benutzersteuerung

source: This lab gives you a chance to practice drawing an object with a function and allow the user to control it.
de: In dieser Übung hast du die Möglichkeit, das Zeichnen eines Objekts mit einer Funktion zu üben und es dem Benutzer zu ermöglichen, diese zu steuern.

source: This lab does **NOT** use sprites. Look at :ref:`user-control` for examples relevant to this lab.
de: In dieser Übung werden **keine** Sprites verwendet. Schaue dir :ref:`user-control` für Beispiele an, die für diese Übung relevant sind.

source: Write one program, following these steps:
de: Schreibe ein Programm, indem du die folgenden Schritte ausführst:

source: Create a ``Lab 07 - User Control`` folder for this lab, or use one that is already set up in your project.
de: Erstelle einen "Lab 07 - User Control"-Ordner für diese Übung oder verwende einen, der bereits in deinem Projekt eingerichtet ist.

source: Begin your code with the template below:
de: Beginne dein Programm mit der folgenden Vorlage:

source: Lab 7 Template
de: Vorlage für Übung 7

source: Create a background image of some sort in the ``on_draw`` method. Feel free to use any of *your* code that *you* have written from prior labs that you have. To do this, put your code in the ``on_draw`` method. If your code used functions, move those functions as well to this program. Paste them above the ``MyGame`` class. Don't turn this in with just a solid color for the background, or you'll lose a couple points.
de: Erstelle ein Hintergrundbild in der ``on_draw``-Methode. Du darfst, irgendeinen deiner *Programmteile* verwenden, die *du* in früheren Übungen geschrieben hast. Füge dazu deinen Programmcode in die Methode ``on_draw`` ein. Wenn dein Programmteil Funktionen verwendet, verschiebe diese Funktionen ebenfalls in dieses Programm. Füge sie über der Klasse ``MyGame`` ein. Gib diese Übung nicht mit nur einer Farbe für den Hintergrund ab, sonst verlierst du ein paar Punkte.

source: In :ref:`user-control`, we talked about moving graphics with the keyboard, a game controller, and the mouse. To start, pick one of these methods, and get that ball moving around in your program.
de: In :ref:`user-control` haben wir über das Bewegen von Grafiken mit der Tastatur, einem Gamecontroller und der Maus gesprochen. Wähle zunächst eine dieser Methoden aus und bringe den Ball in deinem Programm ins Rollen.

source: In the examples, we just moved a ball. Adjust the code so that it draws something more interesting than a ball. You can pull from the code you used in prior labs where you drew with a function, and move it to the ``on_draw`` method of your class. But don't have your object be a simple one line of code shape.
de: In den Beispielen haben wir nur einen Ball bewegt. Passe den Programmcode so an, dass er etwas Interessanteres als eine Kugel zeichnet. Du kannst aus den Programmen, die du in früheren Übungen verwendet hast, in denen du mit einer Funktion gezeichnet hast, den Code in die Methode ``on_draw`` deiner Klasse verschieben. Lasse dein Objekt jedoch keine einfache Programmzeile sein.

source: Rename your class from ``Ball`` to a name that represents what you are really drawing.
de: Benenne deine Klasse von ``Ball`` in etwas um, der darstellt, was du wirklich zeichnest.

source: After you get that object moving, pick a *different* method of control (keyboard, mouse, gamepad.) Create a *new class*, draw something *different*, and move it around the screen.
de: Nachdem du dieses Objekt in Bewegung gesetzt hast, wähle eine *andere* Steuerungsmethode (Tastatur, Maus, Gamepad). Erstelle eine *neue Klasse*, zeichne etwas *anderes* und bewege es auf dem Bildschirm.

source: In the case of the game controller and the keyboard, make sure to add checks so that your object does not move off-screen and get lost.
de: Stelle Sie beim Gamecontroller und der Tastatur sicher, dass sich dein Objekt nicht über die Bildschirmgrenzen hinausbewegt und verloren geht.

source: Add a sound effect for when the user clicks the mouse button.
de: Füge einen Soundeffekt hinzu, wenn der Benutzer mit der Maustaste klickt.

source: Add a different sound effect for when the user bumps into the edge of the screen. Make sure the sound only plays when you are trying to go beyond the edge of the screen, and not when you just sit at the edge of the screen. This part isn't needed for anything controlled by the mouse.
de: Füge einen anderen Soundeffekt hinzu, wenn der Benutzer gegen den Bildschirmrand stößt. Stelle sicher, dass der Sound nur abgespielt wird, wenn man versucht, über den Bildschirmrand hinauszugehen, und nicht, wenn man nur am Bildschirmrand ist. Dieser Teil wird für nichts benötigt, was mit der Maus gesteuert wird.

source: When you are done, make sure you commit your sound effects in what you turn in! Otherwise your program can't be graded.
de: Wenn du fertig bist, stelle sicher, dass du deine Soundeffekte mit abgibst! Andernfalls kann dein Programm nicht benotet werden.
