Repository: Anitha489/arcade_book
Catalog: locale/*/LC_MESSAGES/chapters/16_user_control/user_control.po
Languages: de

source: User Control
de: Steuerung durch den Benutzer

source: How do we interact with the user? Get the user to move an object on the screen?
de: Wie interagieren wir mit dem Benutzer? Wie ermöglichen wir dem Benutzer, ein Objekt auf dem Bildschirm zu bewegen?

source: We can do this with the mouse, with the keyboard, or with the game controller.
de: Wir können dies mit der Maus, mit der Tastatur oder mit dem Game-Controller tun.

source: Move with the Mouse
de: Bewegen mit der Maus

source: The key to managing mouse motion to override the ``on_mouse_motion`` in the ``arcade.Window`` class. That method is called every time the mouse moves. The method definition looks like this:
de: Der Schlüssel zum Verwalten der Mausbewegungen ist die Methode ``on_mouse_motion`` in der Klasse ``arcade.Window`` zu überschreiben. Diese Methode wird jedes Mal aufgerufen, wenn sich die Maus bewegt. Die Methodendefinition sieht folgendermaßen aus:

source: The ``x`` and ``y`` are the coordinates of the mouse. the ``dx`` and ``dy`` represent the change in x and y since the last time the method was called.
de: Das ``x`` und ``y`` sind die Koordinaten der Maus. Das ``dx`` und ``dy`` repräsentieren die Änderung von ``x`` und ``y`` seit dem letzten Aufruf der Methode.

source: Often when controlling a graphical item on the screen with the mouse, we do not want to see the mouse pointer. If you don't want to see the mouse pointer, in the ``__init__`` method, call the following method in the parent class:
de: Wenn du ein grafisches Element auf dem Bildschirm mit der Maus steuerst, willst du häufig den Mauszeiger verstecken. Wenn du den Mauszeiger nicht sehen möchtest, rufe in der Methode ``__init__`` die folgende Methode der Elternklasse auf:

source: The example below takes our ``Ball`` class, and moves it around the screen with the mouse.
de: Das folgende Beispiel nimmt unsere Klasse ``Ball`` und bewegt sie mit der Maus über den Bildschirm.

source: Mouse Clicks
de: Mausklicks

source: You can also process mouse clicks by defining an ``on_mouse_press`` method:
de: Wir können Mausklicks auch verarbeiten, indem wir eine ``on_mouse_press``-Methode definieren:

source: Move with the Keyboard
de: Bewegen mit der Tastatur

source: Moving with the game controller is similar to our bouncing ball example. There are just two differences:
de: Das Bewegen mit der Tastatur ähnelt unserem Beispiel für einen springenden Ball. Es gibt nur zwei Unterschiede:

source: We control the ``change_x`` and ``change_y`` with the keyboard
de: Wir steuern die Werte von ``change_x`` und ``change_y`` mit der Tastatur.

source: When we hit the edge of the screen we stop, rather than bounce.
de: Wenn wir den Bildschirmrand erreichen, halten wir an, statt abzuprallen.

source: To detect when a key is hit, we override the ``on_key_press`` method. We might think of hitting a key as one event. But it is actually two. When the key is pressed, we start moving. When the key is released we stop moving. That makes for two events. Releasing a key is controlled by ``on_key_release``.
de: Um festzustellen, wenn eine Taste gedrückt wird, überschreiben wir die Methode ``on_key_press``. Man könnte vermuten, dass wir einen Tastendruck als ein Ereignis zu bekommen. Aber es sind tatsächlich zwei. Wenn die Taste gedrückt wird, bewegen wir uns. Wenn die Taste losgelassen wird, bleiben wir stehen. Das ergibt zwei Ereignisse. Das Loslassen einer Taste wird durch ``on_key_release`` gesteuert.

source: These methods have a ``key`` variable as a parameter that can be compared with an ``if`` statement to the values in the `arcade.key library <http://arcade.academy/arcade.key.html>`_.
de: Diese Methoden haben eine ``key``-Variable als Parameter, die mit einer ``if``-Anweisung mit den Werten in `arcade.key <http://arcade.academy/arcade.key.html>`_ verglichen werden kann.

source: We can use this in a program to move a ball around the screen. See the highlighted lines in the program below:
de: Wir können dies in einem Programm verwenden, um einen Ball über den Bildschirm zu bewegen. Siehe die markierten Zeilen im Programm unten:

source: Keep From Moving Off Screen
de: Verhindern, dass der Bildschirm verlassen wird

source: Unfortunately in the prior program, there is nothing that keeps the player from moving off-screen. If we want to stop the player from moving off-screen we need some additional code.
de: Leider gibt es im vorherigen Programm nichts, was die Spieler davon abhält, sich über den Bildschirmrand hinaus zu bewegen. Wenn wir den Spieler daran hindern möchten, sich den Bildschirmbereich zu verlassen, benötigen wir zusätzlichen Code.

source: We detect the edge by comparing ``position_x`` with the left and right side of the screen For example:
de: Wir erkennen den Rand, indem wir ``position_x`` mit der linken und rechten Seite des Bildschirms vergleichen. Zum Beispiel:

source: But this isn't perfect. Because the position specifies the *center* of the ball, by the time the x coordinate is 0 we are already have off the screen. It is better to compare it to the ball's radius:
de: Das ist aber nicht perfekt. Da die Position die *Mitte* des Balls angibt, haben wir zu dem Zeitpunkt, an dem die x-Koordinate 0 ist, den Bildschirm bereits verlassen. Es ist besser, die Position mit dem Radius des Balls zu vergleichen:

source: What do we do once it hits the edge? Just set the value back to the edge:
de: Was machen wir, wenn er am Rande angekommen ist? Setze den Wert einfach auf den Rand zurück:

source: Here's a full example:
de: Hier ist ein vollständiges Beispiel:

source: Moving with the Game Controller
de: Bewegen mit dem Game-Controller

source: Working with game controllers is a bit more complex. A computer might not have any game controllers, or it might have five controllers plugged in.
de: Die Arbeit mit Game-Controllern ist etwas komplexer. Am Rechner könnte kein Game-Controller oder auch fünf Controller angeschlossen sein.

source: We can get a list of all game pads that are plugged in with the ``get_joysticks`` function. This will either return a list, or it will return nothing at all if there are no game pads.
de: Wir können eine Liste aller mit der Funktion ``get_joysticks`` eingesteckten Gamepads erhalten. Dies gibt entweder eine Liste mit den Gamepads oder eine leere Liste zurück, wenn keine Gamepads vorhanden sind.

source: Below is a block of code that can be put in an ``__init__`` method for your application that will create an instance variable to represent a game pad if one exists.
de: Nachfolgend finden Sie einen Codeblock, der in eine ``__init__`` -Methode für Ihre Anwendung eingefügt werden kann, mit der eine Objektvariable erstellt wird, die ein Gamepad darstellt, sofern es vorhanden ist.

source: Joystick Values
de: Joystick-Werte

source: After this, you can get the position of the game controller joystick by calling ``self.joystick.x`` and ``self.joystick.y``.
de: Danach können Sie die Position des Game-Controller-Joysticks ermitteln, indem Sie ``self.joystick.x`` und ``self.joystick.y`` aufrufen.

source: Try this, combined with the initialization code from above:
de: Probiere dies, kombiniert mit dem Initialisierungscode von oben, aus:

source: Run the program and see the values it prints out for your game controller as you move the joystick on it around.
de: Führe das Programm aus und sieh dir die Werte an, die es für Ihren Game-Controller ausgibt, wenn du den Joystick bewegen.

source: The values will be between -1 and +1, with 0 being a centered joystick.
de: Die Werte liegen zwischen -1 und +1, wobei 0 ein zentrierter Joystick ist.

source: The x-axis numbers will be negative if the stick goes left, positive for right.
de: Die Zahlen auf der x-Achse sind negativ, wenn der Joystick nach links geht, positiv nach rechts.

source: The y-axis numbers will be opposite of what you might expect. Negative for up, positive for down.
de: Die Zahlen für y-Achse sind eventuell entgegengesetzt zu dem was du erwartest. Negativ für oben, positiv für unten.

source: Centered (0, 0)
de: Zentriert (0, 0)

source: Down (0, 1)
de: Unten (0, 1)

source: Down/Left (-1, 1)
de: Runter / links (-1, 1)

source: Down/Right (1, 1)
de: Unten / Rechts (1, 1)

source: Up (0, -1)
de: Auf (0, -1)

source: Up/Left (-1, -1)
de: Oben / Links (-1, -1)

source: Up/Right (1, -1)
de: Oben / Rechts (1, -1)

source: We can move the ball by adding the following code to the ``update``:
de: Wir können den Ball bewegen, indem wir den folgenden Code zu ``update`` hinzufügen:

source: Notice the ``-`` we put in front of setting the y vector. If we don't do this, the ball will move opposite of what we expect when going up/down. This is because the joystick has y values mapped opposite of how we'd normally expect. There's a long story to that, which I will not bore you with now.
de: Beachte das ``-``, das wir vor das Setzen des y-Werts schreiben. Wenn wir dies nicht tun, bewegt sich der Ball entgegengesetzt zu dem, was wir beim Auf- und Absteigen erwarten. Dies liegt daran, dass der Joystick y-Werte hat, die entgegengesetzt zu dem sind, was wir normalerweise erwarten würden. Das hat eine lange Geschichte, mit der ich Euch jetzt nicht langweilen werde.

source: But with this code our ball moves *so slow*. How do we speed it up? We can make it run five times faster by multiplying by five if we want.
de: Aber mit diesem Code bewegt sich unser Ball *so langsam*. Wie beschleunigen wir das? Wir können es fünfmal schneller machen, indem wir es mit fünf multiplizieren, wenn wir wollen.

source: Or better yet, define a constant variable at the top of your program and use that. In our final example below, we'll do just that.
de: Oder noch besser, definiere eine konstante Variable am Anfang des Programms und verwende diese. In unserem letzten Beispiel unten machen wir genau das.

source: Deadzone
de: Toter Bereich

source: What if your ball 'drifts' when you have the joystick centered?
de: Was ist, wenn der Ball "driftet", wenn der Joystick zentriert in der Mitte steht?

source: Joysticks are mechanical. A centered joystick might have a value not at 0, but at 0.0001 or some small number. This will make for a small "drift" on a person's character. We often counteract this by having a "dead zone" where if the number is below a certain value, we just assume it is zero to eliminate the drift.
de: Joysticks funktionieren mechanisch. Ein zentrierter Joystick kann einen Wert haben, der nicht bei 0, sondern bei 0,0001 oder einer anderen kleinen Zahl liegt. Dies führt zu einem kleinen "Driften" der Spielfigur. Wir wirken dem oft mit einer "toten Bereich" entgegen, indem wir, wenn die Zahl unter einem bestimmten Wert liegt, einfach davon ausgehen, dass sie Null ist, um die Abweichung zu beseitigen.

source: See the highlighted lines for how we take care of the dead zone:
de: In den hervorgehobenen Linien sehen Sie, wie wir uns um den toten Bereich kümmern:
