Repository: Anitha489/arcade_book
Catalog: locale/*/LC_MESSAGES/chapters/10_if_statements/if_statements.po
Languages: de

source: If Statements
de: Wenn-dann-Anweisungen

source: How do we tell if a player has beat the high score? How can we tell if he has run out of lives? How can we tell if she has the key required to open the locked door?
de: Wie stellen wir fest, ob eine Spielerin den Highscore gebrochen hat? Wie können wir feststellen, ob sie alle Leben aufgebraucht hat? Wie können wir feststellen, ob sie den Schlüssel besitzt, um die verschlossene Tür zu öffnen?

source: What we need is the ``if`` statement. The ``if`` statement is also known as a *conditional statement*. (You can use the term "conditional statement" when you want to impress everyone how smart you are.) The if statement allows a computer to make a decision. Is it hot outside? Has the spaceship reached the edge of the screen? Has too much money been withdrawn from the account? A program can test for these conditions with the ``if`` statement.
de: Was wir brauchen, ist die ``if``-Anweisung. Die ``if``-Anweisung kennt man auch als *bedingte Anweisung*. (Du kannst "bedingte Anweisung" gerne verwenden, um anderen zu zeigen, dass du etwas vom Programmieren verstehst.) Die ``if``-Anweisung erlaubt einem Rechner eine Entscheidung zu fällen. Ist es heiß draußen? Hat das Raumschiff die Kante des Bildschirms erreicht? Wurde zu viel Geld vom Konto abgehoben? Ein Programm kann diese Bedingungen mit der ``if``-Anweisung überprüfen.

source: Basic Comparisons
de: Einfache Vergleiche

source: Here are a few examples of ``if`` statements. The first section sets up two variables (a and b) for use in the ``if`` statements. Then two ``if`` statements show how to compare the variables to see if one is greater than the other.
de: Hier folgen ein paar Beispiele von bedingten Anweisungen. Der erste Abschnitt besteht aus zwei Variablen (``a`` und ``b``) zur Verwendung in bedingten Anweisungen. Danach folgen zwei ``if``-Anweisungen, die zeigen wie man die beiden Variablen vergleicht, um festzustellen ob eine größer als die andere ist.

source: Example ``if`` statements: less than, greater than
de: Beispiel bedingte Anweisungen: kleiner, größer als

source: Output
de: Ausgabe

source: Since ``a`` is less than ``b``, the first statement will print out if this code is run. If the variables ``a`` and ``b`` were both equal to 4, then neither of the two ``if`` statements above would print anything out. The number 4 is not greater than 4, so the ``if`` statement would fail.
de: Da ``a`` kleiner als ``b`` ist, sorgt die erste bedingte Anweisung dafür, dass dies ausgegeben wird. Wenn die beiden Variablen beide gleich 4 wären, würde keine der beiden bedingten Anweisungen oben etwas ausgeben. Die Zahl 4 ist nicht größer als 4, also wird die ``if``-Anweisung fehlschlagen.

source: To show the flow of a program a *flowchart* may be used. Most people can follow a flowchart even without an introduction to programming. See how well you can understand the figure below.
de: Um den Ablauf eines Programms darzustellen, kann man einen *Programmablaufplan* verwenden. Die meisten Leute können einem Programmablaufplan folgen, auch wenn sie noch gar keine Einführung ins Programmieren hatten. Probiere aus, wie gut du die Abbildung unten verstehst.

source: Flowchart
de: Programmablaufplan

source: This book skips an in-depth look at flowcharting because it is boring. But if you want to be a superstar programmer, please read more about it at:
de: In diesem Buch überspringen wir die Erstellung von Programmablaufplänen, weil es langweilig ist. Wenn du aber ein Spitzenprogrammierer werden willst, dann lies bitte hier weiter:

source: http://en.wikipedia.org/wiki/Flowchart
de: https://de.wikipedia.org/wiki/Programmablaufplan

source: The prior example checked for greater than or less than. Numbers that were equal would not pass the test. To check for a values greater than or equal, the following examples show how to do this:
de: Das vorige Beispiel hat auf größer oder kleiner als überprüft. Zahlen die gleich groß sind, würden diesen Test nicht bestehen. Das folgende Beispiel zeigt dir, wie man überprüft, ob Werte größer oder gleich sind:

source: Example ``if`` statements: less than or equal, greater than or equal
de: Beispiel bedingte Anweisungen: kleiner oder gleich, größer oder gleich

source: The ``<=`` and ``>=`` symbols must be used in order, and there may not be a space between them. For example, ``=<`` will not work, nor will ``< =``.
de: Die Zeichen ``<=`` und ``>=`` müssen in dieser Reihenfolge stehen und es darf kein Leerzeichen zwischen ihnen stehen. Zum Beispiel wird ``=<`` und auch ``< =`` nicht funktionieren.

source: When writing these statements out on a test, some students like to use the ``≤`` symbol. For example:
de: In einer Klausur schreiben die Studenten diese Anweisungen gerne mit dem Zeichen ``≤``. Zum Beispiel:

source: This ``≤`` symbol doesn't actually work in a program. Plus most people don't know how to easily type it on the keyboard. (Just in case you are curious, to type it hold down the 'alt' key while typing 243 on the number pad.) So when writing out code, remember that it is ``<=`` and not ``≤``. Many people lose points on tests for this reason; don't be that person.
de: Das Zeichen ``≤`` funktioniert tatsächlich nicht in einem Programm. Außerdem wissen die meisten nicht, wie man einfach dieses Zeichen auf der Tastatur eingibt. (Nur falls du neugierig bist, drücke die 'alt'-Taste, während du 243 auf dem Tastenfeld eingibst.) Also merke dir ``<=`` und nicht ``≤``, wenn du Code eingibst. Viele verlieren an dieser Stelle Punkte in Klausuren. Vermeide zu diesen zu gehören.

source: The next set of code checks to see if two items are equal or not. The operator for equal is ``==`` and the operator for not equal is ``!=``. Here they are in action.
de: Der nächste Programmschnipsel überprüft, ob zwei Elemente gleich sind oder nicht. Der Operator für Gleichheit ist ``==`` und der Operator für Ungleichheit ist ``!=``. Hier sind sie in Aktion.

source: Example ``if`` statements: equal not equal
de: Beispiel bedingte Anweisungen: gleich, nicht gleich

source: Learn when to use = and ==.
de: Lerne wann ``=`` und wann ``==`` verwendet werden müssen.

source: It is very easy to mix up when to use ``==`` and ``=``. Use ``==`` if you are asking if they are equal, use ``=`` if you are assigning a value.
de: Es ist leicht ``==`` und ``=`` zu verwechseln. Verwende ``==``, wenn du fragst, ob sie gleich sind. Verwende ``=``, wenn du einen Wert zuweisen willst.

source: The two most common mistakes in mixing the ``=`` and ``==`` operators are demonstrated below:
de: Die beiden häufigsten Fehler beim Vertauschen der Operatoren ``=`` und ``==``, werden unten gezeigt:

source: Stop! Please take a moment to go back and carefully study the last two code examples. Save time later by making sure you understand when to use ``=`` and ``==``. Don't guess.
de: Halt! Nimm dir noch etwas Zeit, gehe zurück und sieh dir sorgfältig die letzten beiden Programmbeispiele an. Spare später Zeit dadurch, dass du sicher verstehst, wann du ``=`` und wann ``==`` verwenden musst. Rate nicht einfach.

source: Indentation
de: Einrückung

source: Indentation matters. Each line under the ``if`` statement that is indented will only be executed ``if`` the statement is ``True``:
de: Die Einrückung ist entscheidend. Jede Zeile unter der ``if``-Anweisung, die eingerückt ist, wird nur ausgeführt, wenn die Bedingung wahr ist (``True`` ergibt):

source: Indentation must be the same. This code doesn't work.
de: Die Einrückung muss gleich tief sein (gleiche Anzahl von Leerzeichen). Dieser Code funktioniert nicht.

source: Once an ``if`` statement has been finished, it is not possible to re-indent to go back to it. The test has to be performed again.
de: Sobald eine bedingte Anweisung beendet wurde, kann man nicht wieder den Text einrücken, um zur bedingten Anweisung zurückzukehren. Die Überprüfung muss erneut ausgeführt werden.

source: Using And/Or
de: Verwendung von und/oder

source: An ``if`` statement can check multiple conditions by chaining together comparisons with ``and`` and ``or``. These are also considered to be *operators* just like ``+`` or ``-`` are.
de: Die bedingte Anweisung kann mehrere Bedingungen durch Verbinden der Vergleiche mit ``and`` (deutsch und) und ``or`` (deutsch oder) überprüfen. Diese werden also als *Operatoren*, wie ``+`` oder ``-``, betrachtet.

source: Example ``if`` statements, using "and" and "or"
de: Beispiel bedingte Anweisungen: Verwendung von ``and`` und ``or``

source: Repeat yourself please.
de: Wiederhole bitte selbst.

source: A common mistake is to omit a variable when checking it against multiple conditions. The code below does not work because the computer does not know what to check against the variable ``c``. It will not assume to check it against ``a``.
de: Ein häufiger Fehler ist, eine Variable auszulassen, wenn sie gegen mehrere Werte verglichen werden soll. Der Code unten wird nicht funktionieren, da der Rechner nicht weiß, womit er die Variable ``c`` vergleichen soll. Er wird nicht annehmen, dass er sie mit ``a`` vergleichen soll.

source: Boolean Variables
de: Boolesche Variablen

source: Python supports Boolean variables. What are Boolean variables? Boolean variables can store either a ``True`` or a value of ``False``. `Boolean algebra`_ was developed by `George Boole`_ back in 1854. If only he knew how important his work would become as the basis for modern computer logic!
de: Python unterstützt Boolesche Variablen. Was sind Boolesche Variablen? Boolesche Variablen können entweder den Wert ``True`` (deutsch wahr) oder ``False`` (deutsch falsch) speichern. Die `Boolean algebra`_ wurde von `George Boole`_ schon 1854 entwickelt. Wenn er gewusst hätte, dass seine Arbeit die Grundlage der modernen Rechnerlogik werden würde.

source: An ``if`` statement needs an expression to evaluate to ``True`` or ``False``. What may seem odd is that it does not actually need to do any comparisons if a variable already evaluates to ``True`` or ``False``.
de: Eine bedingte Anweisung benötigt einen Ausdruck, der zu ``True`` oder ``False`` ausgewertet wird. Was etwas merkwürdig erscheinen kann, ist, dass wir keine Vergleiche anstellen müssen, wenn die Variable schon zu ``True`` oder ``False`` ausgewertet wird.

source: If statements and Boolean data types
de: Bedingte Anweisungen und Boolesche Datentypen

source: Back when I was in school it was popular to say some false statement. Wait three seconds, then shout "NOT!" Well, even your computer thinks that is lame. If you are going to do that, you have to start with the not operator. The following code uses the not to flip the value of a between true and false.
de: Als ich noch zur Schule ging, war es in Mode etwas Falsches zu sagen, drei Sekunden zu warten und dann "NICHT!" zu rufen. Nun gut, selbst dein Rechner wird das für einen lahmen Witz halten. Wenn du das machen willst, musst du mit den ``not``-Operator anfangen. Der folgende Code verwendet den ``not``-Operator, um den Wert zwischen wahr und falsch zu invertieren.

source: Because not is an operator and not a function, parentheses aren't necessary.
de: Da ``not`` ein Operator und keine Funktion ist, sind keine Klammern nötig.

source: The not operator example 2
de: Der ``not``-Operator - Beispiel 2

source: It is also possible to use Boolean variables with and and or operators.
de: Es ist ebenfalls möglich, Boolesche Variablen mit den ``and``- und ``or``-Operatoren zu verwenden.

source: Using "and" with Boolean variables
de: ``and`` mit Booleschen Variablen verwenden

source: Who knew True/False could be hard?
de: Wer hätte gedacht, dass wahr/falsch so schwierig sein kann?

source: It is also possible to assign a variable to the result of a comparison. In the code below, the variables ``a`` and ``b`` are compared. If they are equal, ``c`` will be ``True``, otherwise ``c`` will be ``False``.
de: Es ist ebenfalls möglich das Ergebnis eines Vergleichs an eine Variable zuzuweisen. Im Code unten werden die Variablen ``a`` und ``b`` verglichen. Wenn sie gleich sind, wird ``c`` ``True`` andernfalls ``False`` zugewiesen.

source: Assigning values to Boolean data types
de: Werte an Boolesche Datentypen zuweisen

source: Zero means False. Everything else is True.
de: Null bedeutet ``False``. Alles andere ist ``True``.

source: It is possible to create an ``if`` statement with a condition that does not evaluate to ``True`` or ``False``. This is not usually desired, but it is important to understand how the computer handles these values when searching for problems. The statement below is legal and will cause the text to be printed out because the values in the ``if`` statement are non-zero:
de: Es ist möglich eine ``if``-Anweisung mit einer Bedingung zu schreiben, die nicht zu ``True`` oder ``False`` ausgewertet wird. Das ist üblicherweise nicht erwünscht, aber es ist wichtig für die Fehlersuche zu verstehen, wie der Rechner diese Werte handhabt. Die Anweisungen unten sind erlaubt und wird den Text ausgeben, weil die Werte in der ``if``-Anweisung ungleich Null sind.

source: The code below will not print out anything because the value in the ``if`` statement is zero which is treated as ``False``. Any value other than zero is considered ``True``.
de: Der Code unten wird nichts ausgeben, weil der Wert in der ``if``-Anweisung Null ist und damit als ``False`` behandelt wird. Jeder von Null verschiedenen Wert wird als ``True`` betrachtet.

source: The ``input`` Function
de: Die ``input``-Funktion

source: Rather than hard-coding values into our program, we can use the ``input`` function to ask the user to type something in. The ``input`` function is reasonably simple to use:
de: Statt die Werte fest in unser Programm zu schreiben, können wir die ``input``-Funktion verwenden, um den Benutzer aufzuforderen etwas einzugeben. Die ``input``-Funktion ist einigermaßen einfach zu verwenden:

source: As a parameter to ``input``, just give it text to use as a prompt. Whatever the user types in, is stored in the variable on the left.
de: Gib als Argument beim Aufruf von ``input`` einfach den Text der Eingabeaufforderung an. Was immer der Benutzer eingibt, wird in der Variablen auf der linken Seite der Zuweisung gespeichert.

source: Note that there is a question mark and a space at the end of that string. If you didn't have this, what the user types in will run right up next to the prompt. That looks terrible. The user is tempted to type a space as the first part of their input, which complicates things for us later.
de: Beachte, dass ein Fragezeichen und ein Leerzeichen am Ende der Zeichenkette steht. Wenn du das weg lässt, wird der Text, den der Benutzer eingibt, direkt an die Eingabeaufforderung angehängt. Das sieht aber schrecklich aus. Der Benutzer wird verführt, ein Leerzeichen als Erstes einzugeben. Das wird uns aber die Sache später erschweren.

source: There's one more thing we have to learn. We can't take what the user types in and compare it to a number. This program:
de: Es gibt noch etwas zu lernen. Wir können die Eingabe des Benutzers nicht direkt mit einer Zahl vergleichen. Dieses Programm:

source: ...will fail with the error:
de: ... wird mit einem Fehler enden:

source: Whatever the user types in is stored as text. We also call text a "string" because to the computer it is just a string of characters. This is different than a number, and the computer does not know how to compare them.
de: Was immer der Benutzer eingibt wird als Text gespeichert. Wir nennen einen Text auch Zeichenkette, weil es für den Rechner nur eine Kette von Zeichen ist. Eine Zeichenkette (englisch *string*) ist etwas anderes als eine Zahl und der Rechner weiß nicht, wie er sie vergleichen soll.

source: Therefore, we need to convert the input into a number. We can do with with either the ``int`` for integers, or the ``float`` function for numbers with a decimal.
de: Wir müssen deshalb die Eingabe in eine Zahl umwandeln. Wir können das entweder mit der ``int``-Funktion für ganze Zahlen (englisch *integers*) oder der ``float``-Funktion für Gleitkommazahlen (englisch *floating point numbers*, kurz *floats*) erreichen.

source: For example:
de: Zum Beispiel:

source: You can also do it in one step by nesting the functions:
de: Du kannst die Funktionen auch in einem Schritt verschachteln:

source: Else and Else If
de: Andernfalls und andernfalls wenn

source: Below is code that will get the temperature from the user and print if it is hot.
de: Unten ist der Code, der die Temperatur vom Benutzer abfragt und ausgibt, ob es heiß ist.

source: If the programmer wants code to be executed if it is not hot, she can use the else statement. Notice how the else is lined up with the ``i`` in the ``if`` statement, and how it is followed by a colon just like the ``if`` statement.
de: Wenn die Programmiererin Code ausführen möchten, wenn es nicht heiß ist, kann sie die ``else``-Anweisung verwenden. Beachte wie das ``else`` genau so weit eingerückt ist wie das ``if`` und von einem Doppelpunkt gefolgt wird, wie bei der ``if``-Anweisung.

source: In the case of an if...else statement, one block of code will always be executed. The first block will be executed ``if`` the statement evaluates to ``True``, the second block if it evaluates to False.
de: Im Fall der ``if``...``else``-Anweisung (besser zweiseitige Auswahl), wird immer ein Block von Anweisungen ausgeführt. Der erste Block wird ausgeführt, wenn die Bedingung zu ``True`` ausgewertet wird. Der zweite Block wird ausgeführt, wenn sie zu ``False`` ausgewertet wird.

source: Example if/else statement
de: Beispiel zweiseitige Auswahl

source: It is possible to chain several ``if`` statements together using the else...if statement. Python abbreviates this as ``elif``.
de: Man kann mehrere bedingte Anweisungen mit einer ``else``...``if``-Anweisung verketten. Python kürzt dies mit ``elif`` ab.

source: Example if/elif/else statement
de: Beispiel verschachtelte Auswahl

source: In the code below, the program will output "It is hot outside" even if the user types in 120 degrees. Why? How can the code be fixed?
de: Der Code unten wird "It is hot outside" ausgeben, wenn der Benutzer eine Temperatur von 120 Grad Fahrenheit eingibt. Warum? Wie kann das Programm repariert werden?

source: If you can't figure it out, see the video.
de: Wenn du nicht drauf kommst, sieh dir das Video an.

source: Example of improper ordering if/elif/else
de: Beispiel verschachtelte Auswahl mit falscher Anordnung

source: Text Comparisons
de: Textvergleiche

source: It is possible to use an if statement to check text.
de: Es ist möglich eine bedingte Anweisung zum Überprüfen von Text zu verwenden.

source: Case sensitive text comparison
de: Groß-/Kleinschreibungsabhängiger Textvergleich

source: The prior example will only match if the user enters "Paul". It will not work if the user enters "paul" or "PAUL".
de: Nur wenn der Benutzer im Beispiel oben "Paul" eingibt, wird es passen. Es wird nicht funktionieren, wenn der Benutzer "paul" oder "PAUL" eingibt.

source: A common mistake is to forget the quotes around the string being compared. In the example below, the computer will think that Paul is a variable that stores a value. It will flag an error because it has no idea what is stored in the variable Paul.
de: Ein üblicher Fehler ist, die Anführungszeichen um die Zeichenkette, mit der verglichen werden soll, zu vergessen. Im Beispiel unten wird der Rechner annehmen, dass Paul eine Variable ist, die einen Wert speichert. Er wird einen Fehler anzeigen, weil er keine Ahnung hat, was in der Variablen Paul gespeichert ist.

source: Incorrect comparison
de: Fehlerhafter Vergleich

source: Multiple Text Possibilities
de: Mehrfache Textvergleiche

source: When comparing a variable to multiple possible strings of text, it is important to remember that the comparison must include the variable. For example:
de: Wenn man eine Variable mit mehreren möglichen Zeichenketten vergleicht, ist es wichtig daran zu denken, dass jeder Vergleich die Variable beinhalten muss. Zum Beispiel:

source: This is because any value other than zero, the computer assumes to mean ``True``. So to the computer "Mary" is the same thing as ``True`` and so it will run the code in the ``if`` statement.
de: Dies ist so, weil für jeden von Null verschiedenen Wert der Rechner annimmt, dass ``True`` gemeint ist. Für den Rechner bedeutet in diesem Fall "Mary" also ``True`` und er führt den Code in der ``if``-Anweisung aus.

source: Case Insensitive Comparisons
de: Groß-/Kleinschreibungsunabhängige Vergleiche

source: If the program needs to match regardless as to the case of the text entered, the easiest way to do that is to convert everything to lower case. This can be done with the lower command.
de: Wenn der Vergleich unabhängig von Groß-/Kleinschreibung passen soll, ist es am einfachsten alles in Kleinbuchstaben umzuwandeln. Dies macht die ``lower``-Funktion.

source: Learn to be insensitive.
de: Lerne unabhängig zu sein.

source: The example below will take whatever the user enters, convert it to lower case, and then do the comparison. Important: Don't compare it against a string that has uppercase. If the user input is converted to lowercase, then compared against uppercase letters, there is no way a match can occur.
de: Das Beispiel unten wird den Text, den der Benutzer eingibt, in Kleinbuchstaben umwandeln und dann vergleichen. Wichtig: Vergleiche ihn nicht mit einer Zeichenkette, die Großbuchstaben enthält. Wenn die Eingabe in Kleinbuchstaben umgewandelt wurde, wird sie niemals auf eine Zeichenkette mit Großbuchstaben passen.

source: Case-insensitive text comparison
de: Groß-/Kleinschreibungsunabhängige Textvergleiche

source: Example if Statements
de: Beispiel bedingte Anweisungen

source: The next set of example code below runs through all the concepts talked about earlier. The on-line video traces through each line of code and explains how it works
de: Das folgende Beispielprogramm führt alle oben dargestellten Konzepte aus. Das Video online geht durch alle Codezeilen und erklärt, wie sie funktionieren.
