Repository: Anitha489/arcade_book
Catalog: locale/*/LC_MESSAGES/labs/lab_12_final_lab/final_lab.po
Languages: de

source: Lab 12: Final Lab
de: Übung 12: Abschließende Übung

source: This is it! This is your chance to use your creativity and really show off what you can create in your own game. More than just passing a test, in this class you actually get to do something, and create something real.
de: Das ist es! Dies ist deine Chance, deine Kreativität zu nutzen und wirklich zu zeigen, was du in deinem eigenen Spiel erstellen kannst. Mehr als nur eine Prüfung zu bestehen, in diesem Kurs kann man tatsächlich etwas tun und etwas Reales erschaffen.

source: There are two options for the final lab. A "video game option" and a "text adventure option."
de: Es gibt zwei Möglichkeiten für die abschließende Übung. Eine "Videospiel-Option" und eine "Text-Adventure-Option".

source: Both options are divided into three parts. Each part should take about one week. The goals of this lab:
de: Beide Optionen sind in drei Teile unterteilt. Jeder Teil sollte ungefähr eine Woche benötigen. Die Ziele dieser Übung sind:

source: Get used to working on longer programs by breaking them into different functions, classes, and files.
de: Mache dich mit längeren Programmen vertraut, indem du sie in verschiedene Funktionen, Klassen und Dateien unterteilst.

source: Learn to search for code that does what you want, and adapt it into your program.
de: Lerne, nach Programmcode zu suchen, der genau das tut, was du willst, und passe ihn an dein Programm an.

source: Learn to break down large programs into smaller, easier to solve parts.
de: Lerne, große Programme in kleinere, leichter zu lösende Teile zu zerlegen.

source: Start creating a portfolio of work that you've done.
de: Beginne mit der Erstellung eines Portfolios von Arbeiten, die du erledigt hast.

source: See that programming can be a fun, creative outlet.
de: Erkenne, dass das Programmieren eine unterhaltsame und kreative Angelegenheit sein kann.

source: Apply the concepts we learned, such as variables, expressions, if statements, loops, lists, arrays, and more.
de: Wende die Konzepte an, die wir gelernt haben, zum Beispiel Variablen, Ausdrücke, ``if``-Anweisungen, Schleifen, Listen, Arrays und mehr.

source: This lab is worth 60 points. Each week, turn in what you have for the lab so you can "lock in" your score and get an idea of how you are progressing. When you get more done, resubmit the assignment.
de: Diese Übung ist 60 Punkte wert. Gebe jede Woche das ab, was du für die Übung getan hast, damit du deine Punktzahl "fest hältst" und eine Vorstellung davon bekommst, wie du vorankommst. Wenn du weitere Aufgaben erledigt hast, gib die Übung ab.

source: You can wait until the end to turn in your work until the end of the semester, but that is a very risky plan.
de: Du kannst bis zum Ende warten, um deine Arbeit bis zum Ende des Kurses abzugeben, aber das ist ein sehr riskanter Plan.

source: Video Game Option
de: Videospiel-Option

source: The video game option is the most popular option. Here are some videos of what students have done in prior years:
de: Die Videospieloption ist die beliebteste Option. Hier sind einige Videos von dem, was die Studierenden in früheren Jahren programmiert haben:

source: Using Images or Sounds from Other Sources
de: Verwenden von Bildern oder Sounds aus anderen Quellen

source: It is ok to use images and sounds from other sources if you cite the source.
de: Es ist in Ordnung, Bilder und Sounds aus anderen Quellen zu verwenden, wenn du die Quelle angibst.

source: Cite in the code comments what images and sounds you've used. So for every image or sound loaded, put a ``#`` tag in the line above with a citation on where it came from. I'll expect more than just a URL, give me a name of the website as well.
de: Zitiere in Kommentaren im Programmcode, welche Bilder und Sounds du verwendest hast. Füge für jedes geladene Bild oder jeden geladenen Sound einen mit ``#`` beginnenden Kommentar in der Zeile darüber ein, und gib an, woher er stammt. Ich erwarte mehr als nur eine URL, gib mir auch einen Namen für die Website und die Lizenz an.

source: For a professionally published game this would NOT be enough. You'd need to make sure you have license to use the work.
de: Für ein professionell veröffentlichtes Spiel wäre dies *nicht* genug. Du musst sicherstellen, dass du über eine Lizenz verfügst, um das Werk nutzen zu dürfen.

source: If you create your own image or sound, state that in the comments so I can be properly impressed.
de: Wenn du ein eigenes Bild oder einen eigenen Sound erstellst, gibt dies in den Kommentaren an, damit ich richtig beeindruckt werde.

source: Using Code from Other Sources
de: Verwenden von Programmcode aus anderen Quellen

source: If you find code to use that doesn't come from this website or from arcade.academy, cite it. Otherwise you'll be plagiarizing, and flunked from the class.
de: Wenn du Programmcode findest, der nicht von dieser Website oder von arcade.academy stammt, zitiere ihn. Sonst plagiierst du und fliegst aus dem Kurs.

source: Almost every semester I catch someone doing this. Please, just don't.
de: Fast jedes Semester ertappe ich dabei jemanden. Bitte, tu es einfach nicht.

source: Requirements for Part 1
de: Anforderungen für Teil 1

source: Each of the three parts for the final lab raises the bar on what your game needs to be able to do.
de: Jeder der drei Teile für die abschließende Übung legt die Messlatte für das, was Ihr Spiel tun muss, höher.

source: Open up a screen.
de: Öffne einen Bildschirm.

source: Set up the items to be drawn on the screen. Figure out the images that you want to use.
de: Richte die Elemente ein, die auf dem Bildschirm gezeichnet werden sollen. Plane welche Bilder du verwenden möchtest.

source: Provide some sort of player movement or interaction via mouse, keyboard, or game controller. Get items on the screen to move, if applicable.
de: Stellen Sie eine Art von Bewegung der Spielfigur oder Interaktion über Maus, Tastatur oder Gamecontroller bereit. Bewege gegebenenfalls Objekte auf dem Bildschirm.

source: Have something that is at least kind-of playable.
de: Erstelle etwas, das zumindest irgendwie spielbar ist.

source: **Tips:**
de: **Tipps:**

source: If your program will involve things running into each other, start by using sprites. Do not start by using drawing commands, and expect to add in sprites later. It won't work and you'll need start over from scratch. This will be sad.
de: Wenn dein Programm Dinge beinhaltet, die aufeinander treffen, verwende direkt Sprites. Beginne nicht mit Zeichnungsbefehlen und erwarte, dass du später Sprites hinzufügst. Es wird nicht funktionieren und du musst von vorne anfangen. Das wäre traurig.

source: If you are coding a program like mine sweeper or connect four, do *not* use sprites. Since collision detection is not needed, there is no need to mess with sprites.
de: Wenn du ein Programm wie "Mine Sweeper" oder "Vier gewinnt" programmierst, verwende keine Sprites. Da keine Kollisionserkennung erforderlich ist, musst du dich nicht mit Sprites herumschlagen.

source: While you can start with and use any of the example game code from this website or `arcade.academy`_, don't just turn these in as Part 1. You'll need to add a lot before it qualifies.
de: Du darfst zwar mit einem der Beispiel-Spielprogramme von dieser Website oder `arcade.academy`_ beginnen und dieses verwenden, aber stelle dieses nicht einfach als Teil 1 ein. Du musst eine Menge hinzufügen, bevor das als eigene Leistung gilt.

source: A very common mistake is to make a call to ``self.all_sprites_list.update()`` and ``self.physics_engine.update()``. This will cause you to warp through walls. You want to specifically update lists that don't include the player, like ``self.enemy_list.update()``.
de: Ein sehr häufiger Fehler ist der Aufruf von ``self.all_sprites_list.update()`` und ``self.physics_engine.update()``. Dies führt dazu, dass die Spielfiguren durch Wände tunneln. Du solltest speziell die Listen aktualisieren, die die Spielfigur nicht enthalten, wie ``self.enemy_list.update()``.

source: Remember that any extra white-space around your image will throw off collision detection. Best to check and trim white space from images you use.
de: Denke daran, dass ein zusätzlicher weißer Bereich um Ihr Bild die Kollisionserkennung auslöst. Am besten überprüfst und beschneidest du den weißen Bereich von Bildern, die du verwendest.

source: `OpenGameArt.org`_ has a lot of images and sounds you can use royalty-free.
de: `OpenGameArt.org`_ enthält viele Bilder und Sounds, die du kostenfrei verwenden kannst.

source: `Kenney.nl`_ has many images and sounds as well.
de: `Kenney.nl`_ hat auch viele Bilder und Sounds.

source: Requirements for Part 2
de: Anforderungen für Teil 2

source: For Final Lab Part 2, your game should be functional. A person should be able to sit down and play the game for a few minutes and have it feel like a real game. Here are some things you might want to add:
de: Für die finale Übung - Teil 2 sollte dein Spiel funktionsfähig sein. Jemand sollte in der Lage sein, sich für einige Minuten hinzusetzen und das Spiel zu spielen, und es sollte sich wie ein echtes Spiel anfühlen. Hier sind einige Dinge, die du vielleicht hinzufügen möchtest:

source: Be able to collide with objects.
de: Mit Objekten kollidieren können.

source: Players can lose the game if something bad happens.
de: Spieler können das Spiel verlieren, wenn etwas Schlimmes passiert.

source: On-screen score.
de: Spielstand auf dem Bildschirm.

source: Sound effects.
de: Soundeffekte.

source: Movement of other characters in the screen.
de: Bewegung anderer Charaktere auf dem Bildschirm.

source: The ability to click on mines or empty spots.
de: Die Möglichkeit, auf Minen oder leere Stellen zu klicken.

source: Requirements for Part 3
de: Anforderungen für Teil 3

source: For the final part, add in the last polish for your game. Here are some things you might want to add:
de: Füge für den letzten Teil den letzten Schliff für dein Spiel hinzu. Hier sind einige Dinge, die du vielleicht hinzufügen möchtest:

source: Title and instruction screens
de: Titel- und Anweisungsbildschirme

source: Multiple levels
de: Mehrere Level

source: Lots of Sounds
de: Viele Sounds

source: Multiple "lives"
de: Mehrere "Leben"

source: More types of enemies
de: Weitere Arten von Feinden

source: Heat seeking missiles
de: Hitze suchende Raketen

source: Hidden doors
de: Versteckte Türen

source: A "sweep" action in a minesweeper game or the ability to place "flags"
de: Eine "Sweep" -Aktion in einem Minensuchspiel oder die Fähigkeit, "Flaggen" zu setzen

source: Not interested in a video game? Continue your work from the "Adventure!" game.
de: Du interessierst dich nicht für ein Videospiel? Setze deine Arbeit am Text-Adventure-Spiel fort.

source: Rather than have each room be a list of ``[description, north, east, south, west]`` create a ``Room`` class. The class should have a constructor that takes in ``(description, north, east, south, west)`` and sets fields for the description and all of the directions. Get the program working with the new class. The program should be able to add rooms like:
de: Anstatt für jeden Raum eine Liste mit ``[description, north, east, south, west]`` zu erstellen, erstelle eine ``Room``-Klasse. Die Klasse sollte einen Konstruktor haben, der ``(description, north, east, south, west)`` aufnimmt und Attribute für die Beschreibung und alle Richtungen festlegt. Verwende die neue Klasse in deinem Programm. Das Programm sollte Räume in der folgenden Art hinzufügen können:

source: room = Room("You are in the kitchen. There is a room to the east.", None, 1, None, None) room_list.append(room) room = Room("You are in the living room. There is a room to the west.", None, None, 0, None) room_list.append(room)
de: room = Room("Du bist in der Küche. Es ist ein Raum im Osten.", None, 1, None, None) room_list.append(room) room = Room("Du bist im Wohnzimmer. Es gibt einen Raum nach Westen.", None, None, 0, None) room_list.append(room)

source: Later the program should be able to refer to fields in the room:
de: Später sollte das Programm in der Lage sein, auf Attribute im Raum zu verweisen:

source: Perhaps expand the game so that a person can travel up and down. Also expand it so the person can travel northwest, southwest, northeast, and southeast.
de: Vielleicht erweiterst du das Spiel, so dass eine Person nach oben und nach unten gehen kann. Erweitere es auch, so dass die Person nach Nordwesten, Südwesten, Nordosten und Südosten gehen kann.

source: Add a list of items in your game.
de: Füge eine Liste der Gegenstände in deinem Spiel hinzu.

source: Create a class called ``Item``.
de: Erstelle eine Klasse namens ``Item``.

source: Add fields for the item's room number, a long description, and a short name. The short name should only be one word long. This way the user can type ``get key`` and the computer will know what object he/she is referring to. The description will be what is printed out. Like ``There is a rusty key here.``
de: Füge Attribute für die Zimmernummer des Artikels, eine lange Beschreibung und einen kurzen Namen hinzu. Der Kurzname sollte nur ein Wort lang sein. Auf diese Weise kann der Benutzer ``get key`` eingeben und der Computer weiß, auf welches Objekt er sich bezieht. Die Beschreibung ist das, was ausgegeben wird. Wie ``Hier liegt ein rostiger Schlüssel.``

source: Create a list of items, much like you created your list of rooms.
de: Erstelle eine Liste mit Elementen, ähnlich wie du deine Liste mit Räumen erstellt hast.

source: If the item is in the user's room, print the item's description.
de: Gib die Artikelbeschreibung aus, wenn sich der Artikel im aktuellen Raum befindet.

source: Test, and make sure this works.
de: Teste, und stelle sicher, dass dies funktioniert.

source: Change your command processing, so rather than just allowing the user to only type in directions, the user will now start having other options. For example, we want the user to also be able to type in commands such as get key, inventory or wave wand.
de: Ändere deine Befehlsverarbeitung, sodass der Benutzer nicht nur Anweisungen eingeben darf, sondern jetzt auch andere Optionen hat. Zum Beispiel möchten wir, dass der Benutzer auch Befehle wie "get key", "inventory" oder "wave wand" eingeben kann. (Natürlich darfst du dein Adventure auch auf Deutsch erstellen.)

source: To do this, don't ask the user What direction do you want to go? Instead ask the user something like What is your command?
de: Frage den Benutzer dazu nicht, "In welche Richtung möchten Sie gehen?". Bitte stattdessen den Benutzer um etwas, wie "Was ist Ihr Kommando?".

source: Split the user input. We need a variable that is equal to the first command they type, such as get and a different variable equal to the second word, such as key.
de: Teile die Benutzereingabe auf. Wir brauchen eine Variable, die dem ersten Befehl entspricht, den sie eingeben, wie zum Beispiel "get" ("nimm"), und eine andere Variable, die dem zweiten Wort entspricht, wie zum Beispiel "key" ("Schlüssel").

source: Use the split method that's built into Python strings. For example: ``command_words = user_command.split(" ")`` This will split what the user types into a list. Each item separated out based on spaces.
de: Verwende die in Python-Strings integrierte Methode ``split`` zum Aufteilen. Zum Beispiel: ``command_words = user_command.split(" ")``. Dies teilt das, was der Benutzer eingibt, in eine Liste auf. Jedes Element wird nach Leerzeichen getrennt.

source: Update your code that processes the user typing in directions, to check command_words[0] instead of whatever you had before.
de: Aktualisiere deinen Programmcode, der die Eingabe von Anweisungen durch den Benutzer verarbeitet, um ``command_words[0]`` zu überprüfen, anstatt dessen, was du zuvor hattest.

source: Add a get command.
de: Füge ein "get'-Kommando hinzu.

source: Add a check for a get command in your if/elif chain that is now just processing directions.
de: Füge eine Überprüfung für ein "get"-Kommando in deine ``if``/``elif``-Kette ein, die jetzt nur noch Anweisungen verarbeitet.

source: Search the item list until you find an object that matches what the user is trying pick up.
de: Durchsuche die Objektliste, bis du ein Objekt finden, das mit dem übereinstimmt, was der Benutzer aufheben möchte.

source: If the object isn't found, or if the object isn't in the current room, print an error.
de: Wenn das Objekt nicht gefunden wird oder wenn sich das Objekt nicht im aktuellen Raum befindet, gib einen Fehler aus.

source: If the object is found and it is in the current room, then set the object's room number to -1.
de: Wenn das Objekt gefunden wurde und es sich im aktuellen Raum befindet, setze die Raumnummer des Objekts auf -1.

source: Add a command for "inventory" that will print every object who's room number is equal to -1.
de: Fügen Sie einen Befehl für "Inventar" hinzu, mit dem jedes Objekt ausgegeben wird, dessen Zimmernummer gleich -1 ist.

source: Add the ability to drop an object.
de: Füge die Fähigkeit hinzu, ein Objekt fallen zu lassen.

source: Add the ability to use the objects. For example "use key" or "swing sword" or "feed bear."
de: Füge die Fähigkeit hinzu, die Objekte zu verwenden. Zum Beispiel "get key" ("benutze Schlüssel") oder "swing sword" ("schwinge Schwert") oder "feed bear" ("füttere Bär").

source: Expand the game some more. Try some of these ideas:
de: Erweitere das Spiel noch etwas. Probiere einige dieser Ideen aus:

source: Create a file format that allows you to load the rooms and objects from a file rather than write code for it.
de: Erstelle ein Dateiformat, mit dem du Räume und Objekte aus einer Datei laden kannst, anstatt Programmcode dafür zu schreiben.

source: Have monsters with hit points.
de: Monster mit Trefferpunkten, die erst sterben wenn die Trefferpunkte null werden.

source: Split the code up into multiple files for better organization.
de: Teile den Programmcode zur besseren Organisation in mehrere Dateien auf.

source: Remove globals using a main function as shown at the end of the chapter about functions.
de: Entferne globale Variablen mithilfe einer Hauptfunktion, wie am Ende des Kapitels über Funktionen gezeigt.

source: Have objects with limited use. Like a bow that only has so many arrows.
de: Objekte mit begrenzter Verwendung. Wie ein Bogen, der nur eine bestimmte Anzahl von Pfeilen hat.

source: Have creatures with limited health, and weapons that cause random damage and have a random chance to hit.
de: Kreaturen mit eingeschränkter Gesundheit und Waffen, die zufälligen Schaden verursachen und zufällige Trefferchancen haben.

source: Tips
de: Tipps

source: Commit and push your code often. It is not unusual for something bad to happen to the code while you are working on this assignment. Anything you commit and push we can recover. Don't work for more than a couple hours without doing this.
de: Commit und push deinen Programmcode häufig. Es ist nicht ungewöhnlich, dass etwas Schlimmes mit dem Programmcode passiert, während du an dieser Aufgabe arbeitest. Alles, was du commitet und gepusht hast, können wir wiederherstellen. Arbeite nicht länger als ein paar Stunden, ohne dies zu tun.

source: I give a lot of in-class lab time for this project. Use it. Don't leave early.
de: Ich gebe viel Übungszeit im Kurs für dieses Projekt. Nutze sie. Geh nicht zu früh.
